{"Title":"Brazil Fazenda Alta Vista","Overview":"Culmination of roasted nut and cocoa bittering aspects, burned caramel, almond and pecan, hazelnut chocolate, chocolate dipped almond brittle, and a hint of apple butter. City to Full City+. Good for espresso.","Score":86.5,"URL":"https://www.sweetmarias.com/brazil-fazenda-alta-vista-7171.html","SKU":"GCX-7171","FarmNotes":"Alta Vista Farm lies in the foothills of Serra da Mantiqueira, in the Carmo de Minas municipality. This area is known for coffee cultivation, with relatively good altitude for Brazil, and favorable micro climates for both growing and drying coffee. Alta Vista is 84 hectare farm that was started less than a decade ago, and taking 7th position at Brazil Cup of Excellence competition in 2007, just 3 years after being planted. This is an all Yellow Bourbon separation, a cultivar thought to have higher sugar brick count than the red variety, and this coffee definitely has a persistent sweetness to show. This is a dry process coffee, meaning the whole cherry is left intact to the coffee seed (bean) during the drying phase. This tends to produce bigger body, more muted acidity, and occasionally impart fruited flavors in the cup. We found City+ to be the ideal starting point for Alta Vista, which is where a balancing level of sweet and bittering roast tones are achieved. But even keeping this Brazil to City roast level made for a tasty cup.","CuppingNotes":"The coffee from Alta Vista Farm presents a nice culmination of roasted nut and cocoa bittering aspects, showing the most balance around City+ roast level (and even some slight fruit too!). This is where nuanced roast tones are complimented by caramel hints, with almond and pecan flavors folded in. The cup has a nice simple sweetness, touching on burned caramel and hazelnut chocolate. As it cools, the focal point remains centered around a caramel nut and bittersweet chocolate core, our flavor descriptors landing squarely on chocolate dipped almond brittle. But there's also a muddled fruit flavor in the background of the lighter roasts that hints at apple butter and blackberry tea. Alta Vista is a full-bodied coffee that brews nicely at a surprisingly wide roast range, also filling the need for a chocolate toned espresso when roasted to Full City/Full City+.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 16-18 Screen","Arrival date":"March 2022 Arrival","Bag size":"59 KG","Cultivar Detail":"Yellow Bourbon","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Estate","Lot size":"100","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Carmo de Minas","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Brazil Patrocínio Fazenda Escalada","Overview":"Body and bittersweetness are central to the cup profile, notes of sticky natural sweeteners like sorghum syrup and molasses, peanut butter cookie, and lasting chocolate roast tones. City+ to Full City+. Good for espresso.","Score":86,"URL":"https://www.sweetmarias.com/brazil-patrocinio-fazenda-escalada-7141.html","SKU":"GCX-7141","FarmNotes":"The 227 hectare Fazenda Escalada is jointly operated by Vicente Ferreira Goncalves and Paulo Ferreira Gonçalves in Patrocinio, Minas Gerais. The farm is planted in a variety of cultivars, but this particular lot is a separation of Yellow Catuaí and Paraiso. Coffee is both manually and mechanically harvested at Fazenda Escalada. After the coffee cherry is picked, it is carefully graded by first floating in water in order to separate out all the underripe coffee that floats to the top. The heavy coffee that sinks will be processed as the top grade, while the \"floaters\" are processed separately. The top grades are then moved to raised drying tables and cement patios, where workers continue to turn the coffee to facilitate even drying, pulling out any physical defects by hand as they work. The result is a very nicely sorted, uniform looking green coffee.","CuppingNotes":"Full City roasts have a strong molasses scent in the dry fragrance that lends a sweet counterpoint to hints of leather, and dry roasted peanut. A cooked cherry note compliments the wet aroma, with a fair amount of chocolate roast bittering, and marzipan accent. Body and bittersweetness are a big part of the cup at City+/Full City, and the flavor profiles encompass bitersweet chocolate, rustic roasted nibs, and sticky natural sweeteners like sorghum syrup and molasses. A sweet nutty flavor comes up as the coffee cools, revealing a note of peanut butter cookie that connects to lasting bittering cocoa aftertaste. Based on body and bittersweetness alone, Fazenda Escalada will make an ideal Brazil for espresso, offering classic bittersweetness as a solo shot, or adding creamy body and layered chocolate roast flavors as an espresso blend component.","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 16-18 Screen","Arrival date":"January 2022 Arrival","Bag size":"30 KG","Cultivar Detail":"Yellow Catuaí","Drying Method":"Raised Bed Sun Dried","Grade":"Estate","Lot size":"56","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Patrocínio, Cerrado de Minas","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Brazil Pulp Natural Fazenda IP","Overview":"Bittersweet cacao notes are balanced by flavors of burnt sugar, barley malt, corn syrup, and a pleasant bittering of baking chocolate in the aftertaste. Very versatile Brazil. City+ to Full City+. Good for espresso.","Score":86.3,"URL":"https://www.sweetmarias.com/brazil-pulp-natural-fazenda-ip-7174.html","SKU":"GCX-7174","FarmNotes":"Fazenda IP is located in the city of Carmo de Minas, Brazil. It's a rather massive farm really, at about 130 hectares ( roughly 320 acres), and is owned and operated by the folks at Sertao, the Pereira family. The name Sertao is synonymous with coffee production in the area, as they were the first to cultivate coffee in the Minas Gerais region of Carmo. This family has a 100+ year history of growing coffee in this area, and the Pereira family lots grace the COE finals list year after year. There are several varietals grown at IP, but this lot is a separation of entirely Yellow Bourbon. This is a pulp-natural coffee, which means that unlike a washed coffee, they mechanically remove most, but not all of the sticky fruit/mucilage before laying the beans out to dry. Pulp natural processing often lends to body as well as imparts slightly more fruited or rustic flavors. However in Brazil - where dry processing is widely used due to a near-perfect climate for it - pulp natural is the less fruited and rustic processing method.","CuppingNotes":"At City+ roast level, the dry grounds of Fazenda IP smelled of sweet breads and cocoa, something like chocolate marble bread came to mind, as well as a hint of dried apple. The wet grounds are loaded with chocolate-covered nut smells, and a fruitier accent note in the steam that's like apricot fruit leather. One of my roasts was actually City, which surprisingly didn't come off as being too light. Granted, I much preferred my City+/Full City roasts, where bittersweet cacao notes were balanced by burned sugar sweetness, the cup cooling to flavors of maltose, corn syrup, and a pleasant bittering aspect of baking chocolate in the aftertaste. This is a versatile Brazil, with a balanced profile across the roast spectrum. Works great as espresso, and as an option for milk drinks too (both espresso and brewed coffee).","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen","Arrival date":"March 2022 Arrival","Bag size":"59 KG","Cultivar Detail":"Yellow Bourbon","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Estate","Lot size":"70","Packaging":"Ecotact Liner","Processing":"Pulp Natural","Recommended for Espresso":"Yes","Region":"Carmo de Minas","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Burundi Gatara Masha","Overview":"So sweet at a wide range of roasts, honey, sugar in the raw, honeysuckle, spiced flecks of cinnamon and all spice, essence of dried papaya, cascara fruit tea, lemony vibrance, and chocolatey dark roasts. City to Full City+. Good for espresso.","Score":89.1,"URL":"https://www.sweetmarias.com/burundi-gatara-masha-7076.html","SKU":"GCX-7076","FarmNotes":"Masha Station is a coffee cherry collection site located in Gatara Commune, Kayanza, Burundi's northern province that borders neighboring Rwanda. The washing station acts as a central delivery site for a few thousand small holder famers who occupy the hills surrounding Masha. The name comes from the Kirundi word \"amasho\" that means \"herds of cattle\". That makes sense seeing that cattle herding just might rival coffee farming in the Masha region! Farmers grow mostly older bourbon types, the original coffee cultivar introduced to the area in the 1930s by Catholic monks traveling from the island of Reunion. Masha coffee washing station (\"CWS\") sits at just under 1700 meters above sea level, and many of the farmers have coffee planted much higher than this. They've been around since 1989, and in 2012 were top placement in Burundi Cup of Excellence competition, no small task. Masha roasts easily, very little roast color variance as you move from yellowing, to browning, and onto first crack. It helps that the sort is so good, with little to no trace of underripe coffee in the few hundred grams of coffee that we roasted.","CuppingNotes":"This coffee from Masha has spiced sweetness in the dry fragrance, a mixture of baking spices and dark, raw sugars, along with sweet-to-tart fruited accents. City and City+ roasts smell very clean, and the wet aroma takes on characteristics of cinnamon honey butter with a touch of apricot wafting in steam. Masha is a clean tasting coffee and an example of just how versatile Burundi coffees can be in the roaster. The cup is sweet across a wide range of roasts, base flavors coming across like honey, sugar in the raw, and a nice vibrant lemon side too. City roasts have a distinct honey-floral note that comes across like raw honey flavor and the aroma of a honeysuckle flower. The coffee cools to spiced flecks of cinnamon and all spice powder up top, that along with essence of dried papaya, and cascara fruit tea, culminates in a lovely, delicate aroma. Full City roasting brings about roast tones you'd expect, but also matched by intense burned sugar sweetness, and dark fruit accent note. Masha is well worth a run through your espresso machine if you're looking for a single origin espresso option that offers flavors of sweetened cocoa with fruited and spiced highlights.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Lot size":"46","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Gatara Commune, Kayanza Province","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Burundi Gaterama Agahore Station","Overview":"Agahore is aromatic and sweet, maple syrup, sugar in the raw, whole clove, peach skin accent, aromatic bitters syrup, a hint of floral rooibos tea, and moderate lemon acidity in all our roasts. City to Full City.","Score":88.3,"URL":"https://www.sweetmarias.com/burundi-gaterama-agahore-station-7078.html","SKU":"GCX-7078","FarmNotes":"This coffee comes from the Agahore farm and wet mill site in Gaterama village, located in the greater Gitega Province. With the Mubarazi River running through the land, they have good access to water for wet processing, and have implemented a water separation/filtration system to clean dirt and debris from the water before using to process coffee. Agahore is close to the Murambi site, another washing station we buy coffee from, and also managed by the same person. There is much community involvement in managing both sites, actually, and the workers are provided with second payments at the end of each harvest season after all of the coffee is sold, health insurance for workers and their families, and a fertilizer program with free goats. The cultivars planted are mostly Bourbon, and Mibirizi, an older cultivar to the region that likely has Typica genetic roots. We also purchased a dry process lot from Agahore station that will be available very soon.","CuppingNotes":"The dry fragrance of this washed Agahore lot has a sweet scent of sugar cane juice, dried currant, and an array of herbal tea-like hints too. I was wow'd by the intense sweetness that came up after adding hot water, a perfumed aroma of maple frosting, with mild fruit hints, and clove note in the steam. It's funny tasting this coffee right after cupping a South American lot that I noted as having \"tea-like\" cup characteristics. While I stand by that observation, it makes Agahore taste like actual tea in comparison! The cup is delicious, with brisk acidic impression, and solid core sweetness underneath it all. I found the cup to be a little less fruited than some of the other wet process lots in this container, but it still offers a tasty hint of peach skins, and little bit of lemon in light roasts. The coffee flavors are fairly crisp, and absolutely clean, offering glimpses of Assam, sugar in the raw, whole clove, aromatic bitters syrup, and a hint of floral rooibos tea. You'll find that the sweetness is easily developed with roast too (though City roasts are plenty sweet!), and shimmering lemon acidity hangs around to at least Full City roast level.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Lot size":"28","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Gaterama Village, Gitega, Bugendana Commune","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Burundi Yeast Fermentation Yandaro","Overview":"Pronounced tea notes and baking spice aroma, Earl Grey, Good Earth and green tea, cinnamon gum, cardamom, a lively lemon note, while darker roasts unlock cinnamon-spiced chocolate and a dark fruit hint. City to Full City. Good for espresso.","Score":90.5,"URL":"https://www.sweetmarias.com/burundi-yeast-fermentation-yandaro-7073.html","SKU":"GCX-7073","FarmNotes":"This is a special process experiment managed by the Yandaro Station in Kayanza, Burundi's northern province that borders neighboring Rwanda. An outside company in Belgium has developed yeast strains specifically for coffee processing. When I heard \"yeast process\", I immediately thought \"faster fermentation\". That's actually not the case. This particular yeast helps to stabilize fermentation, even at very low water temperatures, and is said to enhance cup flavors, acidity and body. Unlike the typical washed coffee Yandaro processes, this yeast coffee (they call it \"Oro Anaerobic\") is fermented in plastic tanks sealed off from the outside air (anaerobic, in that way), with water and yeast, and takes 36 hours to complete. That's a fairly long fermentation time, considering their regular wet process coffee ferments for around 12 hours. Is it really all that different? I think in terms of body and acidity, yes. The cup is bright at a range of roasts and body is opaque, and the intensity of these two characteristics alone set them apart. Yandaro sits at just under 1800 meters above sea level, though many farmers have coffee planted higher than this. Yandaro was built in the mid 1980s, a time when the World Bank was investing heavily in Burundi's coffee sector, building out washing stations like Yandaro to serve the surrounding coffee communities. More recently they've come under the direction of a Burundi coffee investment group who are able to offer Yandaro, and several other Kayanza stations (Kibingo is another), agronomical assistance to station members, regular maintenance of washing station equipment and drying beds, and management teams who follow the coffee deliveries from cherry selection, to keeping lots separated by quality tiers. Since partnering with this group, several of the stations have seen top placement in Burundi coffee competitions, including Yandaro placing 7th and 19th in recent Burundi Cup of Excellence competitions.","CuppingNotes":"This coffees been processed with the addition of a specially formulated yeast produced specifically for coffee. The idea was to create a product that aids in the fermentation stage of wet processing by helping to create a stable environment, and also enhancing the cup. We've tasted some of the tests over the last couple of years and there's often a discernible difference from between lots from the same station processed with and without the yeast. This lot from Yandaro specifically tasted fairly close to the wet process lot we also bought, but acidity seemed a tad more brisk in light roasts, as well as more pronounced tea notes, and baking spice aromatics. To be honest, you can't go wrong with either lot, as they both stood out as exemplary Burundi's! The dry fragrance showed a sweetness of raw sugars spiced with whole clove and cardamom cookie, and a whiff of peach tea unfurled in the steam after pouring the hot water. The cup showed a wide range of tea flavors in the light City roasts, including hints of aromatic Earl Grey, lemon herbal tea, and a lightly fruited green tea note too. Burundi coffees can be quite aromatic, and Yandaro certainly is. Notes of cinnamon gum, Good Earth tea, Chai spice, and cardamom powder mark the aroma and finish, and play a big part in the boosting that complexity score above 9. Acidity helps too, Yandaro showing a lively lemon note that adds more than a touch of vibrance to the cup. Full City roasts are just as delicious, developing a caramelized sweetness, dark fruit note, and a sturdy flavor of cocoa powder, that along with a cinnamon accent, brings to mind Mexican drinking chocolate.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-18 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Lot size":"20","Packaging":"GrainPro Liner","Processing":"Yeast Process, Anaerobic","Recommended for Espresso":"Yes","Region":"Kabarore Commune, Kayanza Province","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Colombia Inzá Vereda Guanacas","Overview":"Flavor notes from complex sugars to clean fruited hints, like apple, Monukka raisin, dried fig, pumpkin pie with whipping cream, and a honeyed flavor that hangs on in the aftertaste. City to Full City+. Good for espresso.","Score":87.4,"URL":"https://www.sweetmarias.com/colombia-inza-vereda-guanacas-7166.html","SKU":"GCX-7166","FarmNotes":"This blend of coffee from Inzá is made up of coffees from 2 neighboring producers in Vereda Guanacas, Inzá. (\"Vereda\" being the equivalent of a small neighborhood, or village). The province of Inzá is located in Southwestern Colombia within the greater Department of Cauca. As you make the drive from La Plata to Inzá, you follow the Rio Páez, and an eventual crossing over a suspension bridge lands you on the road to the the villages whose coffees make up this blend. Like much of Colombia, Cauca is home to some very high altitude farms, many breaching the 2000 meter mark, the coffee from this lot harvested from an altitude range of about 1750 to 1900 meters. The way we make up these regional blends is by cupping several samples from the individual farms, separating out those that meet a certain cup criteria, and then blending them together. It's a great benefit to us (and not to mention the cup) having this level of quality control with our Colombian blends. This is a wet-processed coffee, most farmers using old style hand-cranked pulpers, fermenting and washing in the same tank, and then drying out on raised, covered beds. Most farms have a healthy amount of Caturra planted, as well as some Timor hybrids (like Variedad Colombia and Tabi) in response to the major leaf rust outbreak in the 1980's. ","CuppingNotes":"City+ roasts have a chocolate undertone that provides a contrasting backdrop to some of the more subtle top notes. The dry fragrance smells of chocolate pistachio, a hint of fruit and nut bar, and slightly infused with honey. The wet crust too has a depth of sweetness, with a note of butterscotch, along with more fruit than the dry fragrance let on, like apple cooked in brown sugar, a layer of chocolate in there, and walnut hint. Lighter roasts show some honey in the sweetness that clings to the palate long into the aftertaste. Flavor notes go from complex sugars to a clean fruit hints, such as Monukka raisin, a tropical fruit hint, and sticky dried fig. Guanacas has such a creamy mouthfeel in the middle roasts that's feels darn near the weight of milk! I also pick out a nice whipping cream flavor note at City+, and some sweet pumpkin pie filling. Full City increases in dark chocolate low tones, without diminishing the immense sweetness found in lighter roasts. A wonderful brewed coffee, with incredibly complex sweetness, and top note highlights that go long into the aftertaste. A true dual-use coffee too, sure to please those looking for a sweet SO espresso.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 screen","Arrival date":"April 2022 Arrival","Bag size":"70 KG","Cultivar Detail":"Bourbon, Caturra, Catuai, Typica","Drying Method":"Covered Sun-Dried","Farm Gate":"Yes","Grade":"Estate","Lot size":"26","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Guanacas, Inzá, Cauca","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Congo Organic Kirumba Kavisa","Overview":"Excellent sweetness, with a lively citrus side that places it in line with many of our Kenyan coffees. Sweet fruity notes of grape and currant, tart orange acidity, and earthy Matcha tea note underscores a tannic finish. City to Full City.","Score":88,"URL":"https://www.sweetmarias.com/congo-organic-kirumba-kavisa-7156.html","SKU":"GCX-7156","FarmNotes":"Kavisa is the name of the town where this coffee washing station (\"CWS\") is located. It's almost smack dab in the middle of lakes Edward and Kivu, in the mountainous North Kivu region (Kirumba is the name of the larger area). This is a fully washed, certified Organic coffee, though the mill also produces dry process too. Of the two process types we cup tested, this washed lot had the most cup clarity, sweetness, and a tangy citrus quality that really set it apart from the rest. Kavisa CWS sits at 1632 meters above sea level, though farms in the surrounding peaks max out around 1800 meters. Farmers grow 100% Bourbon cultivar, known for favorable sweetness and acidity when grown in high altitudinal regions such as this.","CuppingNotes":"Pronounced sweetness of light brown sugar and cream caramel come through in the dry fragrance, with hints of sweet spice and chocolate. The wet aroma draws out distinct cooked sugar smells, like a crisped caramelized crust, along with a layer of orange pulp underneath. I find this Congo lot to have excellent sweetness in light and middle roasts, and with a lively citrus side that places it in line with many of our Kenyan coffees. The hot cup gives way to sweet fruity notes of grape and currant as it cools, a tart orange flavor that highlights a bright acidity, and an earth-toned Matcha tea note that underscores a tannic finish. Taking the roast into Full City brings out flavors of maple cream filled chocolate, cocoa butter in both flavor and silky mouthfeel, and some juicy dark fruits underneath. A delicious Congo coffee that will show quite well under a variety of brew methods too!","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"March 2022 Arrival","Bag size":"60 KG","Certifications":"","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Grade":"Grade 1","Lot size":"40","Packaging":"Ecotact Liner","Processing":"Wet Process (Washed)","Region":"Kavisa, Kirumba","Roast Recommendations":"City to Full City","Type":"Organic/Fair Trade Cert."}}
{"Title":"Espresso Workshop #49 Balayage","Overview":"Fruited flavors tempered by bittersweetness, Ghirardelli dark chocolate chips, ganache filling, chocolate banana pudding, cherry cordials, dried blueberry aroma, orange hint, and smokey cacao finish. Full City to Full City+. Good for espresso.","Score":89.3,"URL":"https://www.sweetmarias.com/espresso-workshop-49-balayage-7198.html","SKU":"GCX-7198","FarmNotes":"What happens when you ask two middle aged men to find a modern hair dye technique name to use for our 49th edition of the Espresso Workshop blends? You wind up with an outdated name like \"Balayage\"! At least that what we're told by someone much more savvy than us (to be fair, the contemporary term mentioned for this type of hair dying is \"hair melt\", which is a lot less appetizing in my opinion!). For the uninitiated, the technique involves brushing highlights over a base color in a graduated fashion so that the colored strands stand out, but are also blended in with what's underneath. That's the idea with this Workshop espresso blend too. The three coffees that went into Balayage - wet and dry processed Ethiopias, and a wet process Peru - are all quite different, especially when roasted light. But when taken to Full City, their combined bittersweetness provides an inky chocolate base note, topped with well-integrated highlights that each coffee brings to the picture. I roasted three batches for this review, the best for espresso being Full City (32F post 1st Crack), and Full City+ (45F post 1st Crack with a few 2nd snaps in the cooling tray). These more developed roasts guarantee immense chocolate flavors, with light fruited accent notes from the Ethiopian components, and as much body as any espresso we've offered! (we scored it 9.8 out of 10!). I've included notes on my experience brewing a City+ roast too, but I personally think Workshop #49 is best suited for darker roasted espresso. Balayage is a nice addition to our other espresso blends, offering a slightly more fruited take on Espresso Monkey if I had to made a comparison. It's fantastic solo, and shorter pulls are going to bring out a little more acidity if you're after a brighter shot. Full City+ is the target for an espresso that will stand up to milk.","CuppingNotes":"Balayage was blended with espresso in mind, but I also enjoyed a City+ roast as brewed coffee. The body is certainly something you can sink your teeth into, and so is bittersweetness. Chocolate roast flavors are surprisingly intense, with a dark berry note that is subtle at first, but gains momentum as the coffee cools off. Acidity level is also of note at this roast level, and is underscored by a flavor of red apple that blends well with the chocolatey undertones. For espresso, Full City is the minimum roast level we recommend. Of the two darker roasts I produced, it was also my favorite. I'm a sucker for fruited flavors in my espresso, especially when tempered by bittersweetness, and Balayage really delivers on those two fronts. The bittersweetness comes off in dense flavor layers at Full City and Full City+, producing profiles of high % cacao bar, Ghirardelli dark chocolate chips, ganache filling, and a rich flourless chocolate torte note. The cocoa characteristics are intense, to say the least, and do well to ground the fruited top notes that peek through, but never dominate. My initial Full City shot displayed notes of chocolate banana pudding, cherry cordials, and an orange flavor that's tangy but with brightness kept in check by sipid bittersweetness. At Full City+ (45F beyond 1st C, with a few 2nd cracks in the cooling tray), the creamy texture coats your palate and leaves behind a contemplative finish of smokey roasted cacao nibs, sweetened condensed milk, and a bit of dried blueberry in the aroma. Balayage is a nice addition to our other espresso blends, offering a slightly more fruited take on Espresso Monkey if I had to compare it one of them. It's fantastic solo, and shorter pulls are going to bring out a little more acidity if that's what you're after, while Full City+ is the target for an espresso that will stand up to milk.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 14-17 Screen - a few partial quakers from the dry process component","Arrival date":"All current crop coffee","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars, Bourbon, Caturra, Typica","Drying Method":"Patio and Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Top Grades","Lot size":"48","Packaging":"GrainPro Liner","Processing":"Wet Process, and Dry Process coffees","Recommended for Espresso":"Yes","Region":"Peru, Ethiopia","Roast Recommendations":"Full City to Full City+ - I don't recommend a rolling 2nd Crack","Type":"Farm Gate"}}
{"Title":"Ethiopia Agaro Kedamai","Overview":"Kedamai makes a syrupy sweet coffee with hefty stone fruit flavors like juicy apricot nectar, and peach preserves, aromatic mulling spices, delicate orange blossom, and a peach tea note. City to Full City. Good for espresso. ","Score":91,"URL":"https://www.sweetmarias.com/ethiopia-agaro-kedamai-7053.html","SKU":"GCX-7053","FarmNotes":"Kedamai cooperative is located in the Agaro region of Western Ethiopia, organized by locals in this particular Woreda with the express purpose of building a wet mill to serve the farmers in the area. Between a loan from a local coop bank, and earnest money the 180 farm members pulled together, they were able to get enough cash to build out the Kedamai washing station infrastructure including a Penagos 2500 coffee depulper. Last year (their first year) they expected to produce roughly 700 bags of coffee, and this year exceeded that mark. Being newer, they are receiving training from surrounding mill managers on things like operating their depulper, grading coffee cherry, and general management of the workflow at the station site. The water for processing is very clean because they are taking it from a stream above the washing station, not from the river below. One thing I noticed is that the coffee is a fairly wide range of screen sizes, from as small as 15 (maybe even 14), to some pretty large beans that look to be around 19 screen. ","CuppingNotes":"Kedamai fits right in with our nicer Western Ethiopian coffees, a cup profile with transparent sweetness and marked by juicy stone fruit and subtle floral character too. City and City+ roasting showcase a peach juice aspect too that I think carries a bit more vibrance and 'pep' than some of the others. Aromatically speaking, Kedamai is marked by stone fruit and heady wafts of sugar browning sweetness, faint floral and mulling spice accents coming into view after pouring the hot water. In one sense the brewed coffee of Kedamai has a robust quality in terms of body and syrupy sweetness, but it also displays some delicate perfumed top notes too. The cooled cup offers glimpses of orange blossom florals and peach tea. I don't know what it is about the coffees from the West, but so many of them yield syrupy-sweet stone fruit flavors, and Kedami does just that, with notes of apricot nectar, and peach preserves. Sugar browning sweetness is stronger at City+, but thankfully does little to tone down the fruited intensity, and body seems a little more dense with this incremental degree of roast. I'm going to recommend keeping Kedamai light and bright for brewed coffee in order to keep from diminishing the perfumed qualities found at City and City+ roast levels. But for espresso, we found that Full City roasts are outta sight. Acidity is more moderate than some of our other Ethiopian coffees, and flavors of orange citrus fold in nicely with persistent bittersweet chocolate roast tones and stone fruit accents.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15 -17 Screen","Arrival date":"October 2021 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"25","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Agaro Town, Jimma","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Ethiopia Gera-Goma SWP Decaf","Overview":"This blend of wet and dry process coffees makes a tasty decaf, floral honey sweetness, natural dried apricot, saffron and chicory aromatics, and fruited chocolate flavor when roasted dark. City to Full City.","Score":87.8,"URL":"https://www.sweetmarias.com/ethiopia-gera-goma-swp-decaf-7085.html","SKU":"GCX-7085","FarmNotes":"Our latest Swiss Water decaf is a blend of Ethiopian coffees from two different sources. Roughly 60% of the blend is a wet process coffee from Gera region of Western Ethiopia by way of the Telila washing station. It's made up of hundreds of small holders in the region, and on its own offered clean sweetness, with mild stone fruit hints. The other 40% is a more fruit-forward dry process lot from the 30 hectare farm of Aba Dega in Bashasha town, Goma region. Aba Dega focuses solely on dry process coffees, and we've been fortunate to buy from him the past 3 years since he first exported coffee under his own name. There's no way around decaffeination having some negative impact on cup quality, and we've found that adding the fruitier naturals to the equation helps lock in some of what we think of as Ethiopian origin characteristics. That's certainly the case here! And that's the beauty of using a gentle decaffeination process like the Swiss Water method, where much of the volatile compounds that affect flavor and aroma are preserved post-decaf. You can read more about the Swiss Water decaf method and how it compares to other types of decaffeination HERE.","CuppingNotes":"The coffee has a rustic chicory smell in the dry fragrance, but not without its fair share of fruit/fructose sweetness, molasses bread, and dried fruit. The wet aroma showed hefty bittersweetness in both my lighter and darker, Full City roasts. The chocolatey smells were on the rustic side, and again, produced a bit of chicory, or saffron. Acidity has a presence in the cup, which is always pleasant in decaf, seeing that it's often quashed by process, the coffee that was used, or both. The fruit flavors are a bit lower intensity than our previous lot, which makes sense seeing that the previous Benti Nenka lot was 100% dry process, and this is more like 40%. Still, the cooling coffee produces a delicious accent of natural dried apricot. Cup sweetness brings to mind honey, that is even a little floral, which underscores coffee origin. There are some decafy notes too - savory, pumpernickel, and yes, chicory - especially in the lighter roasts. But the compromise here is that light roasts are where you'll find higher acidity, and the fruit is a bit more complex. But Full City roasts brewed very well too, intense with chocolate roast flavors, and also something like plum in the mix.","Images":null,"AdditionalAttributes":{"Appearance":".9 d/300gr, 14-17 Screen - mostly nicked, broken beans from decaffeination","Arrival date":"November 2021 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"69","Packaging":"GrainPro Liner","Processing":"Wet and Dry Process, then SWP Decaf","Region":"Gera, Jimma and Bashasha, Goma","Roast Recommendations":"City to Full City","Type":"Farm Gate, Decaf"}}
{"Title":"Ethiopia Guji Gorebeti SWP Decaf","Overview":"A uniquely fruited decaf that shows a lot of origin character and dry process flavors, red fruits reinforce a juicy mouthfeel, notes of stewed peach, baked pear, fruit compote, a hint of pumpernickel. City to City+.","Score":88,"URL":"https://www.sweetmarias.com/ethiopia-guji-gorebeti-swp-decaf-7194.html","SKU":"GCX-7194","FarmNotes":"This newest Ethiopia Swiss Water decaf is a blend of coffees from two Guji areas that, while technically in different Woredas (one in Gedeb, the other Hambela), they are literally just across the regional border from each other, and in very close proximity. Instead of going with a hyphenated name as we've done with some of the past regionally blended lots, we opted for using \"gorebeti\", the Amharic word for \"neighbor\". One unique feature of this decaf is that both coffees we used are dry process, which we've found lends to a much more fruit-forward decaf than washed, or even when blending the two process types. Half of this lot is made up of coffee from a washing station in Hambela Buliye, who don't have good access to water and are only producing dry process coffees at this time. The other half is from a single farm in Banko Chelchele called \"Mengesha Gumi\". As non-decaf, both coffees offered berry fruits and an undercurrent of bittersweetness, which we knew would hold up to the decaffeination process. There's no way around decaf having some negative impact on cup quality, and we've found that adding the fruitier naturals to the equation helps lock in some of what we think of as Ethiopian origin characteristics. That's certainly the case here! And that's the beauty of using a gentle decaffeination process like the Swiss Water method, where much of the volatile compounds that affect flavor and aroma are preserved post-decaf. You can read more about the Swiss Water decaf method and how it compares to other types of decaffeination HERE.","CuppingNotes":"The smells in the dry grounds are a little murky at first, and it isn't til pouring hot water that you start to get a sense of what's to come in the cup. This Ethiopia is certainly another uniquely fruited decaf, and the lighter roasts are particularly notable for showing origin character. There's a slight 'decaf' smell when pouring hot water, like chocolate malted bread, but accompanied by really sweet smells of cooked stone fruits too. The flavors in the cup are undoubtedly fruited when sticking to the lighter end of the roast range, and red fruit flavors help to reinforce a juiciness in the mouthfeel. Notes of stewed peach, baked pear come to mind, along with other aspects of fruit compotes. Again, I pick up on the sort of bready aspect that a lot of decafs produce (\"pumpernickel bread dough\" comes to mind), Guji Gorbeti lives up to the flavor expectations of dry process Guji coffees!","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 14-17 screen - expect some split beans that are typical of decaf coffee","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"71","Packaging":"GrainPro Liner","Processing":"Dry Process, then SWP Decaf","Region":"Hambela Buliye + Banko Chelchele, Guji Zone","Roast Recommendations":"City of City+","Type":"Decaf"}}
{"Title":"Ethiopia Guji Hambela Dabaye","Overview":"Can we talk about how incredibly floral this coffee is? Like Gesha, or a super floral Yirga Cheffe. Star jasmine, aromatic raw honey, white grape juice, lychee, soft citrus accents, and pink bubblegum. Incredible pour over! City to City+.","Score":93,"URL":"https://www.sweetmarias.com/ethiopia-guji-hambela-dabaye-7235.html","SKU":"GCX-7235","FarmNotes":"Hambela Dabaye is from longtime Guji coffee farmer and mill manager, Kedir Hassan. He is the older brother to Esmael Hassan, who you may remember as the producer of another Guji coffee we've also carried, Kayon Mountain. \"Dabaye\" is the name of the kebele where this Hambela station is located (a town, more or less). We were lucky enough to be hosted at this station on our December 2018 visit, camping out in a pair of military tents replete with cots, overlooking the couple hundred drying tables below us. Kedir is an incredibly proficient and capable engineer as well as coffee farmer, and built the entire Hambela station in one season. You wouldn't know this, as it's visually apparent everything was built with high processing standards, and with efficiency in mind. Of course he did not complete Hambela on his own, and thanks to his long standing connection with the the people in this area, he had much needed community support. Hambela sits at 1816 meters above sea level, and coffee is grown as high as 2100 meters. They mostly buy coffee from farmers in the surrounding kebeles of Buliye, Wamena, Borticha, Dari Rogicha and Dabaye, of course.","CuppingNotes":"Delicious and delicate, this wet-processed lot from Hambela Dabaye packs impressive sweetness, and blossoms with Guji floral cup characteristics. The dry fragrance smells very tea-like and floral, a note of loose leaf green tea, jasmine pearls, and a lingering honey sweet note. A more intense sweetness emerges from the wetted grounds, and running my spoon through the coffee crust released a potent mix of partially raw sugars and fragrant florals, as well as a hint of grapefruit. City roasts produce layers of sweetness that, when peeled back, reveal raw sugars, as well as pectin-type, fruited flavors that shape shift a little as the coffee cools. One element that is resolute from start to finish are the floral characteristics. Can we just talk about how perfumed this cup is? Really, the jasmine aroma is intense, leaving quite an impression on the cup profile, tasting akin to fresh Gesha coffee, or a super floral Yirga Cheffe cup. It's really special, and it's the note that stands out on first sip, and sticks with you after finishing the cup! The sweetness underneath is a bit like demerara sugar (unrefined cane sugar with some molasses intact), with an aromatic note of raw honey, and fruited flavor of white grape juice. As the coffee cools down some, I pick up on more fruited flavor notes like lychee fruit, soft citrus, and a pink bubblegum note. So much of the coffee character can be described as light and delicate, and you should give it a light treatment in the roaster too. Pulling 1 minute and 30 seconds after the start of 1st Crack is not too soon! That's where I stopped my first roast and I've been enjoying the most amazing pour over brews.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 14-16 Screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"100","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Dame Dabaye, Hambela Wamena, Guji","Roast Recommendations":"City to City+","Type":"Farm Gate"}}
{"Title":"Ethiopia Uraga Raro Boda","Overview":"What a special pour over brew this makes, potent floral aromatics, perfumed jasmine pearls, ripe fruit-type florals, sweetness of simple syrup and light honey, bubble gum, peach and mango hard candy accents. City- to City+.","Score":90.9,"URL":"https://www.sweetmarias.com/ethiopia-uraga-raro-boda-7063.html","SKU":"GCX-7063","FarmNotes":"Raro Boda washing station is located in the village of Raro Boda, on the eastern edge of Uraga, a name quickly becoming well known for regional cup quality. This particular site buys from around 700 small scale farmers in the area, each with less than 1 hectare of coffee planted on average. Raro Boda was established in 2018, and last year saw investment in their wet processing equipment, specifically, upgrading their fermentation tanks to ceramic which is much easier to keep clean than cement. Raro Boda coffee is collected from very high altitudes surrounding the station, up to 2250 meters above sea level! They produce both wet and dry process coffee, and we were really taken by this particular lot that represented about 1/2 of their total washed coffee exports from the 2020/21 harvest season.","CuppingNotes":"I pulled my first roast much too early, and 1st Crack was only about a minute underway. Still, this light City (let's call it \"City-\") made for an incredibly floral cup of coffee, if not a little greenish with underdevelopment. I had much better luck with roast #2, pulling just about 1:45 after the start of 1st Crack, still City roast level all the way, which is where I think this lot shows best! The floral fragrance and aroma are super potent, with perfumed jasmine, and more fruit-type retranasals such as really ripe mango and apricot. The level of sweetness at this stage is very impressive too, especially considering these are City-/City roasts I'm cupping! At first it has the transparency of a simple syrup sugar, but then opens up to a sort of light clover honey note. I found pour over brews to be super special, the cup billowing with intoxitating floral aromatics that are hard to miss! Jasmine is the obvious note that comes to mind here, but toothsome fruited accents are also perfumed, with a floral essence in aroma that come with fruit at its peak ripeness. Flavors of jasmine pearl tea, pink bubble gum, and fruit confections like peach and mango hard candies all make for quite a compelling brew!","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 14-16 Screen - I found a few partial quakers","Arrival date":"October 2021 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"105","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Raro Boda, Uraga, Guji","Roast Recommendations":"City- to City+","Type":"Farm Gate"}}
{"Title":"Ethiopia Yirga Cheffe Chelchele","Overview":"Chelchele has sweetness akin to corn syrup and molasses that keeps the cup feeling substantial amidst a delicate floral top note, hints of peach, nectarine, star fruit, and some woody aromatic incense in the finish. City to Full City.","Score":89.8,"URL":"https://www.sweetmarias.com/ethiopia-yirga-cheffe-chelchele-7065.html","SKU":"GCX-7065","FarmNotes":"Chelchele is a washing station in the Banko Chelchele kebele within Gedeb Woreda, not far from Yirga Cheffe town. The wet mill buys coffee from more than 1000 growers in the surrounding region, most with less than 1 hectare of coffee planted near their homes. These are what we consider to be \"small scale\" farmers, and coffee is usually only one of several subsistence crops grown. The landscape in this region is dramatic, and very high, with altitudes at the farms ranging from 1900 to 2200 meters above sea level. The cold weather and thin air that comes with high altitudes slows the rate of plant maturation, leading to a very dense coffee bean, and also can affect the size of the beans. You'll see some small beans in this lot, the smallest being 14 screen. Dense coffee has a higher potential for sweetness and acidity too. This is a fully washed coffee, with fermentation times between 36 and 48 hours, and around 2 weeks to dry the coffee.","CuppingNotes":"At City and City+, the dry fragrance of Chelchele is rife with raw honey sweetness, accented by aromatic whole clove, jasmine blossom, and cola. The sweetness in the wet aroma is really intense, warm honey, and with something like maple syrup and Johnny cakes (corn cakes). It isn't until breaking the crust that settles at the top of the cup that fragrant florals are released. My light-to-medium roasts of Chelchele were graced with flowery overtones and ample sweetness that fills out some of the more delicate flavor aspects. After judging the fragrance and aroma, the cup sweetness was a little less honeyed than I expected. There are faint, unrefined molasses-type sugar notes, and I found Chelchele to have more of a corn syrup flavor than anything else `(\"Karo\" syrup is what we always used!). A jasmine floral note comes out on top in the City/City+ roasts, and while it adds a tea-like delicate aspect to the cup, the sweetness and fruited hints underneath keep the profile feeling substantial. The cup cools off to juicy notes of peach, nectarine, and a tropical note of star fruit. I brewed this coffee as pour over the next day and picked up on slight aromatic woody notes in the aftertaste, that along with the florals, had a perfumed incense quality. My grounds to water ratio was a little heavier than normal, and I think that could be tempered by using a little more water and a slightly courser grind. Still, an incredibly delicious washed Yirga Cheffe!","Images":null,"AdditionalAttributes":{"Appearance":".0 d/300gr, 15-17 Screen","Arrival date":"October 2021 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"120","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Banko Chelchele, Gedeo, Yirga Cheffe","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Green Coffee Decaf Sample Set- 4 Pounds","Overview":"4 pre-selected decaffeinated coffees from several different growing regions. An economical way for a beginner to start roasting or find some new favorites. We choose the coffees. Four 1lb bags of four different decaf coffees.*Please note that we can't make substitutions or take special requests for our samplers. Thank you!","Score":0,"URL":"https://www.sweetmarias.com/green-coffee-decaf-sample-set-4-pounds-1.html","SKU":"GCX-SPDC-004","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{"Type":"Decaf, Sample Sets"}}
{"Title":"Green Coffee Sample Set- Espresso","Overview":"The Espresso Sampler includes pre-selected Sweet Maria's Blends and single origin coffees that are good as espresso. Starting off with a sample set is an economical way to start roasting and become familiar with origin flavor characteristics. Some of the single origin coffees and blends will not be available to order from our main coffee list since they are coffees that are going out of stock or are for sample sets only. You will receive 4 or 8 different 1 lb bags of green coffee.","Score":0,"URL":"https://www.sweetmarias.com/green-coffee-sample-set-espresso.html","SKU":"GCX-SPEX","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{"Type":"Sample Sets"}}
{"Title":"Green Coffee Sample Set- Regular","Overview":"Pre-selected coffees from some of the different growing regions we offer. Starting off with a sample set is an economical way to start roasting and become familiar with origin flavor characteristics. These coffees will not typically be available to order from the our main coffee list since they are coffees that are going out of stock or are for sample sets only. You will receive either 4 or 8 different 1 lb bags of green coffee..","Score":0,"URL":"https://www.sweetmarias.com/green-coffee-sample-set-regular.html","SKU":"GCX-SPRG","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{"Type":"Sample Sets"}}
{"Title":"Green Coffee Subscription","Overview":"Auto-shipped, pre-selected coffees from some of the different growing regions we offer. These coffees will not typically be available to order from the our main coffee list since they are coffees that are going out of stock or are for sample sets only. No special requests are accepted. You will receive either 4 or 8 different 1 lb bags of green coffee shipped once a month or every 2 months, your choice! Shipping is not included in the price. Orders will ship via the shipping method chosen at checkout.","Score":0,"URL":"https://www.sweetmarias.com/green-coffee-subscription.html","SKU":"GCX-SPRG-SUB","FarmNotes":"","CuppingNotes":"By signing up, you agree to be billed based on the frequency selected.  Your subscription will automatically create a new order according to the chosen delivery schedule. Cancellations or pauses must be made before your payment is processed. To pause or cancel your subscription login to your account and view My Subscriptions. Please be sure to email us at [email protected] to confirm any changes. To update your payment method, please cancel your current subscription and re-order with the updated payment method. Email us to update your address or billing cycle. ","Images":null,"AdditionalAttributes":{"Type":"Sample Sets"}}
{"Title":"Guatemala Cafeteros SWP Decaf","Overview":"Crowd pleasing decaf that's uniquely sweet, simple brown sugars, caramely malted grain, pleasantly mild acidity, and bittersweet side that's well balanced. City to Full City+. Good for espresso.","Score":87.2,"URL":"https://www.sweetmarias.com/guatemala-cafeteros-swp-decaf-7196.html","SKU":"GCX-7196","FarmNotes":"\"Cafeteros\" decaf is a blend of coffees from an Antiguan farm, Santa Ines, and a few small farmers in Huehuetenango. All of the coffee that went into this blend is planted above 1600 meters above sea level, the dominant cultivar being Bourbon, though there is some Caturra and Typica mixed in from the Huehuetenango farms. None of the coffees were bought as a lower quality for decaffing, which is so often the case. Rather, every one of the the components was also sold as single origin, non-decaf on our website. Most of our decafs are processed by Swiss Water in Vancouver, BC, known the world over for their gentle, chemical-free, water-based decaf process technic that is gentle on the coffee and retains much of the volatile compounds that affect flavor and aroma. Any decaf processing has an affect on the organic structure, which causes a slight degradation. What this means in the roasting process is that the coffee has a tendency to take off when too much heat is applied. If you're able to control your heat input, I recommend applying heat slowly up until about 20F before 1st Crack, then pulling back some to avoid violent fracturing. On our Probat P12, that means slowly walking the gas up to 75%, and then dropping down to 25% (maybe less) well before I hear the first 'pops'. If you're using a popper, you might try increasing batch size to slow things down a bit. I should also note that you'll likely see surface oils no matter light or dark, also a bi-product of the organic structure being broken down to some degree.","CuppingNotes":"The dry fragrance presents a chocolate malted grain sweetness, with accents of chocolate covered crisped rice, and a bit more pungent roast bittersweets at Full City. The wet aroma has a much more focused sweetness, with caramelized sugar smells eminating from the steam, and some backing barley malt and bittersweet cocoa on the break. I think you'll find the cup profile to be crowd pleasing, with ample sweetness that you don't often find in decaffeinated coffee. City+ roasts bring out flavors of simple brown sugars, caramely malted grains, and a pleasantly mild acidic impression. Full City roasts harness this coffee's bittersweet side, with an emphasis on remaining sweet, and balanced. I found the traces of the decaf process to be faint, and mostly found in the finish as a grainy, bread-like flavor note. This is going to be a fantastic espresso option as well, and definitely the one I'd point to for a decaf alternative to something like our New Classic espresso blend. ","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 15-18 Screen - mostly broken beans from decaffeination","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon, Caturra, Catuai, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB EP","Lot size":"54","Packaging":"GrainPro Liner","Processing":"Wet Process, then SWP Decaf","Recommended for Espresso":"Yes","Region":"Antigua and Huehuetenango","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"India Monsoon Malabar AA","Overview":"Best in the darker roast levels or as a blend application. Earthy, pungent roast tones, with some sweet/bittersweet sugars. A fairly low-sweetness coffee, and has toasted grain and nut flavors that hint at barley, roasted corn, and more. Its strength is body, and will make an interesting cup for fans of earthy, low acid cup, and an excellent addition to an espresso blend (we use it in Liquid Amber!). Full City+ to Vienna.","Score":83,"URL":"https://www.sweetmarias.com/india-monsoon-malabar-aa-7140.html","SKU":"GCX-7140","FarmNotes":"Monsooned coffees are stored in special warehouses until the Monsoon season comes around. The sides of the structure are opened and moist monsoon winds circulate around the coffee making it swell in size and take on a mellowed but aggressive flavor. This Monsooned Malabar is sourced from several farms in Southern India. Typically, the coffee is naturally processed, then spread on the floor of the special monsooning warehouse, raked and turned around by hand to enable them to soak in moisture of the humid winds. The monsooning process takes around 12 to 16 months of duration, where in the beans swell to twice their original size and turn a pale golden color. Then there are additional hand-sortings to remove any coffee that did not expand properly, and the coffee is prepared for export. This is an extremely pungent cup with a unique combination of burnt-caramelly finish and potent flavors, earthy too. It is not for those who like a \"clean\" cup, or sweet coffees! By all standard definitions, this is a defective set of cup flavors, though still quite interesting, unique, and not to mention, useful. (It's been a key component in our Liquid Amber espresso blend since the beginning!) Monsooned Malabar gets a free pass past the coffee censors because of cultural tradition, history, and the fact that (while it doesn't conform to the traditional ideas of good coffee) it is in it's own right a unique coffee flavor. It has some use in espresso blending with a preparation of longer drum roasting and resting (after roasting) of 3+ days. There are Italian espresso roasting companies that use this coffee in their \"exotic\" blend offering, along with 2-3 other non-monsooned arabicas to even out the cup and provide aroma and some sweetness. Even as a drip/infusion brew, the coffee mellows after 2 days and the cup is more balanced so resting is key to best cup results.","CuppingNotes":"There's nothing quite like Indian Monsooned coffee. It's all body, with intense, bittering roast flavors, and very low acidity. These are what make it a go-to for so many espresso blends. In fact, it's a big part of the success of one of our most popular blends, Sweet Maria's Liquid Amber Espresso Blend. On its own, the cup can be a bit of a shock to the palate at first, but once adjusted, you can find a heavily caramelized sweet/bittersweet quality in it. This lot in particular has more sweetness than ones we've carried in the past, though I'm hesitant to name \"sweet\" as one of its core characteristics. At Full City+ (an absolute minimum in my opinion), the cup has pungent cocoa and spice, earthy notes, and pipe tobacco smoky flavors. The cup cools to some interesting flavor accent notes like roasted corn, and cacao nib. It lends itself quite well to additives, cream and sugar, quite frankly. This coffee does not conform to standard cupping evaluation, hence the poor total score. It's an exotic flavor profile for sure, and perhaps an acquired taste. I recommend trying a very small amount at first to see if you like it, and also used sparingly for espresso blending - it will add quite a bit of crema and body to the shot.","Images":null,"AdditionalAttributes":{"Appearance":"1+ d/300gr, 18+ screen - Monsoon coffee has been swelled with water and is a pale yellowish-white in color, split, and with some minor defects like bug holes","Arrival date":"January 2022 Arrival","Bag size":"50 KG","Cultivar Detail":"Kent","Drying Method":"Mechanical","Grade":"AA","Lot size":"40","Packaging":"Jute Bag","Processing":"Monsoon","Recommended for Espresso":"Yes","Region":"India","Roast Recommendations":"Full City+ to Vienna"}}
{"Title":"Indonesia Nusantara SWP Decaf","Overview":"Nusantara offers balanced bittersweetness, with notes of carob chips, malt syrup, brown bread, an understated note of dark honey, roasted barley tea, big body and a long, chocolate-laden finish. City+ to Full City+. Good for espresso.","Score":87.1,"URL":"https://www.sweetmarias.com/indonesia-nusantara-swp-decaf-7195.html","SKU":"GCX-7195","FarmNotes":"\"Nusantara\" is an old Javanese term that means the \"outer islands\", in reference to part of the Indonesian archipelago. While it was originally a bit more limited in which islands were included, it is now commonly used to refer to the entire chain of Indonesian islands. We are using this name for a blend of Indonesian coffees we sourced, reserving small quantities of each for a custom Swiss Water decaf. This lot of Nusantara includes wet hulled coffee from the islands of Timor Leste, a typical body/bittersweet blend component that comes through loud and clear in decaf! In addition, we've added a really interesting \"honey labu\" processed Sumatran coffee, a hybrid honey-wet hulled processing technic that we started seeing in Aceh a few years back. The honey labu coffees we've purchased have tasted more in line with sweet, and sometimes fruited, honey process coffees, rather than herbal, earthy wet hulled. Together, they construct a chocolate-laden, big bodied, decaf, that is best roasted in the middle, City+ to Full City+ roast range. This is where it shows peak chocolate characteristics while retaining a nicely developed sweetness to balance the cup. Fantastic dual-use decaf that also makes a great base blending ingredient. Try 1:1 with Ethiopia Gera Goma SWP Decaf (click here for Coffee Shrub) for a Moka Java blend. This decaf was processed at the Swiss Water Decaf plant where their patented chemical-free, decaffeination process is employed using only water to remove 99.9% of the caffeine content.","CuppingNotes":"Nusantara is a balanced coffee that offers convincing chocolate roast flavors and a mild sweetness at medium roast levels. There's a good chunk of wet hulled coffee in here, which really boosted body in this decaf blend, while herbal/earthy tones are kept to a bare minimum. The fragrance and aroma have a malted milk powder smell, carob chips, torched sugars, and a slight herbal accent. I cupped this next to a few other decafs and was surprised by the bold bittersweetness at Full City, while lighter roasts brought a nice, mild acidic impression to the cup profile. Medium roasts have sweetness of malt syrup, brown bread, and an understated note of dark honey. The cooling cup displays a hint of roasted barley tea, big body and a chocolate-laden finish that leads to a long, bittering cocoa aftertaste. This is what we like to call a \"daily drinking\" decaf that should have wide appeal to those looking for a non-caffeinated alternative. It will function really well as a chocolatey espresso, and hefty bass notes and body will hold up to milk. Right now we have a really nice Ethiopia dry process decaf Gera-Goma as well, which will make a fantastic Moka Java blend with Nusantara (try 1:1 and go from there). ","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 16-18 Screen - expect some broken beans from the decaf process","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Ateng, Jember, Tim Tim","Drying Method":"Patio and Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"52","Packaging":"GrainPro Liner","Processing":"Wet Hulled and Honey Labu, the SWP Decaf","Recommended for Espresso":"Yes","Region":"Aceh, Sumatra and Timor Leste","Roast Recommendations":"City+ to Full City+","Type":"Decaf"}}
{"Title":"Kenya Kirinyaga Kamwangi AB","Overview":"Citrus flavors resonate in the cup, bright acidity supported by notes of orange spritzer, lemonade, orange tea, pomegranate, candied citrus peel, juicy boysenberry and blackberry. Excellent cup clarity in pour over brews! City to Full City.","Score":91,"URL":"https://www.sweetmarias.com/kenya-kirinyaga-kamwangi-ab-7218.html","SKU":"GCX-7218","FarmNotes":"Kamwangi factory is located in the Gichugu division of Kirinyaga district. The factory has the good fortune of being connected to the national electric grid, and washing resources are plentiful with the nearby Nyamindi river as the source. Kamwangi is part of the New Ngariama Farmers Cooperative Society (\"FCS\" - Kainamui is also under the New Ngariama umbrella of coops). Membership has reached nearly 1,000 farmers at Kamwangi, each with a tiny plot of coffee, generally 200 - 300 trees. Kamwangi farmers grow primarily SL-28, SL-34, and Ruiru 11 cultivars, benefitting from the red volcanic soils of Mt Kenya, and most stretch above 1800 meters above sea level. These factories are basically small washing stations set up in a particular area and are allied with a larger cooperative society - the FCS. Factories have wet mills, washing/fermenting channels, and raised beds where the coffees are basically processed all the way down to dried parchment (being meticulously sorted along the way). Kamwangi has a water recirculation system set up, as well as eight waste water soaking pits to help minimize the environmental impact. ","CuppingNotes":"There is intense citrus and brown sugar sweetness to the dry grounds of Kamwangi AB, with a really nice note of orange spice tea. It's a perfumed fragrance at City roast level, with sweet fruits and mulling spice, along with the raw sugar smells. The wet grounds of City roasts have a more complex sweetness of unrefined sugars and honey, a fragrant orange peel note released in the steam, and herbal and tropical fruit hints that blend to something like pineapple sage. Citrus flavors resonate in Kamwangi's cup, both in terms of flavor and acidity. At City roast level, the bright acidity is supported by flavors of orange spritzer, and sweetened lemonade (think Country Time lemonade, rather than fresh squeezed). The acidic impression is on the refreshing side rather than grabby, too. The flavor profile expands a bit as the coffee cools, and includes hints of orange tea, pomegranate, and candied citrus peel at City. Our City+ roast had more of a red berry fruit hue, with flavors of juicy boysenberry and blackberry topping the list. Pour over brewing highlights Kamwangi's acidity and cup clarity, both features that really stood out to us in our cup tests.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28, SL-34, Ruiru-11","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"AB","Lot size":"60","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Kianyaga, Gichugu, Kirinyaga","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Kenya Kirinyaga Thunguri Peaberry","Overview":"Thunguri will satisfy those looking for a 'light and bright' Kenya, with notes of lemonade, blackberry, orange, mixed berry jam, fragrant Darjeeling tea, candy coated cardamom seeds, cranberry, and an aromatic whiff of rose potpourri. City to Full City.","Score":91.4,"URL":"https://www.sweetmarias.com/kenya-kirinyaga-thunguri-peaberry-7223.html","SKU":"GCX-7223","FarmNotes":"Thunguri is a cooperative \"Factory\" located in Kenya's Kirinyaga District. Factories are basically what we call a wet mill, and is where farmers bring coffee cherry fruit for processing in Kenya. The Thunguri coop is part of the Kibirigwi Farmers Cooperative Society (\"FCS\"), a parent society whose other Factories we've bought coffee from and offered multiple times in our 15 year history at Sweet Maria's. Coffees are wet processed at the factories, then separated by size, and in this case, shape. The most common sizes we see are AA, and AB, which refers to coffees that fall between a range of 17/64\" to 19/64\", and 15/64\" to 17/64\" respectively. Peaberries are the small, rounded coffee that occur when only one of the two embryos germinates and grows into a single, round coffee bean, rather than two that have a single flat side from sharing the space. Peaberries make up a very small part of the Kenya harvest (roughly 5-10%) and so the bag amounts tend to be very small as well. This lot is only 9 bags, for example. We're never really sure which of these coffee sizes will shine brightest, and in this case, Thunguri's peaberry \"outturn\" stood out amongst the rest.","CuppingNotes":"The dry fragrance produces focused sweetness at City roast level, with a subtle citrus feature wrapped in maple, and muscovado sugars. Aromatically, I picked up on a smell of citrus, more like dried/candied lemon peel, and with sweet layers of white frosting and cinnamon raisin bread. If 'light and bright' type Kenyas are your preference, Thunguri will satisfy with fruited brightness that rides the line between a citric impression and berry juice. A soft lemonade note comes through as the coffee cools, along with notes of blackberry, red currant jelly, and orange. The cup is graced with fragrant spice notes as well, and drew comparisons to Darjeeling tea, candy coated cardamom seeds, and a floral hint of rose potpourri. It's kind of surprising how roasting just a shade darker unlocks more of the berry fruit characteristics too, with flavors of blackberry pancake syrup, and mixed berry jam. Full City roasts offer something much different, a lot less fruited cup, showing  Scharffen Berger type bittersweet chocolate, juicy mouthfeel, and dark berry characteristics are more of an aromatic feature rather than flavor. No matter where you wind up on the City to Full City spectrum, a lasting sweetness prevails, and you're met with uncompromising vibrance too.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15 Peaberry Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28, SL-34","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Peaberry","Lot size":"9","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Kirinyaga","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Kenya Nyeri Gathaithi AA","Overview":"Bright acidity helps organize the array of flavors like red grape, cranberry jelly, black currant, tart rhubarb, pear juice, aromatic baking spices, and red plum. An easy favorite, with so much to reveal with different levels of roast. City to Full City.","Score":92.2,"URL":"https://www.sweetmarias.com/kenya-nyeri-gathaithi-aa-7226.html","SKU":"GCX-7226","FarmNotes":"Gathaithi is the name of the washing station where this coffee was processed, as well as the local Farmers Cooperative Society (\"FCS\"). Wet mills are referred to as \"factories\" in Kenya, each serving a particular micro-region, and often associated with a few other cooperatives that fall under a conglomerate umbrella that is the \"Farmers Cooperative Society\". Gathaithi station is where the local members deliver their whole coffee cherry for processing: first pulping in a 3-disc \"Kenya\" style pulping machine, fermenting overnight, then washing away the cherry skins in clean water, and then soaking once more in fresh water before the parchment coffee is laid out to dry on raised drying beds. There are currently 1250 coop members, and the average altitude is 1700 meters above sea level, though farms fall on both side of that number. Grade doesn't necessarily correlate to actual cup quality (until you get into C, TT, and below), but we did find this particular AA size separation to stand out from the rest. AA are also the largest screen size at 17 to 19 1/64ths of an inch (AB are slightly smaller, at 15 to 17 1/64th's of an inch).","CuppingNotes":"This AA separation from Gathaithi boasts dark fruits and bracing citrus notes, and the smells in the ground coffee span a wide range of clean smelling citrus to spiced grape juice. Aromatically too, a smell of ruby red grapefruit and floral sugar draws you in immediately, and the wetted grounds push a captivating concoction of juicy fruits like cranberry lemonade, and syrupy sweeteners too. What a great pour over brew Gathaithi makes, with flavors of fruit juices, mouth-cleansing acidic impression, and transparent finish. Our City roast was undoubtedly the brightest brew, giving the perception of citric tartness, a mouthfeel that helps organize the wide array of fruited notes like plump red grape, cranberry jelly, black currant, tart rhubarb, and pear juice to name a few. Light roasts brings forth a wave of citrus flavors, and a flavor mix of orange and cherry offers a refreshing aspect, along with simple syrup type sweetness. The finish from light to dark roasting (we roasted to around Full City, 34 degrees of development post first crack) shows lasting sweetness, with complex baking spices lingering in the aroma and aftertaste, along with a pleasant tannic bittering. Fruit flavors and acidity are altered by darker roast development, and we found that at Full City there was berry-like brightness, and flavors of dark grape are a bit more prevalent, along with a note of red plum, and roast bittering in the aftertaste. An easy favorite, with so much to reveal with different levels of roast.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 17-19 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28, SL-34, Ruiru-11","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"AA","Lot size":"48","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Nyeri","Roast Recommendations":"City to Full City; acidity goes from citric in lighter roasts to berry-like closer to Full City","Type":"Farm Gate"}}
{"Title":"Mexico Sierra Madre de Chiapas","Overview":"Crowd pleasing and balanced, brown sugar, cream caramel, vanilla pudding, brûléed banana, moderate level of acidity, and tangy roast bittersweets in the darker roasts. City to Full City+. Good for espresso.","Score":86.6,"URL":"https://www.sweetmarias.com/mexico-sierra-madre-de-chiapas-7209.html","SKU":"GCX-7209","FarmNotes":"While the Sierra Madre de Chiapas mountain range cuts across a good portion of Central America, this lot comes from the southern extesion near the town of Motozintla, Chiapas. The area is made up of mostly small scale coffee farmers, covering roughly 1500 hectares of the south Sierras. The coffee that makes up this lot is pulled from the high altitude zones that span a range of 1500 to 1900 meters above sea level. Most of the farms are planted in older Typica and Bourbon types, with Caturra, and Catuaí cultivars mixed in. Each farmer processes their own coffee at home using small depulping equipment (motorized or hand-crank), fermenting in cement tanks, and then typically drying the coffee on rooftop patios. These farms are certified organic, however, we did not bring this coffee in with a certification. ","CuppingNotes":"The dry fragrance has a clean smelling sweetness of light brown sugar, butter pecan, and baked goods like a shortbread cookie. The wet aroma is very sweet as well, with notes of butterscotch chips, toffee almond, and a potent whiff of caramel cookie on the break. The cup is crowd pleasing, with a balanced profile of sweetness, acidity, and mild roast flavors that's going to work very well at a wide range of roast levels. The sweetness translates as brown sugar in light and middle roasts, with a nice roast tanginess at Full City and beyond. The cooling coffee displays notes of cream caramels, vanilla pudding, and just a hint of brûléed banana. I'm picking up on a nicely moderate level of acidity in both my City and Full City roasts, with the darker of the two fading to a moderate aftertaste of semi-sweet chocolate. The darker roasts have the level of bittersweetness we look for in a good milk drink option, whether brewed cafe au lait, or espresso drinks like a cappuccino.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Caturra, Catuaí, Typica","Drying Method":"Patio Sun-Dried","Grade":"SHG","Lot size":"75","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Motozintla, Chiapas","Roast Recommendations":"City to Full City+"}}
{"Title":"Papua New Guinea Kainantu Sero","Overview":"Date sugar, blackstrap molasses, hints of dried fig, sticky rice pudding, pine oil and palo santo stick, citrus rind, and dark roasts draw out more crowd-pleasing bittersweetness. City+ to Full City+. Good for espresso.","Score":86.8,"URL":"https://www.sweetmarias.com/papua-new-guinea-kainantu-sero-7154.html","SKU":"GCX-7154","FarmNotes":"The farm where this coffee was produced in Kainantu Town is over 40 years old, part of a larger set of plantations that were privately held since the late 1960s. Mr. Sero stepped in and bought one of the estates about eight years ago, replete with a processing facility which was built to process all seven estates some time ago. The 42 hectare farm sits at 1680 meters above sea level, and is still planted in the original tree stock, Blue Mountain Typica and Arusha types. Mr. Sero dry ferments his coffee for 36 hours, perhaps lending to the fruited characteristics found in the cup. The coffee is dried on tarps, which is not ideal, however they put great care in keeping the area clean, turning the coffee regularly to facilitate even drying. There is an old dry-mill on the premises too which is not currently in use, but perhaps an investment in the future. I found the final sort of this coffee to be pretty nice, consistent bean size (approximately 15 - 17 screen), and with very few quaker beans. You can easily identify and pull out quaker beans because they are yellow, and look unroasted. These are unripe cherries that made it through processing, a common occurrence in small numbers.","CuppingNotes":"City+ roasts bring about sweet smells of natural sweeteners, a malted caramel note, and an impression of dried date. The sweetness takes on a more resinous aspect in the wet aroma, with an interesting pine oil hint. At City+, the liquor has the buoyancy of fruit juice, which reinforces some of the fruited flavor characteristics that accent cup. There's a date sugar sweet note as the cup cools, along with accents of blackstrap molasses, dried fig, and sticky rice pudding. Acidity is on the mild side, but bolstered a bit by rindy citrus notes in the middle. The 'pine oil' aromatic wood aspect comes through in the aftertaste too, like a wood spice palo santo stick, or pine cone. Full City roasts have a lot more chocolatey low tones, and mellow out the herbal aromatics to some degree, and builds more crowd pleasing cup flavors. I think the toned down acidity helps make this lot from Sero Bebes a good option for espresso shots as well!","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen","Arrival date":"February 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Arusha, Bourbon, Typica","Drying Method":"Patio Sun-dried (on tarps)","Grade":"AX","Lot size":"55","Packaging":"GrainPro Liner","Processing":"Wet Process","Recommended for Espresso":"Yes","Region":"Kainantu Town, Eastern Highlands","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Papua New Guinea Korgua X","Overview":"Medium body across a range of roasts, and moderate acidity, fruited lemongrass hint, dried apple slices, natural dried stone fruit flavor, with some rustic sweetness at a shade more roast development. City to Full City.","Score":86.7,"URL":"https://www.sweetmarias.com/papua-new-guinea-korgua-x-7177.html","SKU":"GCX-7177","FarmNotes":"\"Korgua X\" sounds a bit like a super hero, and while they may produce super coffee, there's nothing super human about them. The Korgua Estate resides in Nebilyer District, Central Highland region of Papua New Guinea. Now run by Brian Leahy, the farm was founded by Brian's father Dan and Uncle Mick, two well-known Australian explorers (their early films and photos being the basis for the Australian documentary, \"First Contact\"). Korgua Estate sits at about 1400 meters above sea level and is planted mostly in older Bourbon and Typica cultivars. It's a wet processed coffee, meaning the coffee cherry and much of the fruit are stripped from the seed using depulping machinery, and then the seed still covered in sticky mucilage is submerged in water tanks where it ferments overnight, breaking down the remaining outer layer of fruit. Now this is an X grade coffee, which is technically 'lower' than the top grades like A and AX. But tasting it blind side by side with the top grades, it was clearly the superior cup, more fruited and sweet in a way that set it apart from the rest.","CuppingNotes":"This lot from Korgua Estate is an X grade, which technically is considered a lower level than AA and A grades from Papua New Guinea (PNG). But there are cases like this where, in cupping all of them side by side, X Grade has the fruited sweetness the others lack. The AA was pleasant enough, but really lacked character, whereas X was sweet and fruit-laden. Toffee and caramel sweet smells transfer from freshly ground coffee to wet aromatics, as well as fruited notes that seem to gain momentum after pouring hot water. The coffee extracts medium body across a range of roasts, and presents moderate acidity when kept to the lighter end of the spectrum. (Body is heightened when using full immersion methods like French Press, especially with City+ and Full City roasts where sweetness plays as prominent a role as bittering coffee roast tone!). In terms of top notes, I get a fruited lemongrass hint, and dried apple slices at City, that shape shifts to more of a natural dried stone fruit flavor, with some rustic sweetness with a shade more roast development.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 screen","Arrival date":"March 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Arusha, Bourbon, Typica","Drying Method":"Patio Sun-Dried","Grade":"X","Lot size":"56","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Nebilyer Valley District, Central Highlands","Roast Recommendations":"City to Full City"}}
{"Title":"Papua New Guinea Kuta Waghi","Overview":"Brews very well at City+, torched sugar, toffee, understated hints of prune, and dried citrus peel, aromatic tobacco, ample bittering that points to tannic tea, and unsweetened baking chocolate. City+ to Full City+.","Score":86.7,"URL":"https://www.sweetmarias.com/papua-new-guinea-kuta-waghi-7176.html","SKU":"GCX-7176","FarmNotes":"This coffee comes to us by way of the Kuta coffee mill in the Waghi District of Papua New Guinea. The coffee processed at the mill are from smaller coffee plantations in the area situated at just under 1600 meters above sea level on the low end. It's a wet processed coffee, meaning the coffee cherry and much of the fruit are stripped from the seed using depulping machinery, and then the green coffee seed, still covered in sticky mucilage, is submerged in water tanks where it ferments overnight, breaking down the remaining outer layer of fruit. The physical preparation of this coffee is decent, however, I did find a few partial quaker beans in my roasted coffee. Quakers are unripe coffee that are easy to spot when roasted as they remain light tan no matter how dark you roast your coffee. Not all beans with a lighter color variance are quakers! And similarly, not all quakers have the same affect on flavor. Coffee that is nearly ripe will be a little darker in color than a true, full quaker, and taste much closer to the fully ripe coffee. A few partial quakers like these are likely to go undetected in a full brew batch. There's also very little silver skin left on the seeds, which makes judging roast development by physical color shade fairly easy.","CuppingNotes":"This Papua New Guinea coffee has a nice sweet scent that transfers from freshly ground coffee to wet aromatics that, with convincing chocolate roast smells, have a smell of bittersweet confections. This carries through to the brewed coffee, and City+ roasting provides dark sugar and toffee sweet flavors with a 'toasted' note, like torched sugar. Kuta Waghi shows understated fruit aspects as it cools, a faint hint of prune, wisps of dried citrus peel that get the most attention at lighter roast levels, though are still very low in the profile. The aftertastes shows ample bittering that points to tannic tea, and unsweetened baking chocolate depending on how dark you roast it. There's also a rustic note in the finish that produces an earth-toned aromatic feature, and comes off like fruited pipe tobacco. Light roasts have moderate acidity as well that leans toward citric, without being sharp or acerbic, but well-integrated into the cup flavors.","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-17 Screen - I found some partial quakers in my roasted coffee, and a single full quaker. These are easy to identify by their light color, and can be picked out, but not necessary.","Arrival date":"March 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Arusha, Bourbon, Typica","Drying Method":"Patio Sun-Dried","Grade":"AX","Lot size":"30","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Waghi Valley","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Peru Bello Horizonte Andres Burga","Overview":"This Peru ticks off so many boxes for me! Saccharine sweetness, fruited overtones, moderate acidity level, notes of brown sugar, Thompson raisins, apples with cinnamon, and tea-like accents of Earl Grey and PG Tips. City to Full City.","Score":88.1,"URL":"https://www.sweetmarias.com/peru-bello-horizonte-andres-burga-7146.html","SKU":"GCX-7146","FarmNotes":"Andres Burga's farm El Naranjo is located in the small village of Bello Horizonte, in Peru's Northern Province of San Ignacio. Situated alongside the western Andes mountain range, Andres' 2 hectare farm rests at 1820 meters above sea level. He's chosen to plant his farm in cultivars that do particularly well in high altitude areas, Caturra, Bourbon, as well as some Pache, a natural dwarf mutation of Typica. Bello Horizonte is in a wet microclimate which presents challenges for drying coffee during the harvest. In addition to an open patio, Andres has built one small indoor \"solar\" drying room to help protect the drying coffee from passing rains, and plans to build a second solar dryer for the upcoming harvest. After depulping the cherry from the seed, he wet ferments the coffee for upwards of 40 hours, which is fairly long comparatively, and likely plays at least partial role in the fruit flavors imparted on the cup. I'm really enjoying this coffee quite a bit, as it hits on so many flavor aspects I look for in a daily drinker. The sweetness is well defined, as is a moderate level of acidity, and the top notes are more than \"hints\" and easy to spot in the lighter roasts. And the fact that it happens to be 29 bags instead of 2 is icing on the cake!","CuppingNotes":"There's a spiced sweetness found in the dry fragrance of the ground coffee that smells of turbinado raw sugar laced with cinnamon powder, hints of clove, and other types of raw cane sugars. While the aroma of the wetted crust has a similar spiced sweetness (this time like a cinnamon caramel), running my spoon through it released a fruited scent of baked apple and brown sugar. This coffee from Andres Burga ticks off so many boxes of what I love in a daily drinker - saccharine sweetness, fruited overtones, and a really pleasant level of acidity that's both fruited and tea-like! The flavor notes at City that I pinpointed were simple brown sugar, Thompson raisins, and apples with cinnamon. The cup isn't over the top in any way, but rather, offers a moderate complexity that's well balanced by the sweetness. The light roasts cool to some tannic tea notes, Earl Grey came to mind, as did something brisk like PG Tips in the aftertaste. Full City roasts tamp down on fruit flavors quite a bit, traded out for a deliciously smokey dark chocolate note.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"February 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Caturra, Pache","Drying Method":"Covered Sun-Dried","Farm Gate":"Yes","Grade":"SHB","Lot size":"29","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Bello Horizonte, San Jose De Lourdes, San Ignacio","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Peru El Paraiso Yoner Arevalo","Overview":"Some similar flavor characteristics of dry process coffee, fruited hints of cherimoya, cooked plantains, banana bread, red cherry, along with creamy chestnut, and prominent chocolate bittersweetness. City+ to Vienna.","Score":86.9,"URL":"https://www.sweetmarias.com/peru-el-paraiso-yoner-arevalo-7151.html","SKU":"GCX-7151","FarmNotes":"Yoner Arevelo's farm \"El Cedro\" is located in the high altitude town of El Paraiso, his farm topping out right around 1950 meters above sea level. His 1 hectare farm is planted in Bourbon and Catuaí, and Yoner has plans to reinvest this years profits into renovating half of the farm with new plantings of Bourbon. Renovation comes at a cost, as any new planting won't produce cherry for at least 2 years. But the potential tradeoff of higher margins for improved cup quality is what drives his decision and we hope that it pays off! We found our roasts of Yoner's coffee showed tasty fruit flavors akin to dry process coffee. Yoner lets his coffee cherry sit in a tank overnight (14 hours) before processing. He then depulps the coffee and ferments for around 30 hours, which is on the long side. The extra time in the cherry before processing, coupled with the long fermentation, may very well play a big role in the fruitier cup flavors. ","CuppingNotes":"Yoner's coffee was full of surprises on the cupping table. Compared to most wet process coffee, it's definitely one with a fruitier cup. I revisited our cupping notes from when we first tasted it and one of the other cuppers wrote, \"tastes like a natural...folks will like it!\". While far from a natural Ethiopian coffee, I agree with that sentiment! The dry fragrance has a smell of ripe banana, cooked sweet potato, brown sugar, and the wet aromatics come together like a warm oatmeal raisin cookie. The cup flavors show a blend of cooked banana, raw hazelnut, and molasses, a lot like banana bread! As the coffee cools, creamy hints of cherimoya, cooked plantains, and chestnut further contrast the bittersweet core coffee flavors. Yoner's coffee is a great dark roast option too. At Full City/Full City+, you'll find a nice red cherry flavor wrapped in prominent chocolate bittersweetness. While perhaps a little too wild for the average espresso drinker, I can certainly see applying the body/bittersweet/fruited combination to an espresso blend, even as much as 50%.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"February 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Catuaí","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB","Lot size":"38","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"El Paraiso, Huabal, Jaén, Cajamarca","Roast Recommendations":"City+ to French","Type":"Farm Gate"}}
{"Title":"Peru Las Pirias Ramiro Vela","Overview":"Refined sweetness, minimally processed sugars like turbinado, along with hints of honey, yellow cherry, apple, and aromatic note of spiced cider. Full City+ roasts have bittersweet SMORE, and light fruit accent. City to Full City+.","Score":87.6,"URL":"https://www.sweetmarias.com/peru-las-pirias-ramiro-vela-7147.html","SKU":"GCX-7147","FarmNotes":"Ramiro Vela is a small scale farmer in the Las Pirias area of Peru's Jaen Province. He and his family live and work the farm year round, hiring a few extra hands during the harvest season to help with picking. His farm \"El Cedro\" is situated at 1800 meters above sea level, and planted in Caturra, and Catuaí. His wet-processing technique involves a fairly long, 36 hours of fermentation time to break down the sticky mucilage enough to wash it away easily. After all the fruit is removed, the green, parchment-covered coffee is moved to an indoor drying room where it will dry over the course of around 18 days. Ramiro's coffee has fruited flavor characteristics that are pretty unique for Peru, and I can't help but wonder if the long fermentation time has something to do with it. Another coffee we have right now from Andres Burga has a similar cup profile and also ferments his coffee for 36+ hours. In both cases, the fruit flavors aren't flabby, or tasting of actual ferment. Rather, they're clean and refined, as is the cup sweetness. Whatever they're doing post-harvest, I wouldn't change a thing!","CuppingNotes":"Vela's coffee has a sweet scent of honey in the dry ground coffee, with a touch of cinnamon bark, and spiced cider. The aroma in the wetted grounds shows a potent sweetness, laced with dark honey that reaches a floral pitch, honey graham crackers, and a golden raisin note. In the cup, the sweetness is refined at City+, with flavors of minimally processed sugars such as a turbinado, or sugar in the raw, and honey is expressed to a lesser extent. Fruit flavors were easily discernible when I cupped the coffee from a spoon, but more integrated into the profile when I brewed it. There are hints of yellow cherry and apple, and a sweetness of unrefined sugars remains resolute in the aftertaste. My only other roast was Full City+, and an extreme opposite profile of my City+ (no surprise!). Roast flavors hint at very high % dark cocoa, with a campfire smokey hint that brought to mind SMORES, but there's still a fair amount of fruited sweetness in the brew too. Typically, I only hold onto my dark roasts for espresso, but I'm looking forward to brewing this one again after another couple days of rest!","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"February 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Caturra, Catuaí","Drying Method":"Covered Sun-Dried","Farm Gate":"Yes","Grade":"SHB","Lot size":"26","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Las Pirias, Jaen","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"ROASTED COFFEE Brazil Pulp Natural Fazenda IP","Overview":"Roasted on 5/31/2022 to City ++Bitersweet cacao, burnt sugar, and barley malt. ","Score":0,"URL":"https://www.sweetmarias.com/roasted-coffee-brazil-pulp-natural-fazenda-ip.html","SKU":"RSTD-1050-BZ31","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{}}
{"Title":"ROASTED COFFEE Burundi Gatare Masha ","Overview":"Roasted on 5/31/2022 to City +Burned sugar, honey-floral, cinnamon, and stone fruit pear. ","Score":0,"URL":"https://www.sweetmarias.com/roasted-coffee-burundi-gatare-masha.html","SKU":"RSTD-1050-BR31","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{"Country of Origin":"Varies"}}
{"Title":"ROASTED ESPRESSO Liquid Amber Blend","Overview":"Roasted on 5/31/2022 to Light ViennaRustic sweetness, spices and savory notes. ","Score":0,"URL":"https://www.sweetmarias.com/roasted-espresso-liquid-amber-blendrstd-1050-la03.html","SKU":"RSTD-1050-LA31","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{}}
{"Title":"ROASTED ESPRESSO New Classic Espresso Blend","Overview":"Roasted on 5/31/2022 to Full CityChocolate ropast notes, almond and spiced fruit. ","Score":0,"URL":"https://www.sweetmarias.com/roasted-espresso-new-classic-espresso-blend.html","SKU":"RSTD-1050-NCLS","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{}}
{"Title":"Roasted Coffee Subscription","Overview":"Enjoy 2 lbs of freshly roasted coffee from our Probat roaster at Sweet Maria's Coffee. With a roasted coffee subscription we ship you two different single origin coffees roasted between a City-Full City roast, packaged in resealable valve bags. ","Score":0,"URL":"https://www.sweetmarias.com/rstd-subs-1050.html","SKU":"RSTD-SUBS-1050","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{}}
{"Title":"Rwanda Dry Process Macuba","Overview":"Berry notes leave a near floral impression, like ripe blackberry, blueberry, along with fruited acidity, and darker roasts tie in a delicious bittersweet undertone, like strawberries dipped in chocolate sauce. City to Full City+.","Score":88.5,"URL":"https://www.sweetmarias.com/rwanda-dry-process-macuba-7191.html","SKU":"GCX-7191","FarmNotes":"The Macuba station is located in Macuba town, within the Nyamasheke region of Rwanda's Western Province. The site produces both wet and dry process coffee, both of which we picked up this year (look for the washed coffee in July!). Macuba serves almost 500 farmers in the surrounding highlands, most with less than 1 hectare of coffee. At 1685 meters, the milling site is at a much lower altitude than most of the coffee that comes in, many of the farms reaching above the 2000 meter mark. The station employs many grading techniques to separate out the top quality coffee, starting with the whole coffee cherry being submerged in tanks of water, and removing the low density coffee that floats to the top. The dry process coffee is then moved to raised drying tables where it will dry over the course of a few weeks. During this time, the cherry is turned by hand, and the workers continue to remove any coffee with physical defects they find along the way. All this care and attention results in a very uniform coffee for dry process, making it much easier to roast, as well as a very consistent brew.","CuppingNotes":"When roasting this dry process Macuba lot, 1st Crack got away from me on my first go, and I wound up with a much darker roast than anticipated. I still gave it a taste (why waste good coffee at ANY roast level?), and was pleasantly surprised how nice the fruit flavors settled in with some of the more intense roast bittering. The coffee aroma had juicy berry notes that were offset nicely by fairly heavy bittersweet roast smells, and a comment made at the cupping table that it smelled like \"strawberry dipped in dark chocolate\" seemed appropriate. The cup flavors were in line with that description, with a fairly wide array of berry flavors that tied into this deep, underlying bittersweet cocoa base note. It's a very nice pairing, I must say! Lighter roasts have an aromatic quality to the berry fruit that is a bit floral, like a ripe blackberry, or blueberry, and cut through by a welcome berry-like vibrance that all make for an impressive brewed coffee. My intentional dark roast was almost to Full City+ (35F post 1st Crack), which mellowed out the fruit quite a bit, though far from diminished it. The roast bittering is the flavor you taste first - a smokey bittersweet note - but dark fruits are hidden behind that bittersweetness, bubbling up from beneath a bit as the coffee cools.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Lot size":"40","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Region":"Macuba, Nyamasheke, Western Province","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Rwanda Ngororero","Overview":"Cup flavors have a delicious aromatic spice quality of whole clove, candied ginger, and cinnamon stick, with crisp red fruit and elderberry teas that convey a floral aspect, and delicate acidic impression. City to Full City.","Score":90,"URL":"https://www.sweetmarias.com/rwanda-ngororero-7187.html","SKU":"GCX-7187","FarmNotes":"Ngoroero is a coffee processing site in Ngororero town, with the District Ngororero. That's a lot of 'Ngororero'! The wet mill are producing mostly fully washed, wet process coffee at this site, but also process a nominal amount of honey and natural process too. Hundreds of farmers in the region deliver their cherry to the site where floatation and hand sorting are first employed in order to begin the grading process. The whole cherry is then run through the de-pulping equipment, fermented in water-filled tanks overnight, then laid to dry on raised African coffee drying beds for upwards 2 weeks. Bourbon is the dominant cultivar in this region and farmers delivering to Ngororero are scattered across an altitude range of 1600 to 2000 meters above sea level. This year's coffee is what I think of as a quintessential Rwandan cup, with impressive sweetness that's spiced in aroma, a feature of some Burundi coffees too. Ngororero has a really nice complex flavor profile, and the light roasts brew up a competition level coffee in my opinion.","CuppingNotes":"A dark sugar and sweet spice concoction is raised from the ground coffee, with hints of cherry, cinnamon stick, muscovado sugar, and a nicely caramelized sweetness. After pouring the hot water, the crust that forms at the top smells of warm baked goods like gingerbread and spiced molasses cookies, with an assemblage of baking spice notes in the aroma, and raisin-y dried fruits. At City roast level, the flavors in the cup have a delicious aromatic quality, seeing a return to spiced accents that were so pleasant in the fragrance and aroma, like sweet whole clove, candied ginger, and cinnamon stick. The coffee cools to a tea and fruit composite that leans toward red fruit tea, and elderberry, and conveys a floral aspect in the cup too. There's a crispness in flavor level that leads to a mouth refreshing, delicate acidity, that's not sharp at all. I'm surprised by the body of my lightest roast, and is even more impressive at Full City, where it is matched by fairly intense chocolate bittersweets, burnt sugars, graham cracker, and a hint of anise in the aftertaste.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Lot size":"25","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Ngororero Town, Ngororero District","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Rwanda Rusizi Gaseke","Overview":"A sweet backdrop of complex sugars like raw sugar cane juice, muscovado, aromatic brûlée sugar, with restrained top notes of Earl Grey tea, a hint of masala Chai, and dried strawberry note. City to Full City+. Good for espresso.","Score":88,"URL":"https://www.sweetmarias.com/rwanda-rusizi-gaseke-7185.html","SKU":"GCX-7185","FarmNotes":"This fully washed Rwandan coffee comes from the village of Gaseke, located in Nyungwe Mountain National Park in the southern District of Rusizi. The Gaseke washing station has been in operation for 3 years now and serves about 400 regional farmers. That sounds like a lot, but in comparison to many other sites we buy from, it's about 1/3 the of the average size. It sits at 1500 meters above sea level and farms reach up to higher altitudes of 1800+. The Gaseke workers put a lot of hand labor into sorting out defects, and is noticeable when looking over the green. First, all of the coffee cherry delivered to Gaseke is spread out on tables where any over and under ripe coffee cherries are removed. Next, the cherry is transferred to tanks filled with clean water where the floating cherries (overripe coffee) are skimmed and processed as lower quality separations. Once the visible defects have been removed, the coffee is depulped down to parchment coffee and transferred to drying beds where it will be sifted through several times during the couple weeks it takes to dry. All this sorting makes for a more uniform coffee from one brew to the next since there are very few beans that will influence cup flavor.","CuppingNotes":"The fragrance and aroma show herbal sweetness that have cinnamon tea-like smell, with a scent of light brown sugar that has a refined quality to it. The wet aroma is saturated with a more complex sweetness of partially refined sugars such as turbinado and demerara, along with hints of sweet tea. Light roasts brew a really sweet cup, and the cup flavors coalesce and strike a nice balance with a couple days of rest. Against the sweet backdrop of Gaseke the top notes seem a bit restrained, but start to emerge as the coffee cools off some. Tea note accents pop up, like Earl Grey and a hint of masala Chai, along with a muted dried strawberry note. The underlying sweetness is clean and complex, and opens up to notes of raw sugar cane juice, muscovado (type of raw sugar with a fair amount of molasses content), and an aromatic hint of brûlée sugar. Gaseke's sweetness was impressive in both light and darker roasts (Full City was as dark as we roasted it), and goes the long haul in the aftertaste. Both our City and Full City roasts boasted big body and moderate citric-like acidity, and I imagine will hold up to even darker roasting. Chocolate bittersweet roast tones were fairly moderate at Full City and will certainly gain prominence with darker roast development.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 16-18 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Lot size":"25","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Rusizi District, Western Province","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Sweet Maria's Decaf Espresso \"Donkey\" Blend","Overview":"Fruited cup profile, some sweet bright accents, medium body. FC+ to a light Vienna is recommended.","Score":85.8,"URL":"https://www.sweetmarias.com/sweet-maria-s-decaf-espresso-donkey-blend.html","SKU":"GCX-2656","FarmNotes":"People have requested that we offer a pre-blended espresso, a decaf counterpart to the Espresso Monkey blend. Working under the codename of the \"Donkey Blend\" (don't ask how all these ridiculous names started ---I think it was George's fault) we came up with this. It is intended to be used several ways. As an all-decaf espresso blend I wanted it to work well under a wide variety of roasting conditions, in terms of both lighter Northern Italian type espresso roasts (the equivalent of a Full City to Vienna Roast) and the darker Southern Italian type roast (roasted to a French roast). I also wanted a good espresso from both air and drum roasters, and I wanted good crema. This is a lot to ask from a decaf, but I think this blend works very well. While origin tastes are muted in decafs, I think the bittersweet roast tastes from this blend are very good. My second focus was having the blend not have too much character so that it can be used as a base blend for a \"low-caf\" espresso. This means it should work well as 50-75% of your blend where you add other caffeinated coffees to give more aromatics and flavor: my choice would be a Ethiopian Harar, or a Central American (see our Blending Basics article for more). Why do we call this Donkey Blend? Frankly, I can't remember .. it just is...","CuppingNotes":"People have requested that we offer a pre-blended espresso, a decaf counterpart to the Espresso Monkey blend. Working under the codename of the \"Donkey Blend\" (don't ask how all these ridiculous names started ---I think it was George's fault) we came up with this. It is intended to be used several ways. As an all-decaf espresso blend I wanted it to work well under a wide variety of roasting conditions, in terms of both lighter Northern Italian type espresso roasts (the equivalent of a Full City to Vienna Roast) and the darker Southern Italian type roast (roasted to a French roast). I also wanted a good espresso from both air and drum roasters, and I wanted good crema. This is a lot to ask from a decaf, but I think this blend works very well. While origin tastes are muted in decafs, I think the bittersweet roast tastes from this blend are very good. My second focus was having the blend not have too much character so that it can be used as a base blend for a \"low-caf\" espresso. This means it should work well as 50-75% of your blend where you add other caffeinated coffees to give more aromatics and flavor: my choice would be a Ethiopian Harar, or a Central American (see our Blending Basics article for more). Why do we call this Donkey Blend? Frankly, I can't remember .. it just is...","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 16/17 scr","Arrival date":"All current-new crop","Cultivar Detail":"Varies","Grade":"Top Grades","Packaging":"GrainPro Liner","Processing":"Varies","Recommended for Espresso":"Yes","Roast Recommendations":"As with all decafs, remember they roast faster and have the propensity to get away from you and end up darker than you expected. So attend to the roaster and stop the roast manually if possible to get it just right. Roast preference with espresso is up to you. I personally prefer the lighter N. Italian roast -just a bit more than a Full City.","Type":"Decaf, Sweet Maria's Blends"}}
{"Title":"Sweet Maria's Espresso Monkey Blend","Overview":"We blend this for body, balanced between high and low tones, fruited-chocolate roast flavors, and slightly rustic fruited accent notes. Our roast goal is in the beginning stages of 2nd crack ... we never \"let it roll\", so we recommend FC+ to light Vienna roast.","Score":88,"URL":"https://www.sweetmarias.com/sweet-maria-s-espresso-monkey-blend.html","SKU":"GCX-2653","FarmNotes":"A longtime favorite espresso blend intended solely for pump and piston type espresso extraction. This is a sweet but punchy little cup, and roasted fairly light it is a shock to the palette, but has great body and a smooth, sweet, stunning aftertaste. The joke behind the name: I imagine a fancy roaster charming a client in the cupping room, effusing about their \"Master Roaster\" and \"Master Blender\" and \"Master Cupper\", all in the trade for decades of course. Then I imagine the scene in their warehouse where hired apes rip open bags of green coffee and randomly hurl handfulls into the hopper for roasting. In other words, there's a lot of BS in the coffee trade, and blending is NOT really a noble art ...it's done to save cost and disguise coffee defects 80% of the time. The Irony? I have never worked so hard to develop a blend as this one, designed to cup well at a full range of \"espresso\" roasts, and developed as a pre-blend (all coffees roasted together to same degree of roast). Am I going to tell you exactly what is in it? No! I am feeling a bit snobby today! Espresso Monkey has become our signature blend for some reason or other, perhaps because it is a true standard that we have sought to maintain for so long, and that we put such nice coffees into it.","CuppingNotes":"We blend this for body, balanced between high and low tones, chocolate roast flavors, and slightly rustic fruited accent notes. Those are our goals, that is the \"spirit\" behind the blend, and we check it to make sure it meets those targets. This blend has historically been geared toward Full City to Full City+, without letting 2nd crack \"roll\" too long. The current ingredients include some dry process coffee from Africa and South America, which lend to big body and some fruited cup characteristics. There's also a nominal amount of a washed Central American coffee that helps round out the sweetness in the cup or shot.","Images":null,"AdditionalAttributes":{"Appearance":"15-18 screen","Arrival date":"All current-new crop","Bag size":"n/a","Cultivar Detail":"Varies","Drying Method":"Patio and Raised Bed Sun-Dried","Grade":"Top Grade","Lot size":"n/a","Packaging":"GrainPro Liner","Processing":"Wet and Dry Process","Recommended for Espresso":"Yes","Region":"Africa, South America, Central America","Roast Recommendations":"I like this blend best when the roast is stopped just as second crack becomes rapid, and shows no sign of slowing down. Actually, I like it a lot lighter than that too! I don't like this roasted to a dark, dark roast stage, Full French or Italian. This is because Brazilian coffees become ashy and began to bitter when roasted extremely dark. I believe strongly in a 36+ hour resting period before use for espresso extraction! It wont kill you to use it sooner... but you might notice sharp unpleasant notes.","Type":"Sweet Maria's Blends"}}
{"Title":"Sweet Maria's French Roast Blend ","Overview":"Designed to endure the rigors of dark roasting, and produce excellent pungent tastes, attractive bittersweet/carbony flavors, and great body.","Score":85.4,"URL":"https://www.sweetmarias.com/sweet-maria-s-french-roast-blend.html","SKU":"GCX-2657","FarmNotes":"NULL","CuppingNotes":"This is my favorite blend designed to endure the rigors of dark roasting, and produce excellent pungent tastes, attractive bittersweet/carbony flavors, and great body. Body is so important to a darker roast. Extended roasts incinerate body, and a thin cup of burned water IS NOT what French Roast coffee is about! You do not want to fully burn up all the sugars, you want some degree of bittersweet, overlayed on the carbony charcoal tones of the burned woody structure of the bean itself. You want something still voluminous, and something sharp that stings you a bit down the center of the tongue. Well, at least if you do want these things, then we share common ground, and you might like my blend. Please note that we made changes to improve the blend. I have changed the percentages and added a new coffee that became available that really enhances the chocolatiness in the Vienna stage, and the pungency in the darker French stage","Images":null,"AdditionalAttributes":{"Appearance":"16 to 18 screen","Arrival date":"All current-new crop","Cultivar Detail":"Varietal Blend","Drying Method":"Sun- and Machine-dried","Grade":"Top Grade","Packaging":"Other","Processing":"Varies","Recommended for Espresso":"Yes","Roast Recommendations":"I like this blend best roasted to the point where 2nd crack slows, but has not yet ended. Roast to the absolute end of 2nd crack, and you might as well be drinking roasted radish. I believe strongly in a 24 hour resting period for darker roasts."}}
{"Title":"Sweet Maria's Liquid Amber Espresso Blend","Overview":"A potent, pungent blend for espresso beverages. It's ideal for milk drinks, as this intense bittersweet cuts through the steamed milk. Caramel sweetness that turns pleasingly pungent with 2nd snaps, spice, cacao and semi-sweet chocolates, savory notes, long aftertaste. Monsooned coffee and a small percentage of Robusta add crema and body. Full City+ to Vienna roast.  ","Score":86.6,"URL":"https://www.sweetmarias.com/sweet-maria-s-liquid-amber-espresso-blend.html","SKU":"GCX-2655","FarmNotes":"I wanted an espresso blend that was potent, sharp, intense enough in flavor to cut through steamed milk, but clean enough in flavor profile to work as a straight espresso shot. I wanted it also to be complex and hint at all of those tastes, and more. Here's the product of a lot of overly-caffeinated days of experimentation: the Liquid Amber Espresso Blend. It is named for the rich color and multitude of crema it produces. The blend was fairly complex to come up with ... after I found the general tastes I wanted, emerging from aroma and first sip through the very long aftertaste (if I don't cleanse my palate with water I will taste this coffee for a very......long.....time) I needed to play with the exact percentages. The specific blend, hey ... it is my secret! But I will tell you that the 5 coffees that really worked toward the flavor goal I imagined ended up surprising even me! We've refined the recipe over the year, and at the moment, there's a washed Central, wet-hulled Indonesia, a monsooned coffee, and even a modicum of quality Robusta. And to keep this a mystery, the blend contains some coffees not on our list. I admit this is a pretty wacky blend by the current fashion in espresso toward lighter-roasted and acidic coffees; it's downright dated really. But it works in its own way. Some emphasis here is on the physical character of the espresso, hence the use of the monsooned coffee, which has properties in terms of crema that no other coffee possesses. Even in cupping the dynamics of the foam/bubbles are clearly different from other coffees due to the changes in the bean from the monsoon processing technique. A note on visual grade - the defect count will vary, but our \"1 full defect per 300g\" is us being on the safe side since the Monsoon coffee can have bug holes. That said, we buy the best visual and cup grade available (and we'll let it run out of stock rather than buy sub par product!) and this should not have an affect on flavor.","CuppingNotes":"8/27/21: We got our hands on the missing Monsoon ingredient ahead of schedule! We'd tried other offers prior, but nothing was at the quality level we require for this blend. This lot of Monsoon is a fresh arrival (mid July), and has a subtle, nutty sweetness that is a welcome in this otherwise body blend component. It has more of a yellow shade than some of our previous Monsoon Malabars, which is simply due to the way this particular lot was processed. Enjoy!Extracted in a properly functioning, clean espresso machine the blend produces a lot of crema, making the mouthfeel very thick and creamy. The sharp pungent bite to the blend has a pleasant bitterness to it, like roasted cacao nibs, and fades into a rich aftertaste of dark and semi-sweetened chocolates. If properly roasted (not scorched) the blend will not be ashy, something I really don't like in espresso. (With any espresso, if the aftertaste turns acrid and bitter after 3 minutes or so, your espresso machine may be overdue for a backflush!) We're using a fresh Costa Rica ingredient this time around that brings a nice level of sweetness to the blend. Short and long shots show hints of fruit, sweet smoke, caramel, umami, and cream in the extended aftertaste. This blend works extremely well in milk drinks, meaning by that a true cappuccino (6-9 oz.) or machiatto. I make no claims for Latte ... is there any coffee that tastes potent mixed down 8:1 in a Slurpee-sized cup of milk? Liquid Amber Note: If the coffee arrives and doesn't appear evenly blended, this is because of the vibration during loading and shipment. I can positively guarantee you that the blend was packed in the exact, correct proportion (we are extremely careful about this), but the difference in size/density of the Monsooned/non-Monsooned can make them separate a bit with vibration. Just give it a stir....","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 17-19 Screen - defect count will vary, but we're being on the safe side since the Monsoon coffee can have bug holes. That said, we buy the best visual and cup grade we can and this should not have an affect on flavor.","Cultivar Detail":"Varies","Processing":"Varies","Recommended for Espresso":"Yes","Roast Recommendations":"I advocate a Northern Italian style roast (lighter espresso roast, really a Vienna roast, stopped 30-45 seconds into 2nd crack), but the blend works very well at the darker Southern Italian style roast (a full French roast actually, at the peak of a rapid 2nd crack). Either way, get this into 2nd crack and allow proper resting that espresso demands: 48+ hours is best. This blend works great in air and drum roast machines and I developed it test-roasting on both. If you notice a tingly \"baking soda effect\" in your mouth, then the coffee could use more rest.","Type":"Sweet Maria's Blends"}}
{"Title":"Sweet Maria's New Classic Espresso","Overview":"A classic, balanced espresso, but without the baggage of the old world espresso conventions ...and without robusta! The espresso has balanced bittersweet notes, thick and opaque body, almond and chocolate roast flavors, hints of spiced fruit in aroma. Full City+ and beyond.","Score":87,"URL":"https://www.sweetmarias.com/sweet-maria-s-new-classic-espresso.html","SKU":"GCX-2933","FarmNotes":"Once there was \"Classic Italian,\" our espresso blend to set the benchmark for traditional European-style espresso. It was a blend based on quality Brazil coffees, with a touch of aromatic Central American coffee to add a grace note to the cup, and it had a small percentage of premium robusta in it for crema, mouthfeel, and to add traditional flavors found on the continent. But times change and tastes change. Espresso culture is much less Euro-centric, and for good reason. While Italy gave us espresso, the general quality of your average espresso there can be quite poor. Don't even talk about coffee in France. The big brands in Europe are largely run by multi-nationals who keep a close watch on price, and gleefully buy lower quality green coffee if they can save .01 Euro. The privates follow suit, in order to compete. Of course, there are many exceptions, but the darker roast styles, well into 2nd crack, to cover up the use of low quality green coffee ... well, that is NOT something to emulate. For Sweet Maria's, espresso has never been our \"dumping ground\" for coffees we can't sell, old lots, or ones with mild defect. It's been a program where we have dedicated time, focus in cupping, and roast testing. With this in mind, we want to start over again, and offer New Classic, a somewhat silly name, an oxymoron, and overused ... but it says what I want it to say: Here is the new benchmark espresso with sweet-bittersweet balance, body, crema, and finesse, the core definition of the espresso beverage, and defines it in the established West Coast espresso style (clean, bright notes) without the burden of European espresso conventions. In other words, no robusta! Oh, and No obsessive interest in crema! (You can produce buckets of crema in espresso and still have a very mediocre-tasting cup. What ... do you make espresso just to look at the beautiful crema? No dummy, you make it to drink it!). New Classic generally involves Brazil as one of the base ingredients, with washed Centrals and South American coffees bolstering sweetness, and of course, chocolate roast tone. Blend ingredients will change with what's in season, but we always shoot for flavor continuity.","CuppingNotes":"While this blend is designed primarily for a lighter roast, stopping the roast before 2nd crack, it also works well with a darker roast treatment. It does not have the extreme brightness that have been the trademark of some of our Espresso Workshop blends; it is a bit more restrained in it's overall demeanor. The cup has a balance between sweet and bittersweet flavors, moderate bright accent, soft traces of fruit, body and depth. The lighter roasts have a very sweet aromatic, fruited with plum and a hint of spice (cinnamon stick, cardamom). Darker roasts tend toward chocolate laced with dark fruit tones, in both aroma and cup flavor. Both have a firm, opaque body, with toasted almond roast notes as the espresso cools. In the aftertaste, peach tea flavor (and it light roasts a bit of jasmine tea) are evident. Of course, results vary with how the espresso machine and grinder are set up. We use 8.5 bars of pressure at the head, with 202 degrees water temperature (measured at the head) to start, dropping to about 198. At higher temperatures, it's a more aggressive espresso with a bittersweet edge and well-suited to milk drinks.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-18 Screen","Cultivar Detail":"Varies","Grade":"Top Grade","Processing":"Varies","Roast Recommendations":"We recommend a range of roasts from FC, FC+ to light Vienna. That means just ending the roast just before 2nd crack (FC), a few snaps into 2nd crack (FC+), or as second crack begins to gain some momentum (Vienna)","Type":"Sweet Maria's Blends"}}
{"Title":"Sweet Maria's Moka Java SWP Decaf Blend","Overview":"Moka Java decaf has returned! Butter caramel sweetness meshes with fruit pastry notes, berry, banana, cinnamon-laced sugar, browned butter, herbaceaus hints, and considerable bittersweets in dark roasts. City to Full City. Good espresso.","Score":88.1,"URL":"https://www.sweetmarias.com/sweet-marias-moka-java-swp-decaf-6811.html","SKU":"GCX-6811","FarmNotes":"After the success of our \"DIY Decaf Moka Java\" blend kit, we've decided to put together our own version pre-blended for you. This isn't something we're blending with green decaf we have on hand, but rather a custom blend of coffees processed together at the Swiss Water decaf plant in Vancouver, BC. The timing for this blend was right. We had a fresh container of Indonesian coffees arrive and plenty of Ethiopia dry process lots to choose from, settling on two from Sumatra and a single dry process from Ethiopia. The goal of the blend was to produce a Moka Java version that showed big body, brooding bittersweetness when roasted dark, and with some wilder fruit accent notes that can be tempered (or not) with roast development. These three coffees together really hit the mark. The \"original\" Moka Java was comprised of two of the earliest coffees to be exported from Yemen and Java, hence the name. This modern take on the classic two-origin blend has slightly more acidity due to the Ethiopia ingredient, though still far from a 'bright' coffee. Let's call it, bright for decaf. I can honestly say, it's a resounding success and is hard to pinpoint as 'decaf' coffee at all! It's worth noting that the \"88\" score should be taken in context of other decafs. This is an incredibly forgiving coffee where sweetness is a prominent feature at a very wide range of roast levels.","CuppingNotes":"We roasted this custom decaf blend to City+ and a dark Full City. The more developed roast presented a lot darker in both flavor and color, and had a more pungent flavor profile that hinted at burned sugars and dark syrupy molasses without pulling out any off or ashy flavors. The coffee lets off an interesting fragrance and aromatic profile for decaf, from blackstrap molasses, to honeydew sweetness, to black pepper spiced notes, and an earthy sweet low tone that offers a 'nod' to the Indonesian blend components.  City+ roasts make an amazing cup, and I honestly wouldn't know it's decaf if no one told me! There is butter caramel sweetness meshed with cooked fruit that seems like pastry filling: berry jam, hint of banana, cinnamon-laced sugar, and browned butter. It's not a bright cup, but not flat at all either. The fruit flavors at this lighter end of the spectrum give the cup a nice acidic impression, false as it may be, it's still quite effective in adding some cup structure. Body is substantial and fruit adds complexity, so a very successful Moka Java blend in that respect. Our darker roast lost much of the fruit and buttery pleasantness, with more pungent spice notes, and burnt sugars taking over. It's definitely a nice dark roast coffee, and there are still some berry flavors folded in, just more in the distance than at City+. Also, keep in mind that with decaf, it's easy to go too dark, so erring on the light side is ideal to start, then adjust as needed.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 14-18 Screen","Arrival date":"April 2022 Arrival","Bag size":"n/a","Cultivar Detail":"Heirloom Cultivars, Abyssinia, Ateng, Tim Tim","Drying Method":"Patio and Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Top Grades","Lot size":"n/a","Packaging":"GrainPro Liner","Processing":"Dry Process + Wet Hulled, then SWP Decaf","Recommended for Espresso":"Yes","Region":"Ethiopia and Sumatra","Roast Recommendations":"City to Full City","Type":"Farm Gate, Decaf"}}
{"Title":"Sweet Maria's Moka Kadir Blend","Overview":"The all dry process Moka Kadir blend offers an underpinning of rich chocolate low tones, rustic palm sugar-type sweetness, earthy dried fruits, velvety mouthfeel, and finishing hints that are leathery, herbal, fruited, and of course bittersweet. Full City+ to Vienna. Good for espresso. ","Score":88.2,"URL":"https://www.sweetmarias.com/sweet-marias-moka-kadir-blend-4463.html","SKU":"GCX-4463","FarmNotes":"Moka Kadir is a staple on our list most of the year, and with Yemeni coffees back in stock, it makes a triumphant return. The components are all dry-processed coffees from Yemen, Ethiopia and small amount of Brazilian coffee. Between these three, we find an espresso on the rustic and exotic side, some fruit-forward character and earth-toned bittersweetness in full effect. It's great as espresso in the Full City+ to Vienna roast territory, and the mix of dry process coffees handle well in the roaster, regardless of the difference in density when sticking to the recommended roast range. Full City roasts may show some variance, and I recommend taking your roasts closer to Full City+ development which will help afford roast evenness. Slowly ramping up the heat will also help in this effort if your roaster has manual heat control. For those without (like a popper for example), try slowing your roast by slightly overloading the chamber and I wouldn't stop the roast development until you're on the heels of 2nd snaps. (I \"overload\" the roast chamber by first turning the popper on, then adding coffee until just after it stops moving - it should only take a few seconds to get the coffee moving again). A balance of sweet and bittersweet flavors are achieved with rustic layers woven in both fruited and earthy. Moka Kadir has incredibly velvety body too that works very well in milk drinks.","CuppingNotes":"The dry fragrance of Full City+ roasts has a strong rustic sweetness like palm and date sugars, along with smokey cocoa, and a sweet fruited underlay. The wet aroma sticks close to this, fruited sweetness building in the steam, and pungent bittersweetness is strengthened as well. The cup is the culmination of all the intense aromatics, and more. Dense, thick body adds to the sense of an almost chewy cup character! Full City+ roasts show a bittersweetness of smoky cacao nib and mesquite notes, offset by sweet molasses and chocolate syrup, that all do well to ground the wilder cup characteristics. Espresso is where this blend really shows best, with an underpinning of rich chocolate layers, high % cacao up front, roasted nibs in the middle, and an unsweetened baking type chocolate flavor that lingers long into the finish. Dried fruit notes are played up in the cup, due in large part to the Ethiopian component that finds footing in the flavor profile. Notes of slab apricot and plum offer fruited counterpoints to the bold, bittersweet low tones, and are distilled down to an opaque fruited chocolate flavor. The top notes in the finish are leathery, herbal, fruited, earthy, and of course, bittersweet. The mouthfeel of Full City+ and Vienna roasts as espresso is velvety, and offers a delicious espresso base for milk drinks. Moka Kadir is made up of all dry process ingredients, so you can expect quite a bit of chaff during roasting. It seems to really benefit from an extra day of rest too, which allows some of the more disparate flavors to come together. Try degassing for 48 hours before drinking if you can wait...3+ days even with Full City+ roasts.","Images":null,"AdditionalAttributes":{"Appearance":"1d/300gr, 15+ screen - expect a few quaker beans in the roasted coffee, to be expected from dry process coffee, especially the Yemeni ingredient","Arrival date":"All current crop coffee","Bag size":"n/a","Cultivar Detail":"Bourbon, Catuaí, Mokha, Heirloom Cultivars","Drying Method":"Patio Sun-dried \u0026 Raised Bed Sun-dried","Grade":"Top Grades","Lot size":"n/a","Packaging":"GrainPro liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Yemen, Ethiopia, Brazil","Roast Recommendations":"Full City+ to Vienna","Type":"Sweet Maria's Blends"}}
{"Title":"Timor Leste Dukurai Daurfusu","Overview":"A sweet undercurrent, subtle fruited hints of raisin, red apple, and peach skin, with dark roasts pulling out intense roast bittering, German chocolate cake, and smokey cacao nibs. City+ to Full City+. Good for espresso.","Score":86.5,"URL":"https://www.sweetmarias.com/timor-leste-dukurai-daurfusu-7201.html","SKU":"GCX-7201","FarmNotes":"You may recognize this coffee name from previous years, and it's from many of the same small holders in this region. The biggest difference with this year's coffee is that the farmers are delivering whole coffee cherry to a central processing station instead of managing the wet processing individually at home. The cherry collection and new wet mill where the coffee is handled is run by the same Farmpro group who we've bought Timor Leste coffee from the last few years, and they only continue to refine their process. The Daurfusu wet mill is located in Dukurai village, Letefoho District. Initially comprised of 37 members in Dukurai, the operation has cast a wider net this year and is buying coffee from neighboring high altitude zones as well. Farmers in this area are growing a mix of cultivars, mostly Timor Hybrid and Typica, at altitudes of 1400 to 1600 meters above sea level. The arrival of washed Timor Leste coffees comes at a time when we are running low on Central American options, and in terms of flavor, they work quite well as replacement! But they also just shine on their own, offering a flavor profile that's uniquely positioned within the coffee producing regions of Southeast Asia and Indonesia.","CuppingNotes":"Tasting this coffee alongside a more basic Guatemalan offer really helped to put flavors in perspective. This is an Indonesian coffee, sure, but the clean, sweet flavor profile allows it to blend in with washed coffees from Latin America more than many of the traditionally processed coffees back home. The dry fragrance has an understated raw sugar sweetness, along with an accent of green tea with roasted barley. The wet aroma has caramelized sweetness, and nice intensity. The cup offers a similar sweet undercurrent (scores a rock solid 8.5), hints of demurara sugar and caramel, with very subtle fruited top notes, raisin, red apple, and some peach skin. My darkest roast reached Full City+ (around 5 seconds of 2nd Crack), which brought out intense roast bittering. The dark roast development added smokey aspects to the cup, which comes together nicely with the base sweetness, for flavor profiles of dark chocolate covered black currants, German chocolate cake, and smokey roasted cacao nibs. And while not the sweetest dark roast, the cup showed a unique peppery note, with smokey tones that presented a flavor of a Sumatran-leaf cigar. ","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Timor Hybrid, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"65","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Dukurai Village, Letefoho","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Timor Leste Ermera Fatu Besi","Overview":"Fatu Besi is a mild acid cup, with a sort of smokey sweetness ala dark corn syrup, roasted cacao bittering, caramel Cracker Jacks, and capable of developing robust roast flavors. City+ to Full City+. Good for espresso.","Score":86,"URL":"https://www.sweetmarias.com/timor-leste-ermera-fatu-besi-7157.html","SKU":"GCX-7157","FarmNotes":"This wet process coffee was purchased from a milling operation located in Railaco town, Ermera District of East Timor (\"Timor Leste\"). More specifically, this particular lot is made up of coffees from small coffee producers in the nearby town of Licsala, with the municipality more generally known as Fatu Besi. The farms in Licsala are around 1600 meters above sea level, and coffee stretches up a few hundred meters higher. Most of the coffee processed in Timor is wet process, where fermentation is used to remove much of the coffee fruit, the coffee laid to dry in its protective parchment layer. Most of the coffee planted in this region are Timor hybrids that are resistant to many coffee-related diseases, and older Typica cultivars. This versatile wet process coffee is sure to produce crowd-pleasing cup flavors at both medium and darker roast levels. In that way, it makes a nice substitute for some of the more simple, bittersweet Central American coffees.","CuppingNotes":"Washed Timor's hold such an interesting place within the flavor palette of Indonesian coffee. Most coffee from East Timor are wet-processed, and tend to tick off the boxes of more crowd pleasing type coffee flavors, much like a versatile Latin American coffee. Fatu Besi has a nice, simple sweetness, with mild raw sugar smells, and a bit of roasted cacao-like bittering in the mix. A scent of dark caramel comes up in the steam, and brings to mind Cracker Jacks with peanuts. The caramel flavor comes through in the cup as well, adding to a smokey sweetness that reminded me of dark corn syrup (though not as intense in volume of sweetness). Fatu Besi is a pretty low acid cup too, and capable of developing robust roast flavors, both tend to be qualifiers for espresso consideration.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen","Arrival date":"March 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Timor Hybrid, Typica","Drying Method":"Patio Sun-Dried","Grade":"Grade 1","Lot size":"45","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Licsala, Fatu Besi, Ermera","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Yemen Al Qafr Hawari","Overview":"Follows a rustic sweet blueprint, with notes of pistachio cookie, malted chocolate, ginger powder, sesame candies, corn syrup, and tobacco leaf. Super chocolatey dark roasts that stand up to milk! City+ to Vienna. Good for espresso.*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.","Score":87.3,"URL":"https://www.sweetmarias.com/yemen-al-qafr-hawari-7180.html","SKU":"GCX-7180","FarmNotes":"*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.This coffee lot is comprised of coffees from the small holder coffee farmers in Al-Qafr District, within the Ibb Governorate, due south of Sana'a. \"Hawari\" is the name given to the local heirloom in the town of the same name (sometimes spelled \"Hiwar\"). This lot was secured through Fatoum Muslot, who runs the family coffee business, Pearl of Tehama, started by her father back in the 1950s. Fatoum has set up a buying project in this region (and several others) where they are currently buying from 131 local farmers. Coffee is grown organically, though without certification. Fertilizer typically used is some sort of mixture of composted animal manure and leaves, and most of the pest control is handled with old techniques like smoking wood. The coffee is grown in hot, arid conditions, and trees produce very little coffee in comparison to what you see in most other coffee growing regions. Cherries are harvested and dried on roof tops, which creates a patchwork of color when looking down at the coffee towns from above. Fatoum's family have long exported Yemeni coffee, and since Fatoum has started managing the group, she has worked to implement practices such as more stringent hand sorting and using Ecotact storage bags in order to directly affect their coffee's overall quality. We're quite pleased with the physical condition of both coffees we bought from Fatoum this year, the lack of underripe coffee and shipping in Ecotact liners has really benefitted the resulting cup quality. During their long history in the coffee trade they've forged connections with farming groups in several growing regions, and because of these connections, are able to buy coffee in a more direct way. Since the war broke out in 2014, the fighting has had devastating effects on the people of Yemen, and unfathomable loss of life. It's also stifled the movement of coffee to some degree, which has it's own negative impact on the livelihood of small farmers. The situation there is still quite dire, and I'm amazed that anything is making it out of the country. Read our interview with Fatoum Mouslot from 2020.","CuppingNotes":"This may be a dry processed coffee, but Hawari doesn't suffer from the funky fruit that comes with poor drying. I pick up on a lot of caramelized sweetness in medium roasts, like cooked brown sugar, and banana flambé in smells. The wet aroma has such a nice banana bread note too, with a hint of cinnamon, dried date, and molasses cookie. At City+ roast level, Hawari brews an interesting rustic sweet blueprint of earth-toned bittersweetness, dried fruit and nut, and aromatic spices. Flavors profiles open up to notes of pistachio cookie, malted chocolate, and a dash of ginger spice powder in the aroma. The sweetness at City+ includes aspects of molasses coated sesame snacks, dark corn syrup, and semi sweet chocolate chip. There's a tobacco leaf flavor that comes up as the coffee cools, along with chocolate covered nut, and a pleasantly bittering unsweetened cocoa flavor in the finish. Dark roasts are loaded down with bittersweet chocolate flavor, perhaps a little heavier on the 'bitter' rather than 'sweet' - I don't mean that in a bad way. To me it has the appeal of a really high % cacao bar, or baking cocoa powder with just a dusting of sugar to add depth of flavor. It's a dark roasted brew that holds up to milk very well, and will double nicely as espresso in that regard too.","Images":null,"AdditionalAttributes":{"Appearance":"1+ d/300gr, 14+ screen - the majority of the coffee looks 15+, expect a few full and partial quakers and some broca damage, but really clean compared to the typical Yemeni coffee we see!","Arrival date":"April 2022 Arrival","Bag size":"32 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"50","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Hawari, Al Qafr District","Roast Recommendations":"City+ to Vienna","Type":"Farm Gate"}}
{"Title":"Yemen Bani Haraz","Overview":"Middle roasts build out a bittersweet chocolate core, expanding to creamy Brazil nut and raw cacao, notes of dried fig, pepitas, chocolate malted grains, brown ale, cooked pumpkin, earthy rhubarb, cola, and some palo santo incense. City+ to French. Good for espresso.*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.","Score":87.3,"URL":"https://www.sweetmarias.com/yemen-bani-haraz-7181.html","SKU":"GCX-7181","FarmNotes":"*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.Bani Haraz, which we've also referred to as \"Harasi\", is a coffee from the district adjacent to Ismaili, and in fact they merge to some degree. If you travel west on the road from the capital Sana'a, toward Hodeidah on the Red Sea, you will pass quite close to Harasi, as I did when traveling to Yemen a several years back. I visited an amazing zone within Harasi with towering, ancient stone villages, like castles precariously perched atop steep precipice. It was incredibly dramatic. All the coffee here is grown on terraces, since little land exists that is flat, except for the lowland deserts. The coffee is hauled up remarkably steep slopes, carried in small amounts, most often by donkey. This lot was secured through Fatoum Muslot, who took over the family coffee business started by her father back in the 1950s. They've long exported Yemeni coffee, and since Fatoum has started managing the group, she has worked to implement practices such as more stringent hand sorting and using Ecotact storage bags in order to directly affect their coffee's overall quality. We're quite pleased with the physical condition of both coffees we bought from Fatoum this year, and shipping in Ecotact has really helped with the long transit times from Yemen. Read our interview with Fatoum Mouslot from 2020.","CuppingNotes":"Bani Haraz, which we've also referred to as \"Harasi\" is a coffee focused around rustic sweetness, body, and a wilder side of earth and subtle fruit tones that are particularly potent in the middle roast range. The sweetness in the dry fragrance is unrefined, and a lot like the smell of sugar browning in a pan with a smokey bittersweetness to it, along with notes of chocolate pistachio, toasted pumpkin seed, and wood spice hints. The aroma is complex (no surprise, with layers of coconut palm sugar, chocolate raisin, cooked squash, cocoa and allusions to natural dehydrated fruits when breaking through the crust. Harasi should be roasted to City+ minimum, but I really think Full City is a good starting point. Middle roast levels build out a bittersweet chocolate core that expands to include creamy Brazil nut and raw cacao, leaving room for top notes of fruit and rustic leathery notes that add to the cup intensity. The cooling coffee produces flavor aspects of dried fig, pepitas, chocolate malted grains, and a brown ale note in the aftertaste (I wrote \"Newcastle\", but I don't think it's that specific!). There is a cooked pumpkin flavor too that points to pie filling, with earthy rhubarb, cola, and some palo santo incense. My darkest Full City+ roast pushed bittersweet cocoa roast tones to their limit, with wisps of sweet smoke, black licorice, and aromatic apple wood smoke. This viscous coffee also makes an intense shot of espresso on its own, as well as a bittersweet/body ingredient for espresso blending. No matter how you roast it, Harasi will benefit from rest after roasting, and I really think 48 to 72 hours is best, especially for darker roasts.","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 14-17 Screen - grading conservatively, and surprisingly clean for Yemeni coffee!","Arrival date":"April 2022 Arrival","Bag size":"32 KG","Cultivar Detail":"Heirloom Varietals","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"100","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Bani Haraz","Roast Recommendations":"City+ to French","Type":"Farm Gate"}}
{"Title":"Yemen Mokha Matari","Overview":"Matari is always a standout Yemeni coffee, this year's showing balanced chocolate flavors, fruited sweetness, chai spice, dried apricot, banana, berry, baked apple, sandalwood, aromatic pipe tobacco...as complex as they come! City+ to Vienna. Good for espresso.*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.","Score":89,"URL":"https://www.sweetmarias.com/yemen-mokha-matari-7179.html","SKU":"GCX-7179","FarmNotes":"*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.Matari is one of the few coffees from the growing regions surrounding the high-altitudes of Sana'a that was traditionally kept separate. All others were mixed to form \"Sana'ani coffee\" with decidedly mixed outcomes. But coffee in Bani Matari is a bit different, tall old-growth trees that appear like a fruit orchard than a typical coffee farm (well, NO coffee production in Yemen looks like a coffee farm anywhere else!). This lot was secured through Fatoum Muslot, who took over the family coffee business started by her father back in the 1950s. They've long exported Yemeni coffee, and since Fatoum has started managing the group, she has worked to implement practices such as more stringent hand sorting and using Ecotact storage bags in order to directly affect their coffee's overall quality. We're quite pleased with the physical condition of both coffees we bought from Fatoum this year, the lack of underripe coffee and shipping in Ecotact liners has really benefitted the resulting cup quality. During their long history in the coffee trade they've forged longstanding connections with farming groups in several growing regions, and because of these connections, are able to buy coffee in a more direct way. This lot is made up of coffee from roughly 100 farmers in Bani Matari, who on average have 1000 trees planted on less than 1/2 hectare of land. Altitude is extremely high, starting around 2000 meters and stretching upwards of 2400 meters above sea level. This It's been a few years now since we've picked up Yemeni coffee, not necessarily by choice, but mainly due to the difficulties exporting from a country at war. The situation there is still quite dire, and I'm amazed that anything is making it out of the country. Read our interview with Fatoum Mouslot from 2020.","CuppingNotes":"Matari has a rustic appeal with syrupy sweetness, dried fruits, earth and spice notes, and a whole lot more. We certainly give them a pass in cleanliness given the long road Yemeni coffee takes before final export, but it is not a stretch to say they are some of the most complex coffees out there. The dry fragrance produces smells of dried banana, sweet squash, nut brittle, and aromatic sandalwood. The wet aroma has a nice balance of cocoa and fruit smells, earth-toned chocolates, and hints of stewed berry. Matari shape-shifts across roast levels and as the coffee temperature comes down a bit. While this coffee is rustic for sure, it's in a much cleaner camp relative to Yemeni coffee (at least in my experience). The coffee reveals a delicious fruited side, with glimpses of natural dried apricot, cooked berry reductions, and baked apple (even a bit on the 'tart' side of apple skin). The chocolate flavors are well defined, offset by molasses type sweetness, and aromatic hint of chai spice. Roasting to Full City, a dried fig hint quickly gives way to rustic cocoa powder bittering, and a pipe tobacco accent leaves a lasting impression in the finish. Yemeni coffees need rest after roasting, giving the coffee time to off gas, and allowing flavors to coalesce. They're certainly aromatic at 12 hours or 24 hours, but the depth of flavor really comes together with more like 72 hours rest after roasting. This is especially true for dark roasts, and roasts for espresso. ","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 14+ screen - I'm grading conservatively to temper expectations, but this coffee is a really nice sort for Yemen. You'll likely see a few quakers, broken beans and minor bug holes.","Arrival date":"April 2022 Arrival","Bag size":"32 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Patio and Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"150","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Bani Matari","Roast Recommendations":"City+ to French","Type":"Farm Gate"}}
