{"Title":"Brazil Adair Oliveira Neto","Overview":"Atypical Brazil dry process, pleasant flavors of simple brown sugars are propped up by mild apple-like acidity, a crisp Bartlett pear note, and subtle sweet herbals add an aromatic quality to the cup. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/brazil-adair-de-oliveira-neto-7119.html","SKU":"GCX-7119","FarmNotes":"While we know who this coffee is from, we don't have a whole lot of information on their farm just yet. This coffee was sourced through an intermediary who are buying single farm lots from smaller estates throughout the Cerrado region. This coffee comes from a farmer named Adair de Oliveira Neto, and his farm is called \"Nova Aliança\", sits at 700 meters above sea level, and planted in Catuaí. The coffee is dry processed, meaning it is dried with the whole cherry intact. That's a lot of excess moisture to release, and usually takes upwards of 3 weeks to fully dry. We were struck by the refined flavors in the cup, conducive to light roasting (and dark too!), and really left us wanting to know more about Don Neto in the hopes of buying again next year! For now, let's enjoy what we have in front of us, 25 bags of a really unique Brazilian dry process coffee.","CuppingNotes":"The single farmer Brazils we bought this year are so dang impressive, and this lot from Oliviera Neto is another atypical dry process Brazilian coffee. The fragrance of the dry ground coffee has sugar browning type sweetness, with notes of crisped toffee with peanut, lime zest, and an herbal undertone. The aroma conjures up aromatic impressions of butterscotch sauce, and torched sugars. City and City+ roasts have a raw sugar sweetness, a pleasant flavor of simple brown sugars is propped up by apple-like acidity, which helps to convey a 'clean' cup profile. The coffee has a crisp Bartlett pear note, with subtle sweet herbal accents that add a nice aromatic quality to the cup. My Full City+ roast was just too dark for this coffee. The bittering flavors need countering sweetness to help balance things out, and they just weren't there. Full City is the maximum roast I'd recommend, steering clear of any 2nd snaps.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"February 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Catuaí","Drying Method":"Patio Sun-Dried","Grade":"Estate","Lot size":"25","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Region":"Cerrado, Minas Geraís","Roast Recommendations":"City to Full City"}}
{"Title":"Brazil Carmo de Minas SWP Decaf","Overview":"Sipid sweetness of unrefined sugars fades to balanced roast bittering, with hints of chocolate-covered raisin, sesame chocolate halvah, and substantial body helps make this a crowd pleasing brew. City to Full City. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/brazil-carmo-de-minas-swp-decaf-7231.html","SKU":"GCX-7231","FarmNotes":"This coffee comes to us from the region of Carmo de Minas, in the Mantiqueira micro region, an area that boasts over 2000 smaller coffee farms. It started off as a non-decaf coffee that we liked so much, we peeled off a few pallets specifically to send off for decaffeination. All of our decafs are processed by Swiss Water Process in Canada, whose patented process uses only water to remove  99.9% of the caffeine content and leaving much of the volatile compounds intact. A bit about the farms that went into this decaf: At roughly 30-50 hectares each, the farm sizes aren't \"small\" when comparing with the small holder farms we buy from in regions like Colombia for example. But they're small for Brazil, home to massive estates with fully mechanized harvesting operations. These smaller estates still manually pick coffee as opposed to using machinery, allowing for better separation of ripe and underripe cherry. The farms are located around the Pedra Branca mountians, plantings in the 1300 meter range and planted mainly in Yellow Bourbon and Catuai,. I was pleasantly surprised to hear an audible 'snap' at the first signs of fracturing, which isn't always the case with decaf. This one's not too difficult to judge roast development by sound, but sight is always a little trickier since the coffee is already degraded and dark from the decaf process. Try pulling it a little sooner than you think and adjust from there.","CuppingNotes":"The dry fragrance has a sweet almond note, marzipan, almond cookie, with some bread malt type sweetness behind it. Full City roasts have convincing chocolate smells, spiced dark chocolate, chocolate sesame. The wet aroma is even sweeter, with caramelized sweetness complimented by a nice note of fruit and nut bar, and some granola with raisin. This is a well-balanced decaf at a pretty wide roast range, and perhaps most important, it even makes a great cup when roasted light. I'll be honest, I expected more typical nutty Brazil coffee flavors going in, but what I tasted was a nice, sweet surprise! The cup profile has sipid sweetness of unrefined sugars that fades to balanced roast bittering. My lighter roasts produced hints of chocolate-covered raisin, sesame, that constructs a flavor profile of chocolate halvah (Middle Eastern treat made with sesame tahini and chocolate). The coffee has some decaf flavor aspects in the cup too, but didn't detract from my lightest roast, and was negligible in medium roasts. I found body to be substantial at Full City, which not only helps make this a crowd pleasing decaf, but also indicates a creamy decaf espresso too.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen - some broken and misshaped beans due to decaffeination","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon, Catuaí","Drying Method":"Patio Sun-Dried","Grade":"Estate","Lot size":"53","Packaging":"GrainPro Liner","Processing":"Dry Process, then SWP Decaf","Recommended for Espresso":"Yes","Region":"Carmo de Minas","Roast Recommendations":"City to Full City","Type":"Decaf"}}
{"Title":"Brazil Carmo Fazenda Furnas","Overview":"Notes of molasses and banana nut breads, barley malt, bittersweet chocolate, low acidity, creamy mouthfeel, and hints of dried fruit in the background. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/brazil-carmo-fazenda-furnas-7173.html","SKU":"GCX-7173","FarmNotes":"Rinaldo Junqueira owns and operates Fazenda Furnas, an 80 hectare farm located in the Pedralva region of Carmo de Minas. The farm is situated in the highlands, topping out at 1300 meters and planted mainly in Yellow Bourbon and Catuai. Fazenda Furnas has a fairly modern infrastructure replete with a sustainable water recycling set up where water used to process the coffee is collected in a pond onsite which is then returned to be used for farming. This particular lot is natural process coffee. The climate in the area is ideal for producing naturals and this lot exemplifies this, producing a sweet, fruited, and rather 'clean' cup. We noticed a few full quakers in the 200 grams of roasted coffee. They're easily picked out, but honestly, aren't as noticeable in large batch brewing as the coffee has nut tones to begin with. Like most Brazilian coffees the cup quality is bolstered significantly with rest after roasting. We prefer at least 48 hours!","CuppingNotes":"This natural from Fazenda Furnas has subtle fruits, but with a nice, mild sweetness that rounds out the cup quite well. The dry fragrance has a smell of dried whole banana, honey wheat bread, and a hint of caramel-coated peanuts. The sweet nut smells come off like Thai peanut sauce at City+, malted chocolate, and something like raisin bread. Furnas packs hefty sweetness for Brazil, flavor notes of molasses bread, and barley malt come to mind, which are nicely developed in middle roasts. Nut tones are fairly subdued for Brazil, to be honest. The coffee cools down to reveal hints of fruit, like banana nut bread, and Turkish delights (think \"Aplets and Cotlets\"). Our City+ and Full City roasts brewed well, and anything beyond should yield a wonderfully bittersweet, bodied cup or Brazilian espresso. I think Fazenda Furnas will work very well as a blend base to equal parts washed Central American coffee, and a sweet bourbon type like Rwanda. Though not necessary, we do suggest waiting a full 48 hours post roast to allow the profile to settle into place.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 16-18 Screen","Arrival date":"March 2022 Arrival","Bag size":"59 KG","Cultivar Detail":"Yellow Bourbon, Catuaí","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Estate","Lot size":"70","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Pedralva, Minas Gerais","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Brazil Fazenda Alta Vista","Overview":"Culmination of roasted nut and cocoa bittering aspects, burned caramel, almond and pecan, hazelnut chocolate, chocolate dipped almond brittle, and a hint of apple butter. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/brazil-fazenda-alta-vista-7171.html","SKU":"GCX-7171","FarmNotes":"Alta Vista Farm lies in the foothills of Serra da Mantiqueira, in the Carmo de Minas municipality. This area is known for coffee cultivation, with relatively good altitude for Brazil, and favorable micro climates for both growing and drying coffee. Alta Vista is 84 hectare farm that was started less than a decade ago, and taking 7th position at Brazil Cup of Excellence competition in 2007, just 3 years after being planted. This is an all Yellow Bourbon separation, a cultivar thought to have higher sugar brick count than the red variety, and this coffee definitely has a persistent sweetness to show. This is a dry process coffee, meaning the whole cherry is left intact to the coffee seed (bean) during the drying phase. This tends to produce bigger body, more muted acidity, and occasionally impart fruited flavors in the cup. We found City+ to be the ideal starting point for Alta Vista, which is where a balancing level of sweet and bittering roast tones are achieved. But even keeping this Brazil to City roast level made for a tasty cup.","CuppingNotes":"The coffee from Alta Vista Farm presents a nice culmination of roasted nut and cocoa bittering aspects, showing the most balance around City+ roast level (and even some slight fruit too!). This is where nuanced roast tones are complimented by caramel hints, with almond and pecan flavors folded in. The cup has a nice simple sweetness, touching on burned caramel and hazelnut chocolate. As it cools, the focal point remains centered around a caramel nut and bittersweet chocolate core, our flavor descriptors landing squarely on chocolate dipped almond brittle. But there's also a muddled fruit flavor in the background of the lighter roasts that hints at apple butter and blackberry tea. Alta Vista is a full-bodied coffee that brews nicely at a surprisingly wide roast range, also filling the need for a chocolate toned espresso when roasted to Full City/Full City+.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 16-18 Screen","Arrival date":"March 2022 Arrival","Bag size":"59 KG","Cultivar Detail":"Yellow Bourbon","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Estate","Lot size":"100","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Carmo de Minas","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Brazil Mogiana Vera Lucia","Overview":"A profile that lends itself to milk drinks, opaque bittersweet backdrop, mild nutty sweetness, notes of almond extract, baking cocoa, banana-nut bread, and some earthy spice in the finish. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/brazil-mogiana-vera-lucia-7117.html","SKU":"GCX-7117","FarmNotes":"Vera Lucia Pereira's coffee was sourced through an intermediary who are buying single farm lots from smaller estates throughout Mogiana and Cerrado region. It's a newer Brazilian source for us, and we are still learning about their supply chain, hoping to visit next year. Her coffee farm \"Fazenda Paraiso\" sits at 960 meters above sea level, and planted in Yellow Catuaí. The coffee is dry processed, meaning it is dried with the whole cherry intact. That's a lot of excess moisture to release, and usually takes upwards of 3 weeks to fully dry. We thought his coffee showed relatively clean sweetness in the cup, the flavors most balanced around Full City roast level. You can see the care put into the physical green coffee, as it's been well cleaned of the typical defects you might expect to find in dry process Brazilian coffee (particularly quakers from unripe coffee). This makes for a much more consistent flavor experience from one brew batch to the next. Her coffee has really creamy body too, and functions nicely as single origin espresso, the bittersweet cup lends itself to milk drinks too!","CuppingNotes":"The dry grounds have a molasses bread smell with hazelnut, a hint of natural dried banana, and some rustic earthy accents. The wet aroma displays rustic natural sweeteners like blackstrap molasses and palm sugar at City+, with a cooked cherry accent note, and a hint of warm bread pudding. This is a great middle roast coffee, and I suggest sticking to City+ or darker. My Full City roast made a really nice brew, with mild nutty sweetness that feeds into notes of almond extract, and banana bread with walnut, along with a hint of amaretto. The backdrop has opaque bittersweetness, baking cocoa, and chocolate milk notes, and some earthy spice in the finish. This is the type of profile that lends itself to milk drinks too.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen","Arrival date":"February 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Yellow Catuaí","Drying Method":"Patio Sun-Dried","Grade":"Estate","Lot size":"20","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Cerrado Mineiro, Minas Geraís","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Cameroon Caplami Java Cultivar","Overview":"An interesting, thick bodied cup from a lesser seen coffee origin (at least on our list). Notes of caramel, molasses, rustic chocolate, pipe tobacco, malted grains, cinnamon stick, and earthy sandalwood. Full City to Full City+.","Score":0,"URL":"https://www.sweetmarias.com/cameroon-caplami-java-cultivar-7354.html","SKU":"GCX-7354","FarmNotes":"The first thing some will notice is that this coffee looks more like a dry process (see image). It looks like some of the fruit mucilage was intact during the drying phase, which has led to the yellowish hue in the green. This is consistent with coffee that's been processed with a demucilager to remove the outer cherry, and not fermented to remove the remaining fruit (like honey process coffee). One thing is for sure, it falls under the \"wet process\" category and tastes like it! Cameroon is an oddball in the Specialty Coffee terms. For starters, this is West African coffee, not East African like most other arabica offerings such as Kenya, Zimbabwe, Rwanda. And a large percentage of Cameroon coffee has traditionally been robusta, grown in all provinces except the north, while arabica is mainly produced in the high altitudes of the west, northwest and east. The western highlands of Cameroon, where much of the coffee is grown, averages about 5,000 feet above sea level and has two distinct seasons, the rainy season and dry season, which benefits quality arabica. This lot is from the Caplami Cooperative, located in the region of Mifi. Caplami Cooperative has around 2500 members, and farms are situated at an altitude range of 1300 to 1800 meters above sea level. This is an unusual longberry Java cultivar, quite similar in appearance to the long, pointed Java longberry from Buenos Aires that we offer, though how the two are related is a bit murky.","CuppingNotes":"In terms of the cup, the dominant qualities bear resemblance to Indonesian cup character in a way, with some distinct differences too. The dry fragrance from the grounds have a rustic-toned chocolate scent, with some molasses sweetness, and a wood spice note at Full City. Wet aromas show more of the chocolatey side, with accents of gingerbread, and a mild earthiness. The sweetness in the cup rides a line between caramel and molasses, with dense, thick body, and an earthy, aromatic wood dimension. There are cinnamon stick and sandalwood notes on the nose, and a hint of tobacco, along with a malted grain flavor, add to the aroma. City roasts are just too darn light for this coffee, and even a light City+ to some degree. I'd shoot for a minimum of 45 seconds to a minute after the end of 1st C, and even continue into 2nd Cracks if you're after a bold, bittersweet cup which less of the earthy cup characteristics.*Please note, this java selection has the appearance of a natural/dry process coffee, but is indeed wet process! (see farm notes and photo)","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-17 Screen - The coffee looks like a natural but is indeed washed! The sort is also a little rustic, and you'll find a few defects that should not affect cup.","Arrival date":"August 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Java","Drying Method":"Patio Sun-Dried","Grade":"Grade 1","Lot size":"40","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Mifi","Roast Recommendations":"Full City to Full City+"}}
{"Title":"Costa Rica Honey Corazon de Jesus","Overview":"The cocoa/raw sugar base flavor cools notes of dark berries, yellow cherry, and baked apple. Chocolate roast tones abound in darker roasts, while City roasts are refreshingly bright. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/costa-rica-honey-corazon-de-jesus-7366.html","SKU":"GCX-7366","FarmNotes":"\"Corazon de Jesus\" is a micro mill in the area of Chirripó National Park, deep in the La Piedra de Rivas zone. The mill is run by Jonny Alvarado and his family, where at this time they are solely processing the coffees from their own farms. This harvest was Johnny's second at the mill, and Jonny is a familiar face to us as he originally set up the mill Imperio Rojo with his brother Jose. They both inherited farm land from their grandfather some years ago, and up until three years ago paid to have their coffee milled at one of the other mills in the area. Jonny's operation is much more modest than Imperio Rojo, and for this first year he's built sets of raised drying tables, each with their own arched plastic cover. Last we spoke, his plan was to build a large drying room where he could build more raised beds, and achieve a much more consistent airflow and temperature stability. His farm tops out at just over 2000 meters, and is planted in Catuaí and Bourbon. Jonny and his brother Jose continue to work closely during harvest (it helps that they're right down the road from each other!), sharing a dry mill that was newly installed at Imperio Rojo during the 2016 harvest. This is considered a Red Honey process, which means that roughly 50% of the fruit mucilage is left intact during the drying phase. The fruit turns a dark reddish hue as it dries, which is where the process gets its name. Honey processing can lead to fruit flavors in the cup. Not always, but often, and we did notice an uptick in fruits compared to the washed coffees we've bought from Jonny in previous years. It also means the roast coloring will present darker due to the remaining silver skin intact to the green coffee seed. Much of this will also turn into chaff, something to be aware of when roasting, especially for a roaster with exposed heating elements, such as the Behmor.","CuppingNotes":"The dry fragrance of Corazon de Jesus has a sweetness of brown sugar, with hints of blackberry, and milk chocolate. The wet aroma brings out a bit more fruit, baked goods like fruit tart, or berry filling, with a caramelized/cooked sugar smell that mingles with dark cocoa notes. Light and middle roasts make for a sweet coffee with moderate fruit notes for honey process, big-body, and acidity level on also on the mild to moderate side. The fruit top notes are less restrained than previous years. What starts off as a bittersweet, cocoa/raw sugar base coffee flavor, cools to top note hints of dark berries, yellow cherry, and baked apple. Cocoa roast tones are more dominant in darker roasts, producing bittersweet flavors of torched raw sugar, juxtaposed by a note of semi-sweet chocolate chips, which work well in tandem. Both our City and Full City roasts showed a nice level of acidity too, though a much brighter cup was found in the lighter of the two. The dark roasts make for delicious espresso that shows nicely on its own or with milk. The flavor profile is so chocolate-forward, bittering, a la 80%+ dark cacao bar, viscous mouthfeel, and with a lingering flavor of chocolate-covered dried berry in the aftertaste.","Images":null,"AdditionalAttributes":{"Appearance":".5 d/300gr, 15-17 Screen","Arrival date":"August 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Catuaí","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"SHB EP","Lot size":"20","Packaging":"GrainPro Liner","Processing":"Mechanically Washed","Recommended for Espresso":"Yes","Region":"La Piedra de Rivas, Chirripo","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Costa Rica Tarrazu Cafetales de Dota","Overview":"Crowd pleasing, middle roasts trade brightness for body, with cocoa roast flavors, chocolate biscuit, bittering cacao, light fruited hint, caramelized sugar, and raw pistachio nut. City+ to French. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/costa-rica-tarrazu-cafetales-de-dota-lot-7228.html","SKU":"GCX-7228","FarmNotes":"Dota is a small subregion adjacent to the Tarrazu valley proper, more remote than the areas where most of the coffee in Costa Rica is planted. Great Dota coffees are fairly small sized seeds, with compact density due to the high altitudes they are cultivated at. Some roasters used to believe that the unique Dota cup character was the result of extra fermentation times at the mill during the wet-processing of the coffee. But in fact it is processed the same way that other Tarrazu coffees are, mechanically washed with demucilagers. If there is difference, it may have more to do with the unique soils that are found in the Dota micro-region of Tarrazu, and the tradition of harvesting the coffee cherry very ripe. This Dota micro mill buys and process coffee from small-holders in the surrounding hillside communities, altitude ranging from as low as 1200 meters to as high as 1900 meters above sea level. The coffee is depulped using a mechanical demucilager, which is typical in Costa Rica. While this process uses very little water and forgoes tank fermentation, they do soak the coffee after removing the skin and most of the fruit which helps to clean up the green coffee seed before sending to the drying patios.","CuppingNotes":"City+ and Full City roasting brings a muted brûléed suger note in sweetness that contrasts intense cocoa, and savory roasted nut flavor aspects. Chocolate and bittering cocoa powder notes show throughout the roast range, from semi sweet chocolate in the lighter roasts, to dark cocoa powder in medium, to brooding cacao bittering with high % cocoa solids at FC+ (likely into French for those desiring a really dark roast). This lot is a lower acid cup, trading in sharpness for rounded mouthfeel and the chocolate roast flavors mentioned. As the coffee cools off some, I picked up on a subtle fruit hint, caramelized sugar, raw pistachio nut, and chocolate biscuit. At darker roast levels, especially FC or FC+, the cup has a really nice low tones, and big body with a silky texture. Full City to Full City+ consistently make a nice chocolate-based espresso shot, and would function well for a body/bittersweet blend component too.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 screen","Arrival date":"May 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Caturra, Catuaí","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB","Lot size":"75","Packaging":"GrainPro Liner","Processing":"Mechanically Washed","Recommended for Espresso":"Yes","Region":"Dota, Tarrazu","Roast Recommendations":"City+ to French","Type":"Farm Gate"}}
{"Title":"Costa Rica Yellow Honey La Guaria","Overview":"Rounded sweetness with bittersweet cocoa underneath, hints of raisin and date, and peachy acidity. Dark roasts make tremendous single origin espresso, chocolate cherry truffle, with tangy glazed orange peel. City to Full City+.","Score":0,"URL":"https://www.sweetmarias.com/costa-rica-yellow-honey-la-guaria-7362.html","SKU":"GCX-7362","FarmNotes":"This coffee comes from a family run micro mill called Coffee Nace in Los Santos, Tarrazu. \"Nace\" is a portmanteau of sorts, blending the two family names of Navarro and Ceciliano into one. Apolinio, the matriarch of the family, built the mill more than a decade ago to process the coffee from his family's coffee farms (including his own). Now 93, Apolinio relies on the help of his 6 children to manage production at Coffee Nace and the farms throughout the harvest season. This particular lot is from the La Guaria farm, a 1400 meter, 12 hectare plot of land that is planted entirely in Caturra. It is a yellow honey process, which means that 50% of the fruit is left intact to the seed during the entire drying phase. That extra moisture from the fruit slows the drying process, and often imparts body, fruit, and round off acidity to some degree. It also leads to the coffee looking much darker when roasting, and produces a lot of chaff. It's not hard to roast, per se, but you should pay closer attention to time and the audible snaps, rather than physical coloring for judging roast degree.","CuppingNotes":"I found the sweetness in the dried fragrance to have a buttery accent, that along with mild spice hints, brought out a profile of buttered toast with cinnamon and sugar. Fruit's leave a slightly larger footprint in the wet aroma, though honey and unrefined sugars are still the main feature. The sweetness is well rounded at City and City+, with some indications of bittersweet cocoa beneath it, and the fruited hints relegated mostly to the aftertaste. Body is another notable component across the entire roast spectrum, a creamy tactile mouthfeel with weighty texture. As the coffee cools off a bit, a brighter cup character begins to emerge, with accent notes of red raisin and dried date, and acidity that's a bit like peach juice. My darkest roast saw just a few 2nd snaps in the tray when pulled. The cup is bittersweet front to back, with notes of cooked berry and toasted coconut. This coffee makes a tremendous single origin espresso at this roast level, with flavors of chocolate cherry truffle, glazed orange peel, and some bittering cacao nibs in the long aftertaste.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"August 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Caturra","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"SHB EP","Lot size":"50","Packaging":"GrainPro Liner","Processing":"Yellow Honey Process","Recommended for Espresso":"Yes","Region":"Los Santos, San Marcos, Tarrazu","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Costa Rica Zarcero Finca Salaca","Overview":"Finca Salaca is a balanced coffee with just enough nuance to make it interesting. Molasses, burnt sugar, bittersweet chocolate from middle to finish, hints of caramel apple and berry as it cools. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/costa-rica-zarcero-finca-salaca-7360.html","SKU":"GCX-7360","FarmNotes":"Maria Elena Castro and son Luis Salazar opened their micro mill, Beneficio Las Brisas, back in 2011 after years of delivering their coffee cherry to Helsar de Zarcero and CoopeNaranjo. Maria Elena's farm, Finca Salaca, sits at 1750 masl in one of the more beautiful parts of Costa Rica, and Central America for that matter. The Pacific is the major influence in the West Valley with sprawling views of Naranjo and Alajuela readily available across it. Finca Salaca is planted almost entirely with the Villalobos varietal although some Caturra is mixed in with it as well. Villalobos (also known as \"Villa Sarchi) is a natural mutation of Bourbon. The West Valley was heavily seeded with the varietal in the 50's and 60's and a good portion still remains at these higher elevations. Maria Elena mechanically washes her coffee on a Desacafe machine and sun dries it on raised beds. Leaving that fruit mucilage intact instead of washing it away is the hallmark of honey process coffee. This lot, however, is what some call \"semi-washed\", or \"white honey\", which is the Costa Rican equivalent of a fully washed coffee. The demucilager machine is calibrated to remove as much fruit as possible. Then the coffee is soaked for a short period to help wash away some of the remaining fruit. Without fermentation, there is still a very thin layer of fruit intact. This means the coffee looks a little darker when roasting it, and a much higher instance of chaff than the typical fully washed/fermented coffee.","CuppingNotes":"Finca Salaca is a balanced coffee with just enough nuance to make it interesting. Rustic raw sugar and vanilla melded well together in the dry fragrance of the City roast, while we encountered aromatics like red fruit, and dark cocoa in the Full City roast. The crust on the light roast demonstrated caramel and fruit sweetness, like caramel apple, flanked by hints of toasted nut, and a sweet herbal accent. The apple fruit notes come through in the cup too, and develops some blackberry hints as the coffee cools off some. The underlying flavors in the brew are defined by notes of molasses and burnt sugar, with bittersweet chocolate from middle to finish. This coffee from Finca Salaca has a creaminess in texture regardless of roast level, though bolstered quite a bit at Full City. Darker roasts are chocolatey at their center, with wisps of toffee almond, baker's chocolate, and a sweet smokey note in the finish. Finca Salaca is an approachable coffee that's well suited for almost any roast, and a nice Costa Rican espresso option as well!","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"August 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Villa Sarchi","Drying Method":"Patio and Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"SHB EP","Lot size":"40","Packaging":"GrainPro Liner","Processing":"Semi-washed","Recommended for Espresso":"Yes","Region":"Zarcero, West Valley","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"El Salvador Apaneca Finca Miravalle","Overview":"A convergence of cocoa roast flavors and brown sugar that holds up to dark roasting, layers of dark chocolate, creamy nut tones, and inky body. Great coffee for milk drinks too! City+ to Full City+. Good espresso.","Score":0,"URL":"https://www.sweetmarias.com/el-salvador-apaneca-finca-miravalle-7261.html","SKU":"GCX-7261","FarmNotes":"Finca Miravalle is owned by Luis Duarte, and is located in Apaneca, Ahuachapan, not too far from the Santa Ana volcano. It's part of a much larger group of coffee plots, a few of them demarcated by cultivar separations, and the larger plots a mix of cultivars. Duarte has kept his farm planted in Bourbon and Pacamara for the most part, despite the susceptibility to leaf rust. Many farmers are replanting with disease resistant varietals, but Luis Duarte has chosen to continue with these cultivars because of the commonly held belief that they taste superior to most disease resistent hybrids available and manages to prevent leaf rust and fungal outbreaks with good farm practices (proper space between plants, regular pruning, cleaning beneath the trees, directive spraying, etc). Miravalle is perched on the verdant slopes of the Apaneca-Ilamatepec mountain region at 1500 meters above sea level. I like to think of it as a \"flexible\" coffee, in that it produces a nice balanced brew at almost any roast level.","CuppingNotes":"City+ is a good starting point for this coffee where bittering cocoa and nut tones are matched by a well-developed sweetness and inky body. The dry fragrance has a sweet cereal grain smell in lighter roasts, with more of a well developed cocoa scent at Full City, and aroma of toffee-coated nut lifted in the steam in all our roasts. There's a convergence of chocolate roast tones and brown sugars that will hold up to quite a dark roast level, and actually intensifies with deeper development. The middle roasts are very well-rounded (City+/Full City), with layers of cocoa, creamy hazelnut and cashew, and toasted sweetness in the aftertaste. As espresso, expect layers of cocoa and creamy nut flavors that make a lasting impression. An excellent option for milk drinks whether brewed coffee with cream, a latte, cappuccino and more.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 16-18 Screen","Arrival date":"August 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHG","Lot size":"38","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Apaneca, Ahuachapan","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"El Salvador Finca La Esperanza","Overview":"Balanced cup flavors are sure to win favor, interplay of raw sugar and almond, creamy body and loaded with chocolate roast flavors. Acidity is mild, but tea-like, with a dried apple note adding to the effect. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/el-salvador-finca-la-esperanza-7258.html","SKU":"GCX-7258","FarmNotes":"La Esperanza borders El Boqueron National Park, a majestic natural forest that is home to a multitude of wildlife, and a main feature of San Salvador’s volcano crater. After the roya crisis, most farmers in the region let the original Bourbon and Pacas cultivars die off, replanting with rust-resistant varieties that unfortunately also produce an inferior cup. However, La Esperanza has kept most of its original tree populations, which farm managers have kept productive and healthy by implementing integrated farming practices. The farm is broken into several plots, most with intermixing of Arabigo (Typica) and Bourbon. La Esperanza benefits from being able to hire the same group of pickers each harvest, who know the farm well, and know which cherries are ripe enough to pick. The coffee is transported to a mill in San Miguel where each batch is processed individually under strict processing protocols to ensure the quality of the beans are maintained. La Esperanza is a fairly large farm, and altitude ranges from 1000 to 1350 meters above sea level.","CuppingNotes":"My first thought when cupping this lot from La Esperanza, is how nice the acidity is for a lower grown coffee. At City+ roast levels, there's a touch of vibrance in the cup that comes off like black tea, a welcome acidic impression, albeit subtler than a high grown Guatemalan coffee for example. This coffee tastes like it smells. From fragrance to cup, I get a sweetness that's like partially refined brown sugar and almond, and that come together in the cup like molasses nut loaf. Chocolate flavors are soft in light roasts, and I find the cup to be more about the interplay of raw sugar and roasted nut, with a hint of dried apple that plays well off acidity, and silky smooth body. Roasting into Full City+ is another story altogether. My dark roast was packed chocolate roast flavors, chocolatey, bittering but balanced, and with a walnut accent note in the finish. It's a real 'classic'-toned single origin espresso, dark cocoa flavors are sweetened by notes of almond milk, and toasted sugars, and creamy texture is super nice.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 16-18 Screen","Arrival date":"June 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB EP","Lot size":"50","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Cerro Verde","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"El Salvador Finca Miravalle Tabi","Overview":"Raw sugar sweetness counteracts ample roast tones, notes of Dutch cocoa, Brazil nut, chocolate-covered raisin, flourless torte, moderate acidity level. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/el-salvador-finca-miravalle-tabi-7260.html","SKU":"GCX-7260","FarmNotes":"Finca Miravalle is owned by Luis Duarte, and is located in Apaneca, Ahuachapan, not too far from the Santa Ana volcano. Miravalle is about 1500 meters above sea level. It's part of a much larger group of coffee plots, a few of them demarcated by cultivar separations, and the larger plots a mix of cultivars. Duarte has kept his farm planted in Bourbon and Pacamara for the most part, despite the susceptibility to leaf rust. Many farmers are replanting with disease resistant varietals, but Luis Duarte has chosen to continue with these cultivars because of the commonly held belief that they taste superior to most disease resistant hybrids available and manages to prevent leaf rust and fungal outbreaks with good farm practices (proper space between plants, regular pruning, cleaning beneath the trees, directive spraying, etc). Here lies the exception, a lot separation of the disease-resistant \"Tabi\". This cross between Bourbon, Typica, and Timor Hybrid, created at Colombia's agricultural research institute (\"CENICAFE\") was produced to have the best of both worlds: disease resistance, and good cup quality. Miravalle is only a few hectares in size, and is perched on the verdant slopes of the Apaneca-Ilamatepec mountain region. This lot is the result of a new coffee project in the region by one of the local mills, their goal being to identify the top qualities from farmers they already buy coffee from. These coffees are then kept separate throughout the milling process, sold as an individual micro-lots as opposed to being lost to large blends.","CuppingNotes":"City+ roasts have a fragrance of raw cane sugars in the dry grounds, with pleasant roast bittersweetness, and some tree nut, savory hints. Sweetness is intensified in the wet aroma, giving off a smell of buttery caramel, and balanced sweetness. City+ and Full City have a sweetness of simple raw sugars that counteracts a fair amount of roast bittering and helps to anchor the cup profile. There's a nice balance of core coffee flavors that opens up to muted accents of Dutch cocoa powder, Brazil nut, chocolate-covered raisin, and moderate acidity level that has a black tea aspect to it. In addition to producing a delicious \"daily drinker\" category of coffee, this Miravalle lot is a no-brainer for espresso use too. Ristretto shots promise a compact flavor profile of semi-sweet chocolate chips, flourless torte, and a silky textured liquor that seems to almost adhere the bittersweet chocolate flavors to your tongue so that you're still thinking about them long after you've finished your espresso.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 16-18 Screen","Arrival date":"June 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Tabi","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB","Lot size":"41","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Apaneca, Ahuachapan","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Espresso Workshop #50 - The Skullet","Overview":"Layered bittersweet flavors are accented by fruited hints, and creamy mouthfeel ensures a very long finish! Chocolate-forward profile of high % cacao bar and baking chocolate adds a sharpness to the cup, with hints of stewed plum, and chocolate-covered dried fruits. Full City to Full City+. Fantastic espresso!","Score":0,"URL":"https://www.sweetmarias.com/espresso-workshop-50-the-skullet-7388.html","SKU":"GCX-7388","FarmNotes":"Seeing that the last two Workshops have been named after hair styles, I think we can officially call this a \"theme\". Being our 50th edition of our ever changing Espresso Workshop blends, we wanted to come up with something that riffed on the half-way-to-100 aspect of this particular edition, but we're also dangerously close to Halloween! So here it is, Workshop #50, \"The Skullet\". Like the hairstyle, the coffees that went into this blend are modest up front, with a wilder side in the back end. The blend includes pleasantly restrained Central American coffees that we found made a really nice classic toned espresso on it's own, full of chocolate roast flavors and silky textured. We blended that with two African coffees - one dry process, one wet processed - that add to and augment bittersweetness with flavors of fruit in the finish. Like our last Workshop, I find that the bittersweetness these three otherwise different tasting coffees share is the thread that ties it all together when taken to a minimum of Full City roast level. Espresso shots have an incredible amount of weight, even in my accidental fast pulls (aka \"gushers!\"). I roasted two 100 gram batches of The Skullet in a Quest M3s. The first was a solid Full City roast level, hitting 1st Crack at 6:30/400F, pulling 3 minutes later with a finishing temperature of 435F. This was my favorite of the two for drinking straight, and showed the most fruit without compromising the immense low toned chocolate flavors. My other roast was pulled at 444F, with about 10 seconds of 2nd crack in the drum. Those extra 9-10 degrees flattened out the fruits quite a bit, and you're left with more two-dimensional bittersweetness. It was also quite delicious, and the better choice of the two for milk drinks.","CuppingNotes":"When considering ingredients for this blend, we knew we wanted to pair a bittersweet Latin American coffee with something from Ethiopia that offered both bittersweetness, and fruit. We're really pleased with the trio we landed on, and those looking for a little more 'umph' in their shots will be too! Full City roast level is an ideal starting point, ensuring bittersweet chocolate flavors that come off in layers. The aftertaste is very long, due in part to the creamy mouthfeel that seems to coat your palate with lasting flavors. Medium-long shots show lots of roast intensity that leads to a chocolate-forward flavor profile of super high % cacao bar that emphasizes the \"bitter\" in \"bittersweetness\". There's a fruited sweetness underneath that comes through a little more in the middle and aftertaste, but never feels like it imposes on the rich chocolatey character to me. Perhaps a shade lighter might show differently (I imagine more acidity at least), but Full City/Full City+ are much more rounded. Notes of stewed plum and stone fruit offer tasty accents to the more opaque cocoa and baking chocolate flavors that dominate the shot. Chocolatey fruit accent notes take shape as of cherry covered dried cherry and pear. I get a little sharpness in my shorter pulls (18g of coffee in to about 18-20g espresso out across 25 to 30 seconds), but less of a citrus tone, and more of the sharpness of extra dark chocolate. Taking this blend into 2nd cracks diminishes much of the fruited hints and builds roast intensity to a bittersweet climax that's sure to cut through milk nicely.","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-17 Screen","Drying Method":"Patio and Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Top Grades","Packaging":"GrainPro Liner","Processing":"Wet Process, and Dry Process coffees","Recommended for Espresso":"Yes","Region":"Ethiopia, Costa Rica, El Salvador","Roast Recommendations":"Full City to Full City+ - I don't recommend a rolling 2nd Crack","Type":"Farm Gate"}}
{"Title":"Ethiopia Dry Process Yirga Cheffe Mengesha Farm","Overview":"Mengesha Farm pushes the \"wow\" factor with this one. Floral blueberry, blackberry kiefer, berry hard candies, chocolate-dipped banana, hints of jasmine and ripe strawberry, with orange acidic impression that helps tie it all together. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-dry-process-yirga-cheffe-mengesha-farm-7368.html","SKU":"GCX-7368","FarmNotes":"While we're calling this coffee \"Mengesha Farm\" singular, using the plural, \"farms\", is a bit more accurate. Yirga Cheffe coffee farmer Tariku Mengesha has a few small coffee farms scattered throughout the kebele of Chelchele, totaling just under 13 hectares between them. When he's not managing the farms with his 10 children, Tariku operates a few other washing stations and processing sites, buying and processing coffee cherry from the hundreds of small holder farmers in the areas he operates. This lot is made up of only his personal farm coffee, and is dry process, meaning the seed is dried inside the whole cherry. This is the oldest processing method, and often leads to fruitier cup flavors, big body, and rounded acidity (certainly can be said for this lot!). The Mengesha farms span an altitude range of 2020 to 2100 meters above sea level, extremely high for any coffee origin! High altitude slows maturation and increases coffee bean density, which correlates to higher probability of sweetness and acidity, and also can affect the size of the beans. You'll find small beans in this lot, the smallest being 14 screen (measured in 1/64 in.). Behmor users might want to give their roast batch a shake in the drum before roasting in order to shake free any of the smallest beans that might fall through the screen grid. ","CuppingNotes":"I'm finding this dry process Mengesha Farm to be potent and floral in a fruity kind of way, with complex blueberry flavors that are highly coveted! Being a natural/dry process, fruits are a big part of the flavor profile, and they have aromatic potency that, say, a really ripe berry gives off. It's the kind of feature that pushes the \"wow\" factor in a dry process coffee like this one! The fragrance and aroma have a scent of dried blueberry, perhaps a bit more like cooked berry reduction at City+, along with pungent sweet smells of molasses, cooked sugars, and fruits that have a winey ripeness, but never over the edge. Even at Full City there's a strong presence of berry fruit aromatics, along with an attractive scent of fine dark chocolate. The cup leads with a sweet blueberry note that connects to a fruit-floral aroma by orange acidic impression. Tart aspects grace the lighter roasts and bring to mind citrus pith and berry skins. The cup profile shows elements of cooked stone fruits, and a creamy banana flavor that at City+ is a bit like chocolate-dipped banana. City roasts yield the most floral cups, with hints of jasmine, ripe strawberry, and more. The cup cools nicely, offering up flavors of mixed berry jam, blackberry Kiefer, and a berry hard candy note that impacts the finishing aroma. There's a hint of rustic cocoa in the long finish too - it's a natural after all - but that's easily overshadowed by another sip!","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 14-17 Screen","Arrival date":"July 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"160","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Region":"Chelchele, Yirga Cheffe","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Ethiopia Gera Ayetu Farm","Overview":"Juicy fruit accents, and delicate aromatics ride high above a moderately sweet brew. Raw brown sugars, dried peach, apricot, bergamot citrus and orange blossom florals. Full City makes impressive espresso too. City to Full City. ","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-gera-ayetu-farm-7298.html","SKU":"GCX-7298","FarmNotes":"Ayetu farm is a privately owned, 250 hectare estate in Jimma, Western Ethiopia. Roughly half of the farm is planted in coffee, while the rest is a dedicated reserve for forest conservation. Ayetu is situated along the road between Gera and Kecho Anderecha, and both wet mill and farm climb an altitude range of 1700 to 2100 meters above sea level. Ayetu produce both wet and dry process coffee, this being the former. They are processing coffee on a water conserving Penagos 2500 demucilager, depulping the coffee into 4 cement tanks where is is fermented overnight to break down the sticky fruit mucilate. The coffee is then washed and graded in long cement channels filled with fresh, clean water, and then laid to dry on raised beds. When we visited a couple years back, they were working with 50 drying beds, which seemed to be ample space during the peak of the harvest. This is Ayetu's 10th year operating under that name, and our first year buying their coffee. The cup has nice fruit flavors for washed coffee, with this distinct floral characteristic that reminded us of orange blossom.","CuppingNotes":"Ayetu Farm has all the markings of a juicy Western Ethiopian coffee. The dry fragrance has a fruited scent of natural dried peach, accented by an herbal rue note that brings a floral-like quality to the profile. The wet aroma has a fruit nectar smell, a distilled sweetness of apricot Kerns juice, interspersed with a more delicate note of jasmine that adds a touch of perfume to the steam. Ayetu features a juxtaposition of juicy fruit accents, and delicate aromatics that ride high above a moderately sweet, bodied brew. The highlight notes are underpinned by dense sweetness of raw brown sugars that open up as the cup temperature cools. The top notes consisted of natural dried peach and apricot adding a sticky sweetness to the brew, while bergamot citrus and orange blossom florals shine a light on Ayetu's more delicate side. This is a fairly mild Ethiopia in terms of acidity, which I think will appeal to those sensitive to the light and bright coffees (especially from the South). I found Full City roasts also make a really nice single origin Ethiopian espresso shot. The moderate acidity level keeps it from being too jarring or grabby. But more than that, the flavor profile of syrupy dark chocolate swirled together with peach-pear juice, and aromatic coconut water, is truly delicious! ","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"June 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"120","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Gera","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Ethiopia Geta Bore SWP Decaf","Overview":"Juicy mouthfeel accentuates otherwise subtle hints of red fruit, dried apricot, and Dr Pepper, with ample dark sugar sweetness up front that leads leads up to a nice sweet finish too. City to Full City. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-geta-bore-swp-decaf-7230.html","SKU":"GCX-7230","FarmNotes":"This custom single origin decaf coffee is from the Geta Bore cooperative in Bore Woreda, not far from Agaro. Like the majority of our decaf coffees, this lot was processed by Swiss Water in Vancouver, BC. Not only do they offer 100% chemical free decaffeination process, but we are able to choose coffees from our own stocks that we love, so we know we will get delicious decafs in return. (Read more about the Swiss Water method, HERE.) Geta Bore falls under a larger umbrella \"Union\" that includes other Western coops we buy from like Duromina, Nano and Genji Challa, Yukiro and more. Being a cooperative, it is member-owned and leadership and decision making are a group-effort on the part of the member base. The Union provides the coops under their umbrella with agronomical and business assistance, and most important.y, marketing and export services to get the coffee into the hands of international buyers. The processing site sits at 2000 meters above sea level, and members farm coffee as high as 2200 meters. ","CuppingNotes":"While the dry grounds don't necessarily read \"Ethiopia\", they have a very attractive sweetness that's refined for decaf, lightly fruited, with a note of cinnamon stick in the lighter roasts. The wet aroma is where I typically get the 'bready' decaf notes, which is still the case here. But they're accompanied by a fragrant sweetness too, rich with dark brown sugars, and hints of fruit crumble, and oatmeal cookie. The brewed coffee has juicy mouthfeel that accentuates otherwise subtle hints of red fruit, dried apricot, and Dr Pepper soda. The profile has ample dark sugar sweetness up front that leads leads up to a nice sweet finish too.  'Decaf' flavor aspects are pretty subtle, and I don't think most folks would peg it as such if they didn't already know. I find the most origin character at the lighter end of the roast range, but also am really enjoying the more bittersweet, and somewhat herbal, cup flavors in my darker Full City roast too.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen - some broken and misshaped beans due to decaffeination","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"39","Packaging":"GrainPro Liner","Processing":"Wet Process, then SWP Decaf","Recommended for Espresso":"Yes","Region":"Agaro Town, Jimma","Roast Recommendations":"City to Full City","Type":"Decaf"}}
{"Title":"Ethiopia Guji Buku Sayisa","Overview":"Atypical flavors for Guji, with a unique mix of herbal, forward facing fruit, and mild florals. Cantaloupe and galia melon, baked peach, miso, orange marmalade, pungent papaya, and jack fruit accent note. City to City+.*Please note the beans are very small (down to 13 screen) and dense, 1st Crack is subtle and hard to hear. See Farm Notes for roasting tips.","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-guji-buku-sayisa-7346.html","SKU":"GCX-7346","FarmNotes":"The first thing you're likely to notice when you receive this coffee is how small the beans are. They're pretty tiny when put up against your average flat bean, which makes them a little tricky to roast. The main thing to keep in mind is that it's best if you can actually see your coffee while you roast it. The 'crack' isn't all that audible, if heard at all, but fracturing is easy to spot. If you are roasting in a Behmor, my advice is to listen and watch carefully, track your roast time, try pulling a little earlier than you might normally cool a batch and adjust from there. You shouldn't have an issue on roasters where you have a good visual of the bean as long as you're comfortable roasting by sight rather than sound. This coffee is from a private washing station in Buku village, Hambela Wamena district of Guji Zone. Farmers sell their coffee to the station in whole cherry where it is processed using both the wet process/fermentation method as well as dry process, where the coffee is dried in whole cherry. This is a fully natural processed coffee, dried in whole cherry on raised beds for upwards of 30 days. If you're not versed in the cup this processing technic tends to produce, you can expect a fruit forward cup, bigger body and low acid for the most part. In the case of this particular lot, you'll also likely sense floral and berry aromatics when roasted light. Farms are as high as 2300 meters, and the cold high altitudinal climate leads to slower maturation, and small, dense coffee beans. They produce a lot of very small-sized coffee beans, and we offered a 13-screen separation a few years back (measured in 1/64ths of an inch). ","CuppingNotes":"Buku Sayisa is atypical Guji coffee in more ways than one. The coffee is grown at 2300 meters above sea level, and beans very small and dense (see photo). In our experience with this coffee, the high density has translated to an almost inaudible 1st Crack, and small size means you might lose a few to grid drum roasters like the Behmor. It can be tricky to roast for sure, but well worth the challenge! (see Farm Notes for some roasting guidance). The aromatics are also infused with an unlikely mix of herbals, fruits, and unique savory notes. The dry fragrance shows fruited sweetness, with a tropical guava note, herbal honey, and an interesting savory note of fermented miso in the background. Floral aromatics wind through the steam of the hot cup, with potent accents of cooked stone fruits, and melon. The latter really came through in our City roasts, pungent melon flavors like cantaloupe and gala, with orange marmalade, and some orange peel bittering. The fruits are forward facing for a washed coffee, and honestly, it comes off a bit like a cleaner dry process Ethiopia. The cup has an interesting aroma, slightly floral, herbal, and a return to the savory/miso-like aspects sensed in the dry fragrance. Acidity is rather soft too, like a natural, nothing grabby about it at all, and finishing with sweet, and earthy fruit notes in the aftertaste like pungent papaya, baked peach, and a hint of jack fruit. This coffee deserves to be roasted within a rather tight range of City to City+ in order to tease out the acidity needed to structure the complex array of flavors.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 13-15 screen","Arrival date":"July 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"50","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Buku Village, Hambela Wamena, Guji Zone","Roast Recommendations":"City to City+ - the cracks are hardly audible, and best if you can watch for physical fracturing","Type":"Farm Gate"}}
{"Title":"Ethiopia Organic Agaro Duromina","Overview":"Always such a bodied cup, Duromina's flavors convey amber honey sweetness, tangy citrus at the sides of your tongue, red apple, orange marmalade, peach, stone fruit skins, and a complex rue herbal hint. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-organic-agaro-duromina-7291.html","SKU":"GCX-7291","FarmNotes":"We have been involved with Duromina for several years now, selecting our favorite lots from the separations they put together starting early in the season. Duromina was formed with the help of a non-government organization that not only coordinated agronomists and managers for each of the coops they work with, but also had a business adviser assigned that helped the cooperative manage their debt, re-invest in quality improvements at the mill, and verifies distribution of income to all members. This is a key position; I have never known a coop to get this kind of expert advice from outside ... not in Africa at least. A cooperative can make all kinds of quality improvements, turn out fantastic coffee, and sink deeper in debt all the while. Cooperatives often fail to return a fair and full amount of payment to their farmer-members. Often this is from poor management, and sometimes from graft as well. Duromina \"graduated\" from the NGO program a few years bvack and operates independently with the oversight of a farmer-member leadership group. Duromina is in the Goma region of Agaro Woreda, with farm altitudes between 1900 to 2100 meters. The name, chosen by the farmers, has quite a straight-forward meaning: it roughly translates as \"Make More Money!\" With the solid price Duromina receives for their coffee, and their success reinvesting in the Goma area, the name has proved quite appropriate. NPR did an interesting audio piece on this coop a few years back: Cinderella Story.","CuppingNotes":"The dry fragrance is front-loaded with a sweetness of darker toned honey, with a brown sugar accent adding depth, along with peach/stone fruits, and a whiff of orange. Adding the hot water brings up a scent of dark honey, and the wetted crust is saturated with simple brown sugars, fruits more of a background attribute at this stage. The cup flavors echo the aromatics in multi-layered fruit tones, with subtle floral hints, and not-so-subtle underlying sweetness. City roasts make for the brightest cups, the tangy orange citrus felt at the sides of your tongue see sweet relief from dense raw honey sweetness. Fruited flavors accent the base sweetness as the coffee cools, and my list included fresh red apple, orange marmalade, peach, and pleasantly bittering aspect of stone fruit skins in the aftertaste. A floral aroma is most prominent in light roasts and shows elements of floral peach, and also a rue herbal hint. Body is boosted with darker roasting, but Duromina showed tactile appeal at every roast level we tasted. City+ roasting brings out a somewhat subtle chocolate tone, and fruited flavors thankfully are not compromised, pointing to natural dried date and apricot. The acidity level is moderate in comparison to some of the Yirga Cheffe's we've carried, but structuring none the less. I experimented with taking a roast into 2nd Crack, but thought the flavors fell flat, with roast bittering overpowering the cup. City/City+ is where I think Duromina brews best, and Full City being the darkest roasts where you can still expect some of that fruited sweetness to shine through. ","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"June 2022 Arrival","Bag size":"60 KG","Certifications":"","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"80","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Goma, Agaro","Roast Recommendations":"City to Full City","Type":"Farm Gate, Organic/Fair Trade Cert."}}
{"Title":"Ethiopia Organic Dry Process Birbirsa Coop","Overview":"Articulate sweetness and acidity, with a bounty of fruit notes like boysenberry, peach flavored syrup, fruit cobbler, and a tangerine note that fades to chocolate bittersweet and cocoa nib aftertaste. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-organic-dry-process-birbirsa-coop-7292.html","SKU":"GCX-7292","FarmNotes":"The Birbirsa coffee cooperative is located in Beshasha Badiya, Jimma, not far from a few other coops we buy from. It's on the smaller size in comparison, both in terms of physical and membership numbers, with 80 local farmers making up its base. Beshasha town has very good altitude, registering at just under 2100 meters above sea level. It is conveniently situated along the side of one of the main dirt road that runs through town, affording good access for moving coffee on and off the site. As a matter of fact, we made an unplanned visit to Birbirsa in 2019 on our way to another coop. The colorful sign, and colorfully dressed manager Mohammed, drew us in like a beacon on the side of the dusty road (that's Mohammed in the beautiful green shirt and tie in front of Birbirsa sign). During our tour of the site, we saw that the cherry selection looked great, and have hoped for an opportunity to buy their coffee ever since. It took a few years, but we finally were able to facilitate samples this harvest, and based on what we saw on our visit, were not surprised by the high quality they sent. They only produce dry process at the moment, which is fine by us. They focus on doing one thing, and they do it very well!","CuppingNotes":"Most of our dry process coffees come from southern regions like Yirga Cheffe, so we are particularly pleased to have this amazing coffee from Western Jimma on offer. The dry fragrance was fruited at all the roast levels we tested, even in a dark Full City (not quite 2nd cracks). Our City and City+ roasts brought out smells of boysenberry, pineapple, orange-infused chocolate, and a super sweet honey smell in the dry grounds. Aroma shows a bounty of fragrant fruits, darker stone fruits like plum, cooked peach, and some dried mango and papaya. Lighter roasts brew a bright fruited cup, with peach tones similar to some other Western Ethiopian coffees on our menu, but with a bit more pulpy/fruit nectar aspects behind it that add to a syrupy mouthfeel. For dry process, Birbirsa is quite clean with regards to sweetness and acidity, and the cooling cup yields a long list of flavor notes like boysenberry, peach flavored syrup (Torani type), stone fruit cobbler, cooked sugars, and a Tangerine note up front that fades to rindy citrus peel and cocoa nib bittering in the aftertaste. Full City roasts round off the vibrance a bit, and you're left with a cup profile of bittersweet chocolates, and blueberry note that leaves a lasting impression on the finish.","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-17 Screen","Arrival date":"June 2022 Arrival","Bag size":"60 KG","Certifications":"","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"110","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Region":"Beshasha Badiya, Jimma","Roast Recommendations":"City to Full City","Type":"Farm Gate, Organic/Fair Trade Cert."}}
{"Title":"Ethiopia Organic Gera Nano Challa","Overview":"White honey sweetness opens up to fruited notes of fresh nectarine, apricot, peach, lively orange, golden raisin, and acidity that is permeated by citrus-y hints, as well as aromatics of tenadam and lemongrass. City to Full City. Good for espresso too!","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-organic-gera-nano-challa-7290.html","SKU":"GCX-7290","FarmNotes":"The name \"Nano Challa\" refers to a local mythic tale about a challenge to become King of Jimma, and the coop adopted it to signify their desire to be a strong cooperative. Indeed, many coops in the West of Ethiopia have struggled to find good buyers who will pay enough for the coffee, to manage their own debts, and from internal struggles and graft. Nano Challa was formed as part of an initiative to aid farmers in a more comprehensive way, starting cooperatives that could be governed by the farmers, rather than selling their coffee to privately run mills, and 'middle men'. The program was administered by a non-government organization that not only coordinates agronomists and managers for each of the coops they work with, but also has a business adviser assigned that helps the cooperative manage their debt, re-invest in quality improvements at the mill, and verifies distribution of income to all members. They've since graduated from this program, and are now part of an independent, local Union called Kata Muduga, who assist the cooperatives with functions like marketing, exporting, and general representation on an international scale. Nano Challa is a smaller cooperative coffee mill near Gera town in the Jimma region, Western Ethiopia. (The area also has some of the finest honey available in Ethiopia). This is from a collection site 2km from the original Nano Challa station called \"Genji Challa\". Being so close, they extend their farmer reach some, but also buy from many of the same coop members (deliveries can be made to either). The farms are at altitudes between 1900 to 2100 meters, planted in old regional varieties of coffee.","CuppingNotes":"The dry fragrance has potent honey floral note, with spiced tea, ginger snap cookie, and sweet citrus. The wet aroma comes off even stronger, with perfumed smells of white honey, and highlights of stone fruits, orange rind, and a mix of floral and herbal accents. The underlying sweetness in the brewed coffee has flavor aspects of white honey, and along with stone fruit accent notes, adds a floral aromatic impression in the nose. The compact sweetness opens up to fruited flavors, and acidity that is permeated by citrus-y, orange notes. There's a fresh nectarine flavor note that impacts aroma, and offers lingering fruited sweetness in the aftertaste. It's a delicious brew at City and City+ roast levels, and in my opinion, the juicy flavor profile offers a nice contrast to the crisp, floral coffees found in many of Ethiopia's southern regions. Nano Challa cools to a mix of flavor notes lie apricot and peach, lively orange juice, golden raisin, and with floral/herbal accents like tenadam and lemon grass. I pick up on a mouth pleasing tea-tannic bittering quality in the finish as well. Full City roasting cultivates a rich bittersweetness that is enmeshed with a lovely dark plum accent. Nano Challa has made for a knockout Ethiopian espresso in previous years, and I have no doubt in my mind that this year's lot lives up to those expectations.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"June 2022 Arrival","Bag size":"60 KG","Certifications":"","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"80","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Gera, Jimma","Roast Recommendations":"City to Full City","Type":"Farm Gate, Organic/Fair Trade Cert."}}
{"Title":"Ethiopia Yirga Cheffe Chelbesa Danche","Overview":"A standout Yirga Cheffe! Clean, floral, and bright, with pristine sweetness that's marked by juicy notes of citrus and peach fruits, and complex aroma of jasmine, freesia, fresh rue and coriander. City to City+.","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-yirga-cheffe-chelbesa-danche-7349.html","SKU":"GCX-7349","FarmNotes":"Danche is the name of the small hamlet within Chelbesa town where this wet mill and coffee are from, in District Gedeb. This is one of the largest coffee producing areas in Gedeb, boasting semi-forested shade canopy in many parts, and altitudes ranging from 1900 to a staggering 2200 meters above sea level. The washing station Chelbesa is relatively new, having only been built back in 2019. It is part of a group of stations run by SNAP Specialty Coffee, Chelbesa being one of their most recent ventures. The wet mill is outfitted with ceramic fermentation tanks, which are supposed to retain heat  speeding up fermentation to some degree, and easier to clean than cement being a less porous material. They currently buy coffee from nearly 500 farmers in Chelbesa village. This fully washed, wet process coffee from Chelbesa exudes the clean floral characteristics we often think of as synonymous with the Yirga Cheffe region! The cup sweetness is refined and delicious, and the cup aroma when roasted light is heady and complex. I'll also note that the site is certified organic, though this lot was not purchased with certification. ","CuppingNotes":"This lot from the Chelbesa Danche absolutely scream \"Yirga Cheffe\" coffee, with clean, floral cup character, and well articulated sweetness and acidity! The dry fragrance shows perfumed floral notes, like rose, an aromatic hint of rue herb, and the sweetness has aspects of raw sugars. I was struck by some of the tropical fruit notes at City roast as well, hints of pineapple, and passion fruit. I picked up on a tropical papaya note in the wet aroma, with smells of dried stone fruit, honey, and elegant jasmine note that really draw you in. The cup at City roast level does not disappoint! Chelbesa Danche makes for an incredibly aromatic cup when roasted light, with depth of sweetness that act as a connecting point for some of the more elegant, outlier top notes. The coffee cools to flavors of orange spiced tea, and complex rue herbal accents play off the floral aromatics of jasmine, freesia, and fresh coriander. Our light roast boasted a modest level of acidity that brought to mind orange, and other sweet citrus, greatly influenced by the citrus flavor accents. Roasting super light can sometimes lead to stunted sweetness, but that wasn't the case with ours. Chelbesa's cup sweetness covers quite a bit of ground, and lasting in the finish too. It starts off transparent, like simple syrup, but then branches out to raw sugars, and fragrant honey  in the aftertaste.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 14-17 Screen - there are some small 14 screen beans in the mix, but far from the majority","Arrival date":"July 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"99","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Danche, Chelbesa Village, Gedeb Woreda","Roast Recommendations":"City to City+","Type":"Farm Gate"}}
{"Title":"Ethiopia Yukiro Cooperative","Overview":"Super clean, bright cup, sure to be the star of the show in any setting, sweetness of honey, fresh apricot, peachy florals, jamaica tea, orange juice, lime aroma, and citrus acidic impressions provide a sturdy backbone. City to City+.","Score":0,"URL":"https://www.sweetmarias.com/ethiopia-yukiro-cooperative-7296.html","SKU":"GCX-7296","FarmNotes":"Yukiro Cooperative was once part of an initiative in Ethiopia focused on working directly at the coop level. Administered by a non-government organization, they helped the cooperative with coordinating agronomists, managers, and with business advisors to helps the cooperative manage their debt, re-invest in quality improvements at the mill, and verifies distribution of income to all members. This is a key position; I have never known a coop to get this kind of expert advice from outside ... not in Africa at least. A cooperative can make all kinds of quality improvements, turn out fantastic coffee, and sink deeper in debt all the while. Cooperatives often fail to return a fair and full amount of payment to their farmer-members. Often this is from poor management, and sometimes from graft as well. The ultimate goal of the program is to get the cooperatives they work with to the point of self sustainability, which Yukiro has achieved. Because of this work and the resulting transparency of the organization, we can verify that the price we paid will result in a fair distribution of funds, a better managed coop, investment in the mill, and even better coffee next year. The farms are in Goma Woreda, with altitudes between 1900 to 2100 meters. Yukiro currently has close to 600 members (1/3 female, 2/3 male members), and have improved their beds and warehouse capacity in the last year, as well as installed a new Penagos 2500 coffee pulper.","CuppingNotes":"Light roasts of Yukiro boast delicate tea-like accents and soft fruited notes, a citrus aromatic impression bolstering the latter. City roasts are where the most clarity in cup flavors are achieved, yielding a cup nothing short of competition level quality. The fragrance and aroma smell of brown sugars, peach, and orange soda. The aroma has a fruit pastry smell to it, like pineapple upside down cake, with sweet citrus, and some floral fruit behind it that brought to mind ripe peach. As pour over brew, City roasts extract rock solid base sweetness of honey and fruits, highlighted by citrus accent notes like lime and pink grapefruit that gives the profile a sturdy backbone. The coffee flavors are clean and refined, and not compromised by typical bittering coffee tones. The sweetness is substantial in the cup without drawing your attention away from fruited notes that follow. Our City and City+ roasts delivered distinct stone fruit notes like fresh apricot and peach that had a lovely floral quality to them, with accents of jamaica tea, orange juice, and a nice bright acidity, underscored by juicy lime that invigorates the aroma too. Yukiro shows best when roasted light, and makes for a clean, bright cup, that's sure to be the star of the show in any setting.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"June 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Heirloom Cultivars","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"50","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Goma, Oromia Region","Roast Recommendations":"City to City+","Type":"Farm Gate"}}
{"Title":"Flores Gunung Waja Mala","Overview":"Waja Mala has flavors of bran muffin with cinnamon, with notes of turbinado sugar, walnut, a subtle earth tone, the bittersweetness of flourless chocolate torte, and modest level of acidity. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/flores-gunung-waja-mala-7282.html","SKU":"GCX-7282","FarmNotes":"This coffee called \"Waja Mala\" is from the Kagho Masa coffee farmer's cooperative in Duka Village. \"Gunung\" translates roughly to \"peak\" or \"hill\", which in the case of Waja Mala, is one of the higher elevations in this volcanic region. The cooperative is run by Marselina Walu, whose role as coffee farmer and licensed Q-grader has made her into a community leader. Much of the kinship groups in these areas are matrilineal, with land being passed through women. But women still face difficulty being put in roles of leadership, something that Marselina has set out to change in her community, evidenced by her placing women in all roles of leadership at the cooperative, also making up a majority of cooperative membership. Most of the coffees are processed on hand cranked or motorized depulping machines on the farm, fermentation in buckets or small tanks, and then drying on raised drying beds. Because of the nutrient rich soils, they are able to grow coffee using fully organic farm practices, though they are not certified at this time.","CuppingNotes":"At City+ roast level, the dry fragrance has burt sugar sweetness, a scent of baked goods like bran muffin with cinnamon. Pouring the hot water brings out a dried peach accent along with a bittersweet side, still with the dark sweetness too, but also some bittering chocolate in my darker Full City roast on the break. Waja Mala brews well at a wide range of roasts too. City+ roasts bring out raw sugar sweetness that has a flavor of turbinado sugar, and flanked by a walnut note that adds both a sweet nut tone and slight bittering walnut skin mouthfeel. We found Waja Mala yielded a bit more acidity than some of the other Flores coffees, and had a nice, mouthcleansing aftertaste. Deeper roasts bring bittersweetness to a climax, and I would bet Waja Mala's sweetness will withstand 2nd snaps too. For me, Full City is a nice stopping point and makes a real \"crowd pleasing\" cup, bittersweet flavors of flourless chocolate torte, and a subtle earth tone in aroma. ","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Timor Hybrid, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"18","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Waja Mala","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Flores Wolo Wio","Overview":"Middle roasts have no trouble finding a balance of sweetness and low tones, hints of bran muffin, cacao nibs, rustic tobacco, and pleasantly mild acidity. A super versatile coffee! City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/flores-wolo-wio-7283.html","SKU":"GCX-7283","FarmNotes":"Wolo Wio is a blend of coffees from five neighboring towns in the Ngada District of Flores. The name basically means \"peak\" or \"hill\", which we're using becase the five towns - Wolo Wio, Tubu Tana, Watu Ata, Leko Pake, and Wawo Wae - represent some of the higher elevations in this volcanic region (near Wawo Muda, the active volcano and span a range of 1300 to 1550 meters above sea level). They're part of a coordinated effort to unite coffee growers from neighboring villages in a coffee farmers cooperative called Primavera, whom we've been introduced to through an intermediary working in the region. Primavera operates out of Kampung Wolo Wio (\"Kampung\" means village more or less), run by a local, Om Leo Suri. Most of the coffees are processed on hand cranked or motorized depulping machines on the farm, fermentation in buckets or small tanks, and then drying on raised drying beds. Because of the nutrient rich soils, they are able to grow coffee using fully organic farm practices, though they are not certified at this time.","CuppingNotes":"Wolo Wio has big body and weighty mouthfeel when brewed, sweet and bittering tones balanced, with mild acidity when roasted to City+. The aroma weaves together sorghum syrup, rustic tobacco, banana, cocoa, and honey wheat bread. The cup has a nice dark bittersweetness that leads into roasted almond, baked sugar and cocoa bittering. City+ is a good starting point for roast level and you'll have no trouble finding a balancing sweet undercurrent of unrefined sugars in the City+ to Full City roasts that offset roasty bass notes well. Cup flavors range from bran muffin, cacao nibs, and more of the tobacco-like, rustic qualities found in the smells. The acidity level is pleasantly mild, which honestly suits the more basic, crowd-pleasing cup profile. Wolo Wio is a very versatile coffee in terms of roast degree and brewing style, and makes a bittersweet single origin espresso option at Full City roast level and beyond.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"February 2021 Arrival","Bag size":"60 KG","Cultivar Detail":"Linie-S795","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"38","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Kampung Wolo Wio, Ngada District","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Green Coffee Decaf Sample Set- 4 Pounds","Overview":"4 pre-selected decaffeinated coffees from several different growing regions. An economical way for a beginner to start roasting or find some new favorites. We choose the coffees. Four 1lb bags of four different decaf coffees.*Please note that we can't make substitutions or take special requests for our samplers. Thank you!","Score":0,"URL":"https://www.sweetmarias.com/green-coffee-decaf-sample-set-4-pounds-1.html","SKU":"GCX-SPDC-004","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{"Type":"Decaf, Sample Sets"}}
{"Title":"Green Coffee Sample Set- Espresso","Overview":"The Espresso Sampler includes pre-selected Sweet Maria's Blends and single origin coffees that are good as espresso. Starting off with a sample set is an economical way to start roasting and become familiar with origin flavor characteristics. Some of the single origin coffees and blends will not be available to order from our main coffee list since they are coffees that are going out of stock or are for sample sets only. You will receive 4 or 8 different 1 lb bags of green coffee.","Score":0,"URL":"https://www.sweetmarias.com/green-coffee-sample-set-espresso.html","SKU":"GCX-SPEX","FarmNotes":"","CuppingNotes":"Our sample sets offer broad selection and big savings, perfect for those new to home coffee roasting and seasoned veterans alike! Starting off with a sample set is an economical way to try coffees from around the world, and explore different flavors with just 1 click. No need to do all the research either, we do that for you, grouping together coffees that are relatively easy to roast from distinct growing regions. Our fresh selection of coffees changes frequently with the harvest seasons, so there is no guarantee that you will receive the same coffees twice (coffee is produce, afterall). While most of the coffees have been available on our site at one time or another, you won't always be able to buy them separately from the sample sets.Both size options consist of individual 1 lb. bags of 4 or 8 different coffees. Our 4 lb. espresso set consists of mostly espresso blends, with the occasional single origin coffee that we think shines as espresso. Our 8 lb. sampler is made up of both espresso blends, and single origin espresso options.Did you know we offer a Green Coffee subscription service? It's true! You can opt to have either 4 or 8 pound preselected sets of green coffee shipped to your door in bi-weekly and monthly intervals. There are no hidden obligations so you can start when you want, and end any time. Sign up today!","Images":null,"AdditionalAttributes":{"Type":"Sample Sets"}}
{"Title":"Green Coffee Sample Set- Regular","Overview":"Pre-selected coffees from some of the different growing regions we offer. Starting off with a sample set is an economical way to start roasting and become familiar with origin flavor characteristics. These coffees will not typically be available to order from the our main coffee list since they are coffees that are going out of stock or are for sample sets only. You will receive either 4 or 8 different 1 lb bags of green coffee..","Score":0,"URL":"https://www.sweetmarias.com/green-coffee-sample-set-regular.html","SKU":"GCX-SPRG","FarmNotes":"","CuppingNotes":"Our sample sets offer broad selection and big savings, perfect for those new to home coffee roasting and seasoned veterans alike! Starting off with a sample set is an economical way to try coffees from around the world, and explore different flavors with just 1 click. No need to do all the research either, we do that for you, grouping together coffees that are relatively easy to roast from distinct growing regions. Our fresh selection of coffees changes frequently with the harvest seasons, so there is no guarantee that you will receive the same coffees twice (coffee is produce, after all). While most of the coffees have been available on our site at one time or another, you won't always be able to buy them separately from the sample sets.Both size options consist of individual 1 lb. bags of four or eight different coffees.Did you know we offer a Green Coffee subscription service? It's true! You can opt to have either four or eight pound preselected sets of green coffee shipped to your door in bi-weekly and monthly intervals. There are no hidden obligations so you can start when you want, and end any time. Sign up today!","Images":null,"AdditionalAttributes":{"Type":"Sample Sets"}}
{"Title":"Green Coffee Subscription","Overview":"Auto-shipped, pre-selected coffees from some of the different growing regions we offer. These coffees will not typically be available to order from the our main coffee list since they are coffees that are going out of stock or are for sample sets only. No special requests are accepted. You will receive either 4 or 8 different 1 lb bags of green coffee shipped once a month or every 2 months, your choice! Shipping is not included in the price. Orders will ship via the shipping method chosen at checkout.","Score":0,"URL":"https://www.sweetmarias.com/green-coffee-subscription.html","SKU":"GCX-SPRG-SUB","FarmNotes":"","CuppingNotes":"By signing up, you agree to be billed based on the frequency selected.  Your subscription will automatically create a new order according to the chosen delivery schedule. Cancellations or pauses must be made before your payment is processed. To pause or cancel your subscription login to your account and view My Subscriptions. Please be sure to email us at [email protected] to confirm any changes. To update your payment method, please cancel your current subscription and re-order with the updated payment method. Email us to update your address or billing cycle. ","Images":null,"AdditionalAttributes":{"Type":"Sample Sets"}}
{"Title":"Guatemala San Martin Jilotepeque","Overview":"Crowd-pleasing and balanced, sturdy brown sugar sweetness, chocolate bittersweets, pistachio ice cream, caramelized sugar, and a hint of apple adds to mild perceived acidity. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/guatemala-chimaltenango-jilotepeque-7251.html","SKU":"GCX-7251","FarmNotes":"This lot is made up from the coffee of several small holders in and around the town of San Martin Jilotepeque, about 2 hours south of Antigua, in Guatemala's Chimaltenango Municipality. The group of farmers who are part of this buying project are banded together around Chepe Garcia, a local farmer himself, who's taken the job of organizing and collecting coffee cherry to be sold. Unlike some of the other Guatemala buying projects we are a part of, this one differs in that the coffee is sold by Chepe in whole cherry, not parchment. So instead of each individual lot being processed by the farmer, they are all mixed together each week and delivered to a coffee mill in nearby Antigua where it's processed. Starting with whole cherry, the mill has an added layer of control over isolating the coffee by grade, making sure that only ripe cherry makes it into the top grades. They remove the over-ripe and uder-ripe coffee using methods like floatation before the coffee is depulped, and then long washing channels after fermentation. San Martin Jilotepeque town is at about 1800 meters and Chepe's farm that we visited, Finca Magnolia, tops out at just over 1900 meters.","CuppingNotes":"This coffee from San Martin Jilotepeque is a simple, but delicious daily drinker type coffee, bittersweet and balanced in middle-to-dark roasts, with subtle top notes impacting the cup. The aroma at City+ has a smell of sweet smell of maple syrup along with a nice fruited hint that's a bit like pineapple upside down cake aspect, and Ibarra type drinking cocoa. The flavors in the brewed coffee are sturdy, bittersweet and dense, a tightly-packed weft of brown sugar, and balanced bittersweetness. I pick up on flavors of pistachio ice cream, chocolate sauce, and a very mild apple hint in the lightest roasts that adds to a mild acidic impression. Full City+ roasts are intense with bittering cacao flavors that are rivaled by caramelized sugar sweetness, and highly recommended for milk drinks or as espresso. San Martin Jilotepeque is an incredibly versatile coffee in that way, with a lot to offer at a variety of roast levels and will show well under any brew method.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 16-18 Screen","Arrival date":"June 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Bourboncito, Caturra, Catuai, Typica, Catimor, Anacafe 14","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB","Lot size":"92","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"San Martin Jilotepeque, Chimaltenango","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Guatemala Xinabajul Flavio Del Cerro","Overview":"Brews incredibly well at a wide roast range, mouthwatering sweetness of unrefined sugar and fruited accents, bittersweet intensity, tart apple, cocoa nibs, berry finishing note, and bracing malic acidity. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/guatemala-xinabajul-flavio-del-cerro-7315.html","SKU":"GCX-7315","FarmNotes":"The micro region of Peña Blanca is located in the sub-municipality of La Libertad, Huehuetenango. Each year we make several visits to the area in order to visit as many of these farmers as possible and cup hundreds of samples with the hopes of expanding our \"Proyecto Xinabajul\" project that we've had going in the region for nearly a decade. This particular lot is made up of coffee from the farm of Flavio Martinez, as well as coffees he's collected from his neighbors. We've bought Flavio's coffee for several years now, and he consistently presents us with some of our top lots. As is often the case, Flavio is not the only one in his area doing an exceptional job. With his help, we are able to buy from others in his town too. Flavio's farm is located in Peña Blanca, near the newly erected Punta del Cerro mill where this coffee was milled. The coffee is a mix of Bourbon, Catuai, Caturra and Typica and is grown between 1700 and 1800 meters above sea level.","CuppingNotes":"While unrefined sugars and bittersweetness are the bolded print here, fruited characteristics are apparent in this coffee too. This was especially the case when cup testing this lot next to a few of our more basic, crowd-pleasing Guatemalas where flavor contrast was pretty stark. The smells touch on clean raw sugars, as well as an accent of red fruit punch. The aroma lets off a wonderful berry note when adding the hot water, while something like turbinado raw sugar winds its way through the steam. This coffee brews incredibly well at a wide range of roasts and offers mouthwatering sweetness of unrefined sugar and fruited accents across the roast spectrum. Lighter roasts have tart apple accents, accompanied by bittersweet intensity that hints at cocoa nibs. The coffee cools to some piquant berry and fruit skins, and shows bracing acidity that is very malic (apple/pear). At Full City we get sturdy chocolate flavors and roast tone, that with a plump berry note, come off like dark chocolate-blueberry truffle. As espresso, Full City roasts have a velvety mouthfeel, dried fruited accent notes, and bittersweet chocolate that hangs on long into the finish.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"July 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Caturra, Catuai Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB EP","Lot size":"25","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Peña Blanca, Huehuetenango","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Guatemala Xinabajul Peña Blanca","Overview":"Juicy mouthfeel helps tease out a hint of Gala apple, while balanced bittersweetness takes the form of dark cacao bar with a ribbon of caramel. Pear acidity in the lighter roasts, big body at all roast levels. City to Full City. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/guatemala-xinabajul-pena-blanca-7316.html","SKU":"GCX-7316","FarmNotes":"The small village of Peña Blanca is located in the sub-municipality of La Libertad, Huehuetenango. This coffee comes to us through a joint-effort of a local micro-mill owner who is able to process and separate the micro-lots we approve, and a highly sophisticated dry-mill who handle the finishing touches and export the coffees for us. It helps us greatly to enlist local support, folks who not only know the land but also the local farmers. We put in quite a bit of work ourselves, tasting many rounds of samples in order to identify the premium-level coffees, as well as make several trips to the area each year meeting with farmers and collecting information. This coffee represents the harvest of about a dozen differnt producers from the community, equaling 26 x 69 kg bags in total. This is part of our \"Proyecto Xinabajul\" in Huehuetenango, which you can read an in-depth and detailed description of the HERE.","CuppingNotes":"The dry fragrance has a sweet overlay of caramel crumble at City+, subtle bittering undertones, and a roasted almond accent. The wet grounds have a rich bittersweetness at Full City, layered roast tones released on the break, and strong waft of cacao nib in the steam. At City+, the brewed coffee has a nice juicy mouthfeel, weighty like apple juice. An apple-y fruit flavor is a surprise in the lighter roasts too, not something I sensed in smells at all. Tom wrote \"Gala apple\", and I (Dan) noted a red apple note in the brew as well. Peña Blanca has clean, crisp acidity too, characteristic of high grown coffee, and also indicates the structure of fresh apple and pear. Getting into darker, Full City roasts, the cup is rich with low tones, showing balanced bittersweetness that tastes like dark cacao bar with a ribbon of caramel. Caramelized sugar and silky chocolate flavors hang around long in the aftertaste, accompanied by a slight tannic/bittering aspect you find in fruit skins. Fresh Huehuetenango coffees are always such stellar single origin espressos, and Peña Blanca is one a shining star in this regard. Full City shots have a silky-smooth texture that gives life to the creamy caramel and syrupy dark chocolate flavors that are extracted, along with some tangy, bittering orange peel flavor that brings some acidity to the profile.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 16-18 Screen","Arrival date":"July 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Caturra, Catuaí, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHG EP","Lot size":"89","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Peña Blanca, La Libertad, Huehuetenango","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Guatemala Xinabajul Producers","Overview":"Moderate sweetness and acidity, base flavors of minimally refined sugars and honey-roasted nut, dried fruit hints, chocolate-covered almond, a berry granola note, and lasting bittersweetness. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/guatemala-xinabajul-producers-7318.html","SKU":"GCX-7318","FarmNotes":"Our one and only Xinabajul Producers blend this year is 40 bags in total, so pick some up while you can as we don't expect it will last very long. Xinabajul is the name of the original Huehuetenango town, and this coffee comes from small-holder farmers in the greater department of Huehue. Specifically, this small lot is a blend of coffees from six small producers in the growing areas of Santa Barbara, Cuilco, La Libertad and San Pedro Necta. In the past, small coffee producers in this area had few options when selling their coffee locally; they could take it to the large mills down at lower elevations and get paid the going rate, or they could sell it to \"coyotes\" who drive the dirt roads in their trucks paying cash for coffee. Neither offered any extra price for quality, even though the coffees were grown higher and tended with greater care than the big farms down at lower elevations. We partnered with local coffee people to offer higher prices if the farmers could meet our quality expectations in the cup, and this lot is testament to that success. Given that the localities where we are buying coffee are little more than extended family groups, we have found if we involve a brother or sister, they will tell all their coffee-farming kin and soon we have a network of farmers interested in our project. We wrote an in-depth and detailed description of the project as well.","CuppingNotes":"The cups are sweet-to-bittersweet depending on roast level, exhibiting mild top notes and acidity when roasted light, and chunky chocolate bittersweets once you pass Full City. Toasted almonds and light brown sugar outline the fragrance from the dry ground coffee. Hot water brings up a concoction of chocolate-dipped almond, and brings bittersweetness like toasted sugar to the table as well. Sweetness builds in intensity as the coffee cools, with a moderate level of acidity shadowing the cup that has soft aspects of brewed black tea with lemon. Flavor components of minimally refined sugars, along with honey roasted nut, lay out a nice base coffee flavor, along with a hint of berry granola. Softer chocolate roast tones play a background role at City+, and are much more prominent at Full City. Dark roasting brings out pungent dark cocoa and burnt sugar roast tones, an overall pleasant interplay of bittering and sweet flavors that will pair well with cream if that suits you! Full City and Full City+ roasts work well as espresso shots, pushing syrupy dark chocolate flavors to the front, and creamy nut tones and long lasting bittersweetness into the aftertaste.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"July 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Caturra, Catuai, Typica","Drying Method":"Patio and Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"SHB EP","Lot size":"36","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Huehuetenango","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Honduras Comayagua Donato Java","Overview":"City+ ensures a well developed sweetness, and balanced cup flavors, with complex herbal accents of ricola, bell pepper, and the woody tang of steeped lemon grass. City+ to Full City.","Score":0,"URL":"https://www.sweetmarias.com/honduras-comayagua-donato-java-7307.html","SKU":"GCX-7307","FarmNotes":"This small small coffee lot is from farmer Donato Ponce, who's farm \"La Cooperativa\" is located in Lomas del Cordero, Comayagua Department. His land is 7 hectares, though only about 3 are devoted to coffee. The rest of Donato's property is preserved as natural forest. La Cooperativa sits at around 1200 meters above sea level, and is planted in a mix of varietes, including Lempira, Obata, and of course, Java, which this lot is. Only a small part of the farm is devoted to this unique cultivar, and I believe these 6 bags represent his entire Java harvest (which makes up about 25% of his total output). This area was deeply affected by a leaf rust epidemic in 2011, many farmers losing entire crops and having to completely start over. Because of this, you see a lot of local Catimor types, displaying high resistance to the devastating coffee plant disease \"roya\", or leaf rust. We found our best roasting results in the City+ to Full City roast range, where a balance between sweet and bittering tones is struck, with herbaceaus aroma, and moderate level of acidity.","CuppingNotes":"The Java cultivar made its way to Central America by way Cameroon, though it originally was transported there from the Javanese islands. While its origins before that are somewhat contested, the elongated 'canoe' shaped beans, and aromatic flavor profile, find similarities with heirloom types from Ethiopia. While this lot is no facsimile of an Ethiopian cup on our list, it does share some of the aromatic subtleties. It produces alluring sweetness in smells, with elements of honey on toast, butter and brown sugar, and cookie dough batter. The flavors offer a complex herbal sweetness that hints at ricola drops, bell pepper, and the woody tang of steeped lemon grass. Roasting to City+ ensures a well developed sweetness, which I think is important here in that it helps to balance out the cup. I get some dryness in the finish, but I find that the orangey acidity in the light-to-middle range tempers that quite a bit.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-18 Screen","Arrival date":"July 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Java","Drying Method":"Raised Bed Sun-Dried","Grade":"SHB EP","Lot size":"6","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Lomas del Cordero, Comayagua","Roast Recommendations":"City+ to Full City"}}
{"Title":"Honduras Ocotepeque San Marcos","Overview":"Bittersweet low tones are offset by convincing caramelized sweetness, and cools to top notes of rice pudding, toasted pumpkin seeds, sunflower butter, and tarragon chocolate truffles. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/honduras-ocotepeque-san-marcos-7305.html","SKU":"GCX-7305","FarmNotes":"Ocotepeque is in the southwest corner of Honduras, bordering Guatemala and El Salvador, and has a rich history in coffee farming. The mountain ranges in this region provide altitude, microclimates, and rich volcanic soil that are ideal for farming coffee. This particular region rests near the western foothills of the Celaque National Park and mountain range, with peaks reaching over 2300 meters above sea level. This coffee is from small holder farmers in and around the town of San Marcos, and most of them are growing cultivar types such as Caturra, and Catuai, and are situated between 1400 and 1600 meters above sea level. This is a fully washed coffee, then sun-drying on patios. The green coffee is hand-sorted, which is ideal for removing defects that make it through the milling process.","CuppingNotes":"The dry fragrance has a nutty sweetness of peanut chew candy, shadowed by a note of blackstrap molasses, and herbal hint ricola hint. I get that 'herbal' accent in aroma too, the hot water bringing up both raw sugar sweetness, and an accent of fresh 'licorice'-like herbs, but with a greenish aspect too, like stevia leaf. City+ roasts have milky texture to the liquor that earns this coffee a high body score. The cup is bittersweet, chocolatey to the point of darker/high cocoa solid chocolates, but offset by convincing caramelized sweetness that has a nice smokey aftertaste. I'm not getting as much of the 'herbal' notes in the cup, though there is a faint note that comes off like tarragon chocolate truffle in the finish. Top notes that are revealed in the cooling cup include savory toasted pumpkin seed, rice pudding, and sweetened sunflower butter. Another nice addition to our Central American coffee lineup.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-18 Screen","Arrival date":"July 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Caturra, Catuaí","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHG","Lot size":"15","Packaging":"GrainPro liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"San Marcos, Ocotepeque","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Honduras Productores de La Paz","Overview":"Versatile in the roaster, with unrefined sugars, the creamy sweetness of raw cashew and macadamia nuts, chocolate almond milk, and Cadbury-type milk chocolate. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/honduras-productores-de-la-paz-7306.html","SKU":"GCX-7306","FarmNotes":"Within the Honduran department of La Paz, which native Lenca inhabitants called “the site of the stone,” two ecosystems predominate alongside the abundance of rock that inspired the earlier moniker: cloud forest and pine forest. This region in southwest Honduras, close to the boarder with El Salvador, is also home to the city of Lauterique, where a group of smallholder coffee farmers established a wet mill five years ago. Currently, 19 coffee farmers deliver primarily Lempira and IHCAFE-90 to the mill, arriving in the late afternoon during harvest for depulping and 8-10 hours of fermentation. The coffee is then washed and then dried on patios or in solar dryers depending on volume and weather.","CuppingNotes":"This coffee from La Paz is really versatile in the roaster, offering balanced sweetness at almost any roast level. The dry fragrance at City+ has elements of caramel popcorn, almond cookie, and a 'toasty' hint of burnt sugar. The sweetness is a bit more focused in the wet aroma, with browning sugars at the top of my list, augmented by a toasted almond note. The cup sweetness comes off like unrefined sugars, with a touch of raw nut-type sweetness too, similar to the creamy natural sweetness found in raw cashews, and macadamia nuts. I was able to develop moderate chocolate roast flavors at Full City, though still low intensity. To me, the flavors have the mild side of chocolate almond milk, and Cadbury-type milk chocolate. I'm fairly certain Productores de La Paz will develop heftier low tones if taken into 2nd cracks, though I didn't venture that far myself!","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-18 Screen","Arrival date":"July 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"IHCAFE 90, Lempira","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHG","Lot size":"48","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"La Paz, Comayagua","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Indonesia Sample Set","Overview":"This sample set is a selection of coffees from various coffee lands more common to our Indonesian coffee list, ones that highlight different processing traditions and the unique cup flavors that come with them.The Indonesia Sample Set includes the following coffees:Sumatra Lintong Pak JonerSulawesi Wet Hulled LatimojongTimor Leste Dry Process DaurfusuFlores Gunung Waja Mala","Score":0,"URL":"https://www.sweetmarias.com/indonesia-sample-set.html","SKU":"GCX-SAMP-INDO","FarmNotes":"","CuppingNotes":"Indonesian coffee is unfairly thought of as being a monolith of flavor. But there really is no \"Indonesian coffee\", as each coffee producing area within the country has their own processing practices, unique cultivars, and climate conditions, that all lead to vastly different flavor profiles. This sample set is a selection of coffees from various coffee lands more common to our Indonesian coffee list, ones that highlight different processing traditions and the unique cup flavors that come with them.*Wet Hulled coffees are the axis in this 4 lb sample set, featuring a very nice examples from Sumatra and Sulawesi. The wet-hulled flavor profile is perhaps most widely recognized as being \"Sumatran\" coffee - earthy sweet, bass tones a plenty, weighty mouthfeel. But here we also have a delicious example from the island of Sulawesi, promising plenty of low tones and intense, rustic sweetness. Rounding out the set are coffees from the islands of Timor-Leste and Flores. Dry Process Daurfusu from East Timor is a wild, fruity cup, with a body score that stretched our cupping scale to the absolute max! And finally, our wet process Flores coffee is perhaps the odd duck here as it seems to have more in common flavor-wise with coffees on our Latin American menu than the neighboring coffee-producing islands that surround it.The Indonesia Sample Set includes the following coffees:Sumatra Lintong Pak JonerSulawesi Wet Hulled LatimojongTimor Leste Dry Process DaurfusuFlores Gunung Waja Mala *Note: All wet hulled coffees have color variance, withered and bug bitten beans, which do not impact the cup. Learn more about this unique style of processing in our blog post Why You Should Know About Giling Basah.","Images":null,"AdditionalAttributes":{"Type":"Sample Sets"}}
{"Title":"Java Dry Process Kuningan Robusta","Overview":"Bittering cocoa, toasted pine nut, savory umami, rye and barley grains, popcorn, a leathery accent, and a unique bitter spice flavor note that's a lot like clove in the finish. Don't forget the punchy caffeine jolt! Full City to French. Nice with a splash of milk!","Score":0,"URL":"https://www.sweetmarias.com/java-dry-process-kuningan-robusta-7286.html","SKU":"GCX-7286","FarmNotes":"Coffea Canephora, or \"Robusta\" as it's more commonly known, is unlike any Arabica coffee you've tasted. In fact, it's an entirely different species altogether, known for its \"robust\" nature that has allowed for its mass propagation in low altitude areas, and natural disease resistance. If you've never tried Robusta before, the bittering cup profile can be quite a shock when tasted on its own, often faring better with a little cream and sugar. It's generally much cheaper than Arabica coffee, and the fact that it has immense body, bittersweetness, and high caffeine content makes it an economical choice for commercial roasters as a component in dark roasted blends and instant coffee. But this lot is not your typical commercial-grade Robusta. It's still unapologetically bitter at its core. But it's more in line with \"Specialty\" grade coffee in that it is processed very well, with few defects, and a cup profile that is superior to the average Robusta we taste. This lot comes from a man named Pak Ahmari, who is at the helm of a farmer group in Kabupaten Kuningan. In addition to his 21 hectare coffee farm, Pak Ahmari also buys coffee from the group of small holders he has organized in the surrounding villages. This Robusta lot is dry processed, meaning the whole coffee cherry is laid to dry with the green beans inside. This type of processing often imparts fruit flavors in the cup, but not really the case with this Robusta. You can expect bittering low tones, malted grains, and an intense clove spice aroma in the finish. For blending, a little bit goes a long way. Try starting out with a 1:4 ratio to a washed and/or natural Arabicas, and go from there. Fans of our Liquid Amber blend should know that Robusta makes up roughly 1/5 of that blend, and for such a small amount, it plays a big role in the final cup profile. Check out this Blending Basics article for our more detailed \"how-to\" guide to blending. Read more about the Coffea Canephora species in our Robusta Coffee Overview.*Note the score reflects a 7 point cupper's correction to account for how we think this coffee rates against the average Robusta.","CuppingNotes":"Full City is a good starting point for this Robusta, and I honestly enjoyed my darkest roast that saw about 15 seconds of 2nd Cracks in the barrel before pulling. While I rarely roast that dark, that's where the bittering cup profile is developed, and balances out the savory aspects that crop up. The smells and cup flavors have umami qualities that are unlike any Arabica coffee I've tried; toasted rye and barley grain, a smell of popcorn popping in vegetable oil (yes, that specific!), with just a hint of malty sweetness. The cup flavors at Full City are defined by bittering low tones, like baking chocolate, and the middle and finish are marked by toasted pine nuts, and a leathery accent. My Full City+ roasts had an incredibly dense body and mouthfeel, and with a unique bitter spice flavor note that comes through a lot like clove spice in the finish. It adds quite a bit of interest to the cup profile, and not a flavor I've tasted in Robusta before! Robusta can be quite shocking on its own, but dark roasts are well suited for milk drinks, espresso, and of course using in blends. I tried my 2nd Crack roast with a splash of milk, and the punchy bittering qualities are quite nice in that context. For blending, a little bit goes a long way, so try 1:4 ratio to washed and/or natural Arabicas, and go from there. Fans of our Liquid Amber blend should know that Robusta makes up roughly 1/5 of that blend, and for such a small amount, it plays a big role in the final cup profile. I outline ways to use Robusta in more detail in the Farm Notes, but you can also check out this Blending Basics article for our more detailed \"how-to\" guide to blending.*Note the score reflects a 7 point cupper's correction to account for how we think this coffee rates against the average Robusta.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 16-18 Screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Robusta","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Lot size":"20","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Kabupaten Kuningan, West Java","Roast Recommendations":"Full City to French","Type":"Farm Gate"}}
{"Title":"Java Wet Hulled Waspada","Overview":"Waspada challenges preconceptions you might have about wet hulled coffee. Earthy aspects are accented by unrefined sweeteners, dried date, lemony sour grass, orange herbal bitters, and intense roast bittering. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/java-wet-hulled-waspada-7280.html","SKU":"GCX-7280","FarmNotes":"Pak Gunawan's has really stretched out his entrepreneurial roots. From coffee roaster and cafe owner, to pine oil distiller (most coffee is grown in the pine agroforestry zones, so this makes a lot of sense), this Sundanese small-businessman recently added \"coffee collector\" to his repertoire. \"Collectors\" are intermediaries of sorts who buy partially processed coffee and full coffee cherry from coffee small scale farmers and then process the coffee down to the dried seed/bean. In the case of Pak Gunawan, he is renting a small warehouse space replete with coffee huller in Ciwidey and producing mostly wet-hulled coffee (aka \"giling basah\"). Whereas many collectors create large blends of all the coffee they buy, Pak Gunawan pays special attention to separating the lots that he buys by region, these smaller lot sizes adding a layer of quality control, not to mention more specific provenance. The washing station where Pak Gunawan has procured this coffee is in Waspada (also known as \"Laspada\"), near Pangalengan. We found Waspada to be a very unique wet hulled coffee, lighter roasts showing impressive acidity considering process, and the typical earthy/herbal/woody notes are interspersed with atypical fruited sweetness. One of our cuppers wrote that it \"tastes like wet hulled Sumatra with a little Ethiopia mixed in\".*Note: All wet hulled coffees have color variance, withered and bug bitten beans, which do not impact the cup. Learn more about this unique style of processing in our blog post Why You Should Know About Giling Basah.","CuppingNotes":"When people think of \"wet hulled coffee\" (aka \"giling basah\"), Sumatra tends to be the origin that comes to mind. But Java also produces some of our favorites of the complex, rustic-sweet coffees, and are often exceptionally sorted for defects too, as Waspada is. The dry fragrance yields hints of banana bread, dark corn syrup, and bittersweet rustic cocoa. I pick up on a potent blackstrap molasses note in the wetted coffee that carries notes of milk chocolate and brown bread in the steam. The interesting smells give way to a somewhat atypical wet hulled cup as well. This coffee really challenges preconceptions you might have about wet hulled coffee. Sure, it has some of the typical earth and woody aspects. But it also offers notes of fruit and an acidic impression that put it in a league of its own. The cup sweetness walks a tightrope between unrefined sweeteners and earthy dried date. I'm giving City roasting the green light here - not often recommended for wet hulled coffees - which cultivates a moderately bright cup considering, with acidity being informed by notes of lemony sour grass, and a hint of orange herbal bitters. Full City+ roasts produce more than ample sweetness that offsets some of the intense roast bitterting. There's also a hint of dried plum in there, and subtle anise aroma. I didn't pick up on a whole lot of 'smokey' aspects either, which only helps to lift the dense layers of dark cocoa. ","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 17+ Screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Ateng, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"40","Packaging":"GrainPro Liner","Processing":"Wet Hulled (Giling Basah)","Recommended for Espresso":"Yes","Region":"Waspada Village, Pangalengan, Bandung","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Kenya Kiambu Fram Farm Peaberry","Overview":"Fruited cup flavors are backed by juicy sweetness, with flavor profiles of grape, red berries, a twist of lemon that elevates acidity, and aromatic elements that hint at jamaica and raspberry iced teas. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/kenya-kiambu-fram-farm-peaberry-7272.html","SKU":"GCX-7272","FarmNotes":"Kiambu lies near the foothills of Gatamaiyo Forest Reserve, and at the border of neighboring Muranga County. Fram Farm is owned and managed by the Kariruki family, James getting his start in coffee through a small plot he inherited from his grandfather. Now at 40, James has expanded their farm to nearly 30 hectares, the entirety planted in SL-28, and sitting at roughly 1850 meters above sea level. This is the peaberry separation from their harvest, the small, rounded coffee seeds that every shrub produces in very small amount (less than 5% of yield). Peaberries occur when one of the two embryos within the coffee cherry fails to germinate, leaving the other to occupy the entire cherry, taking on its rounded shape, rather than the typical oval shaped bean with one flat side. Peaberries are often dense, and can take high heat in the roaster without having the roast get away from you. This is one of a few small estate coffees we were lucky enough to buy this year, coffees we had no direct connection with in the past. We tend to buy from the Farmers Cooperative Societies (\"FCS\"), and still do. But buying from a single estate affords us a different and unique opportunity to select coffee that we can trace back to its exact provenance, whereas with the FCS's, you're buying a blend of hundreds and sometimes thousands of small holders. This is certainly not a bad thing as some of our finest Kenyas are through FCS's, just different. We still turn to the coops for the majority of our coffee, but are hoping to continue to cultivate buying relationships with a small number of Kenyan small estates as well.*this small 4 bag lot is only available in 1 and 2 pound bags","CuppingNotes":"City and City+ roasts manage to coax out delicious fruited characteristics that fill out the cup sweetness, as well as citrus acidity that adds a 'refreshing' dimension to the profile (if not a little grabby!). The dry fragrance has a ripe berry note, along with ample citrus accents that bring a 'bright' quality to the smells. Pouring the hot water, berry notes are tucked behind this delicious dark sugar smell that reminded me of brown sugar mixed with cinnamon powder, and a cooked blackberry note in there too. Fruited cup flavors are backed by juicy sweetness, and I pick up on an amazing grape flavor in both of my light and medium roasts, with hints of red berries. City roasts produce tea-like aromatics that play off the berry elements nicely, and reminds me raspberry iced tea, or something like jamaica tea. The acidity is tart with a twist of lemon, helping structure the fruited complexity of Fram Farm's cup. Berry and citrus notes have a nice balance of flavors, actually, neither taking the lead. My Full City roast had a lush dark blackberry flavor, more like fruit cooked down with dark sugars, and just a shadow of roast bittering in the finish. Delicious. This peaberry is a lot to take in, so take your time working your way through the cup...your patience will be rewarded! *this small 4 bag lot is only available in 1 and 2 pound bags","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15 Peaberry Screen","Arrival date":"July 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Peaberry","Lot size":"4","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Kiambu, Muranga","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Kenya Kiambu Riabai AB","Overview":"Spiced aromatics and impressive sweetness lead to a brew profile saturated with cane sugar, lemonade, orange, and a flurry of herbal tea notes such as cinnamon-apple, and tart black currant tea. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/kenya-kiambu-riabai-ab-7242.html","SKU":"GCX-7242","FarmNotes":"Part of a trio of cooperative wet mills, the Riabai Coffee Factory is under the umbrella of Ndumberi Cooperative Society. The Coop Society has grown to more than 2,600 members over the past 60 years, with Riabai making up a significant chunk of membership. All members are coffee farmers, with farm sizes averaging around 1 hectare of coffee or less. Riabai is strategically positioned near the Kiu River, from where it draws its water for processing coffee. Farm altitudes start around 1700 meters above sea level, and stretch up to just above 1800 meters. Coffee is hand picked, and then delivered to the factory where an intensive hand-sorting process begins, starting with cherry and continues at the drying beds. These wet mills recycle water used to wash coffees, and pulp is also reused to fertilize trees. The coffee is then dry-milled, where yet another hand sort of the green coffee happens. So much attention is given to separating out physical defects, which makes a measurable impact on the final cup flavors.","CuppingNotes":"A candy-sweet cinnamon note permeates from the dry grounds at City roast level, and brings to mind cinnamon tea, and 'Red Hots' cinnamon hard candies. The sweetness is very clean, and spiced aromatics reminded me of some of our finest Rwandan coffees.. A citrus hint adds a tangy element to the brown sugar-like sweetness in the wet aroma, like a combination of coffee cake crust with a squeeze of orange. The brew has impressive sweetness from the outset, a flavor of simple cane sugar saturates the cup profile, and provides a very nice base flavor that on its own would make a stellar cup. But there's a lot more to the profile than sweetness, which is quickly understood as the cup temperature cools off a few degrees. Citrus notes such as lemonade, and orange help to convey Riabai's bright side, though some will find relief in the fact that it's on the subdued side for Kenya, and very refined (it still scores 8.8). The aroma has a flurry of tea notes, that with fruit and spice hints construct profiles of herbal teas such as cinnamon-apple, and tart black currant.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28","Drying Method":"Raised Bed Sun Dried","Farm Gate":"Yes","Grade":"AB","Lot size":"14","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Kenya Muranga Kagumoini AB","Overview":"The cup is vibrant with ripe mandarin orange acidity, floral honey and raw sugars, fruited notes of dried peach, pink grapefruit, orange juice, grape jelly (in darker roasts), and perfumed hints of baking spices in the finish. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/kenya-muranga-kagumoini-ab-7220.html","SKU":"GCX-7220","FarmNotes":"Kagumoini is a \"factory\" (a coffee mill) that is part of the Kamacharia Farmer's Cooperative Society. It's in Muranga County, near the intersection with Kirinyaga and Nyeri. Altitude at the small holder farms in the area average from 1600 to 1800 meters, with red volcanic loam providing nutrient rich soils (typical for the area), and farmers grow a variety of crops like tea, corn, and bananas. It's a typical cooperative in those respects, but the quality of coffee produced at this mill has been very high season after season. As with other good coops in Muranga, they always have the farmer separate the ripeness of the coffee cherry before submitting it for processing, removing under-ripes that create astringency in the cup. Small things like this make a huge difference in the resulting coffee. This is an AB outturn, where they separate all of the mid-size beans using screens that allow the 15 to 17 1/64ths inch beans to fall through. While screen size doesn't necessarily equate to a better cup, we chose this particular lot from a group of coffees based on the high cup quality. I should note that we've offered a different \"Kagumoini\" in previous years from the neighboring county of Nyeri as well. ","CuppingNotes":"The dry fragrance has a super sweet smell of stone fruits and brown sugar, pear scone, and a perfumed lemongrass hint. My Full City roast was surprisingly fruited too, with more dark grape tones, coconut water, and roast bittersweets. From City to Full City, fruits flourish amidst fragrant sweetness in Kagumoini's aroma and cup flavors. The wet aromatics have an alluring honey smell that has a floral quality, potent, and sweet, and the wetted coffee crust released a whirl of citrus and brown sugar in the steam. The cup is vibrant, bright and tangy, with ripe mandarin orange acidity that's refreshing, never acerbic or sharp. At the hub is a core sweetness of raw sugars, and branching off are fruit flavor accents of dried peach, pink grapefruit, orange juice, and perfumed hints of baking spices in the finish. Full City roasts shift toward a darker fruit flavor matrix, like grape jelly, and a plum hint. If you're looking for the snappy brightness of a Kenya cup, you'll be rewarded in the City/City+ range. Acidic intensity is more subdued with heavier roasting, while still retaining a pleasantly fruited cup character.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28, Ruiru-11","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"AB","Lot size":"40","Packaging":"GrainPro Liner","Processing":"Wet Process Kenya Type","Region":"Kagumoini, Muranga","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Kenya Muranga Nguku AB","Overview":"Forward facing sweetness of demerara, sucanat, and simple syrup, with notes of rooiboos tea, huckleberry, and refreshing Meyer lemon vibrance, all sums up to a complex cup that's Kenyan coffee all the way! City to City+.","Score":0,"URL":"https://www.sweetmarias.com/kenya-muranga-nguku-ab-7268.html","SKU":"GCX-7268","FarmNotes":"The Nguku coffee \"factory\" (basically a cooperative run coffee mill) is part of the Kahuhia Coffee Growers Cooperative Society in Muranga County. It's one of four coops under the Kahuhia umbrella, that together enlist 3000 coop members in the surrounding Muranga region. Nguku coop members are small holder coffee farmers, most with less than 1 hectare of land planted in coffee. The altitude that these farmers inhabit ranges from 1700 to 1900 meters above sea level. The red volcanic loam provides nutrient rich soils, and the high altitudinal climate on this western slope of the Aberdare mountains, lends to coffee production. As with other good coops in Muranga, they always have the farmer separate the ripeness of the coffee cherry before submitting it for processing, removing under-ripe coffee that create astringency in the cup. Small things like this make a huge difference in the resulting coffee. This is an AB outturn, where they separate all of the mid-size beans using screens that allow the 15 to 17 1/64ths inch beans to fall through. While screen size doesn't necessarily equate to a better cup, we chose this particular lot from a group of coffees based on the high cup quality.","CuppingNotes":"The fragrance has a brown sugar sweetness that backs up hints of ripe citrus and stone fruit. Hot water brings out the sweet aspects of Nguku's aromatic profile, which is loaded with dark caramelized sugars, red berry, and a quiet plum accent note. The cup sweetness is forward facing when brewed, even in the lightest roasts. Flavor notes parse out to different types of partially refined sugars like demerara and sucanat, and the sort of saccharine sweetness of simple syrup made with white sugar. Cup cleanliness is highlighted by a lemon-like acidity, which not only feeds into a very bright cup, but lends to this mouth cleansing aspect in the finish that's refreshing! The coffee cools to flavor notes of Meyer lemon, rooiboos tea, and a softer hint of tart huckleberry that sum up to a cup complexity that's Kenyan coffee all the way. All in all, this first AB Nguku lot offers stunning acidity and sweetness, characteristics best highlighted with light roasting.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"July 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28, SL-34, Ruiru-11, Batian","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"AB","Lot size":"45","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Muranga","Roast Recommendations":"City to City+","Type":"Farm Gate"}}
{"Title":"Kenya Muranga Riakiberu Peaberry","Overview":"Restrained fruit flavors of black currant, raisin, tamarind, berry, and lemon radler marry with sweetness of simple syrup to caramel depending on roast level, and with moderately bright acidity, and such a sweet finish. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/kenya-muranga-riakiberu-peaberry-7219.html","SKU":"GCX-7219","FarmNotes":"Riakiberu Factory is located in Muranga District in Kenya's Central Province. The wet mill is very old, built up in the late 1950's for members in the surrounding villages. Like most factories, the wet mill site is where farmers deliver whole coffee cherry to be processed through the wet mill, then dried before moving to dry milling facilities where the coffee is prepared for export. Riakiberu sits at roughly 1750 meters above sea level (some farmers at much higher elevations), and situated near the Ndurumo River from which they are able to channel fresh water to be used for wet processing, which is then re-circulated without being put back into the river. Riakiberu is part of the Kamacharia Farmers Cooperative Society who currently serves over 1500 farmer members. This is the peaberry selection, the small, round shaped beans that they separate by running through a series of vibrating screens. Some say that peaberries are sweeter, due to higher density. There may be some truth wrapped into this claim, but I wouldn't say that's always the case. We also bought the largest bean, AA separation, and found that they bothy had some restrained fruit, with tea-like flavors, and moderate acidity.","CuppingNotes":"The fruits in Riakiberu's cup are berry like, and a little restrained in the light roasts,  leaving plenty of room for intense sweetness to come through. City roasts pull out a scent of red berry syrup, sugar in the raw, with aromatic accent notes, like cinnamon-spiced honey, and citrus spice blend. The wet aroma produces aromatic aspects of loose leaf herbal teas, like chamomile, and lemon grass teas, with a nice supporting sweetness that hints at more of the raw, unrefined types of sugars. As you move into tasting the brewed coffee at City level, the sweetness takes on more of a transparent characteristic, which makes me think of simple syrup, persistent, but much less potent aroma than say molasses or sugarcane juice. It helps to fill out some of the lighter fruit elements that crop up, like black currant, raisin. A lemony note comes up as the coffee cools, and mixes wight a honey-wheat hint that brought to mind a radler (beer/lemonade drink). I roasted one batch to somewhere in between City+/Full City (about 25 - 27 degrees of development past the beginning of 1st crack), and along with dark berry accents, the sweetness takes on more complex sugar notes and cools to a really delicious profile of caramel and dried tamarind that extends to the aftertaste. Riakiberu is brightest at City roast, no doubt about it. But some tannic brightness comes through in deeper roasts too.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15 Peaberry Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28, SL-34","Drying Method":"Raised Bed Sun Dried","Farm Gate":"Yes","Grade":"Peaberry","Lot size":"16","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Muranga, Central Province","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Kenya Nyeri Kagumo Peaberry","Overview":"A stunning cup profile of juicy sweet fruits, and remarkable aromatic depth. Notes of red fruit punch, pineapple, orange tea, melon fruit salad, spiced cranberry juice, and fruited brightness that's not too grabby. City to City+.","Score":0,"URL":"https://www.sweetmarias.com/kenya-nyeri-kagumo-peaberry-7238.html","SKU":"GCX-7238","FarmNotes":"Kagumo is a \"factory\" (a coffee mill) that is part of the Aguthi Farmer's Cooperative Society. The town of Kagumo is very near Gaaki, in Nyeri. Altitude in this region tops out at just over 1700 meters above sea level, and the landscape is graced with red volcanic loam soils, that's nutrient rich, and typical for this area. Farmers typically grow SL-28 and SL-34 Bourbon selections, with smaller amounts of Ruiru-11, and Batian varieties intermixed. There are currently around 1300 members of the Aguthi FCS who deliver their coffee cherry to this particular wet mill for processing.  We've bought one other coffee from Aguthi FCS, Gititu, and both coffees represent special attention to sorting all the way through processing. As with other good coops in Nyeri, they always have the farmer separate the ripeness of the coffee cherry before submitting it for processing, removing under-ripes that create astringency in the cup. Small things like this make a huge difference in the resulting cup flavors.","CuppingNotes":"The dry fragrance smells incredibly complex and sweet, with notes of vanilla, peaches and cream, and a sort of floral tea accent too. The wet aroma brings out darker fruit tones, such as grape, cranberry, and plum, with a citrus tea, and rose-like floral notes pushing the complexity even further! Kagumo Peaberry produces incredible pour over brews at City roast level, with fruited sweetness that's attention grabbing, and bright spots of citrus and spice that all add up to a very special coffee. The cup sweetness is succulent and juicy, like a classic red fruit punch blend of berry, orange, and pineapple juices. I get notes of melon fruit salad, orange tea, and spiced cranberry juice. The acidity is pleasantly bright without being too grabby, and with an underlying juiciness in texture that's mouth pleasing. The coffee flavors shift and change as it cools, with remarkable aromatic depth. It's a coffee that just seems to reveal more and more as you move through it. Full City roasting drives up the berry factor, and somehow shows mostly fruited sweetness with very little roast bittering. Be that as it may, I'm recommending the lighter roasts for the most dynamic cup profile.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15 Peaberry Screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28, SL-34, Ruiru-11, Batian","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Peaberry","Lot size":"27","Packaging":"GrainPro Liner","Processing":"Wet Process Kenya Type","Region":"Kagumo, Nyeri","Roast Recommendations":"City to City+ for the most dynamic, bright cups","Type":"Farm Gate"}}
{"Title":"Kenya Thika Oreti Peaberry","Overview":"Incredible light roast pour-over, vibrant and tart cup, with flavors of orange, lemonade, and grabby grapefruit, opening up to hints of cranberry juice, pomegranate, lemon, boysenberry, rose hip tea, and a whole lot more! City roast level preferred.","Score":0,"URL":"https://www.sweetmarias.com/kenya-thika-oreti-peaberry-7266.html","SKU":"GCX-7266","FarmNotes":"The Oreti Estate has been in the Harries family for more than 60 years. They came to Kenya in the early 1900's, and soon started cultivating coffee on land not far from Oreti. It is situated in the Thika highland plateau, and straddles the Kiambu/Muranga border. The 36 hectare coffee estate sits at a modest 1600 meters above sea level, and planted in very old SL-28 and French Mission bourbon trees. We tend to buy from the Farmers Cooperative Societies (\"FCS\"), and still do. But buying from a single estate affords us a different and unique opportunity to select coffee that we can trace back to its exact provenance, whereas with the FCS's, you're buying a blend of hundreds and sometimes thousands of small holders. This is certainly not a bad thing as some of our finest Kenyas are through FCS's, just different. We still turn to the coops for the majority of our coffee, but are hoping to continue to cultivate buying relationships with a small number of Kenyan small estates as well.*this tiny, single bag lot is limited to 1 lb. per customer!","CuppingNotes":"We put just as much work into 1 bag of coffee as we do 100, so you can bet we are super selective when it comes to buying tiny lots. This single bag of Oreti was stunning on offer, and we knew that we simply could not pass up the opportunity to buy it, even at 1 bag. We're so glad that we did! The dry fragrance has a lovely fruited scent of cherry juice, with clove, dried citrus peel, and brown sugars too. A smell of dark berry builds in the steam, and culminates to profiles of blackberry and raspberry jams, with hints of dried plum when breaking through wetted crust. When the cup is hot, it showcases a much brighter citrus side than I was expecting. Flavors are vibrant and tart, with notes of orange, sweetened lemonade, and grabby grapefruit. Even at Full City, I'm getting this really tangy lemon note amidst the smokier roast bittering. The flavor combo reminds me of espresso with a lemon rind. As the coffee cools, the berry flavor profiles come back into view, though citrus notes and overall acidic intensity does not fall away. Instead, you're left with vibrant fruit profiles like cranberry juice, fresh pomegranate, lemon, boysenberry, rose hip tea, and a whole lot more! City roasts are so lively and bright, fruit flavors supported by a nice underlying sweetness, and this pleasantly bittering tea-tannic feature in the finish. Best when roasted light, in my opinion, where you'll find it makes a super complex pour over brew.*this tiny, single bag lot is limited to 1 lb. per customer!","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15 Peaberry Screen","Arrival date":"July 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"SL-28, SL-34","Drying Method":"Raised Bed Sun Dried","Farm Gate":"Yes","Grade":"Peaberry","Lot size":"1","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Thika Plateau","Roast Recommendations":"City","Type":"Farm Gate"}}
{"Title":"Mexico Chiapas Sierra Mariscal","Overview":"Crowd-pleasing but not too showy, top notes pleasantly restrained amidst a bittersweet backdrop. Molasses, dark cocoa, malted grain, glimpses of fruit when roasted light. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/mexico-chiapas-sierra-mariscal-7349.html","SKU":"GCX-7381","FarmNotes":"The Sierra Mariscal region butts right up against the Guatemalan border, both positioned in the Sierra Madre de Chiapas mountain range and benefiting from the range of altitude, micro-climates, and nutrient rich volcanic soil. Within Sierra Mariscal is the town of Motozintla, which is where this coffee is from. It comes to us by way of a 500 person cooperative in Motozintla, who have gone through the process of organic certification. The coffee farms are at 1500 meters above sea level on average and you still see a lot of Typica planted on coffee farms, along with Bourbon, Caturra and Catuaí. We found this coffee checked off boxes for chocolate bittersweets, body and nutty roast tones. It's versatile in the roaster, but I prefer a nice Full City roast as immersion brew myself. It's a coffee that pairs well with milk, but certainly satisfies 'solo' too as a chocolatey-rich, morning cup. I pulled a few partial quakers from my 100 gram roast. ","CuppingNotes":"This year's coffee seems a lot more versatile in the roaster than what I remember of our lot from 2021. Specifically, this lot produces a tasty cup at City roast level, where looking back on old notes, I see that I struggled to pull out sufficient sweetness last go around. Whatever the case, Sierra Mariscal offers an attractive cup profile at both ends of the roast spectrum, crowd-pleasing but not too showy, the top notes pleasantly restrained amidst dominant bittersweetness. The dry fragrance has a syrupy molasses smell, with bittersweet cocoa not far behind, and a hint of dried fruit. I found a little more intensity in the wet aroma, with a note fruit leather at City+, and creamy chocolate smells when roasted dark. City roasts have this malty sweetness that reminded me of a malt soda, if you've ever tried that (in Colombia, we often drink Pony, and you can often find Malta Goya at the local stores here in the Bay). If you haven't tried one, the sweetness has mild elements of molasses, with the malted grain flavor in the nose. I also pick up on subtle fruit hints. My Full City roast extracted delicious chocolate characteristics that are buouyed by body, with a well developed sweet underlay. Flavors of high % cocoa solids chocolate and roasted cacao are what we noted, substantial chocolate flavors that resonated in the aftertaste.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 16-18 Screen","Arrival date":"August 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Bourbon, Caturra, Catuai, Typica","Drying Method":"Patio Sun-Dried","Grade":"SHG","Lot size":"63","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Motozintla, Chiapas, Mexico","Roast Recommendations":"City to Full City+"}}
{"Title":"Nicaragua Jinotega La Bastilla Estate","Overview":"Middle roasts are crowd pleasing with rich bittersweetness, flavors of nougat, roasted nut, chocolate-malted beer grains, cinnamon top note, and a satisfying cocoa powder finish. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/nicaragua-jinotega-la-bastilla-estate-7355.html","SKU":"GCX-7355","FarmNotes":"Washed Nicaragua coffees can be mild, crowd pleasing and balanced, and this lot from La Bastilla Estate is definitely all of that, and a little more. It's Catuaí coffee grown at low to medium elevation, and there's really nothing \"wild\" in the profile, other than how wildly versatile it is! It shows well in lighter roasts, as well as taking all the way to 2nd Crack. And we like it this way - a pleasantly sweet, bodied, low acid cup. La Bastilla Estate is a large, 300 hectare farm situated between Datanli and El Diablo nature reserves. About half the farm is currently producing coffee, broken into 18 small plots. This coffee is from the small plot called \"El Espejo\", a 1200 meter parcel of land planted in H17 hybrid. El Espejo was planted in 2019, and this is the first harvest from this plot. La Bastilla obtained RFA certification over a decade ago, abundance of trees on the farm provide ample shade canopy for the coffee to slowly mature beneath.","CuppingNotes":"This dry grounds from La Bastilla Estate have a pleasantly mellow profile of molasses cookie, and milk chocolate in the City+ to Full City roasts. The wetted grounds satisfy in the same way, and also smell much sweeter in the middle, rather than lighter, roast ranges. The brewed coffee of City+ roasts has flavors of nougat, roasted nut, chocolate-malted beer grains, and a top note cinnamon hint. Roasting to Full City adds a bit more heft to the chocolate roast flavors, wrapping up the caramel and nut tones within rich dark chocolates, and a sprinkling of cocoa powder in the finish. This is a crowd-pleasing coffee that promises balanced bittersweetness all the way up to 2nd Cracks. It's a no brainer for espresso and milk drinks too, on its own, or as a bittersweet base component for a blend.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 16-18 Screen","Arrival date":"August 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"H17","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB","Lot size":"20","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Jinotega","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Nicaragua Los Altiplanos Java Cultivar","Overview":"A cup with Java cultivar characteristics of herbal aromatics, moderate supporting sweetness and acidity, with accents of demerara sugar, baking spice, spearmint, bell pepper, and tea notes of Sencha and Yerba Mate. City to City+.","Score":0,"URL":"https://www.sweetmarias.com/nicaragua-los-altiplanos-java-cultivar-7356.html","SKU":"GCX-7356","FarmNotes":"I generally don't fixate on cultivar when cupping our Nicaraguas, most being Caturra or hybrid types that lend to balanced bittersweetness, and mild-to-moderate acidity when grown at the upper altitudes. But when I hear \"Java\" (or Gesha for that matter!), my ears perk up a bit. This unique cultivar came to Central America by way of Cameroon, through transfer and cultivation on the isle of Java. It resembles some Ethiopian heirlooms in physical appearance, and also tends to produce aromatic cup when roasted light. In a word, it's interesting! Most farms we buy Java from only grow a small amount. Needless to say, we were pretty excited to come across this uncharacteristically large lot from Los Altiplanos, who've gone all in with this unique cultivar. Their 78 hectare farm has a large portion of the farm devoted to Java, and this lot we selected was a whopping 49 bags! The Los Altiplanos farm is owned and managed by Ricardo Cuadra, whose family have been growing coffee in this region for more than 100 years. His farm is located near Jinotega, near the mountain reserve of Datanli el Diablo, with altitudes reaching upwards of 1300 meters. We have not visited Ricardo's farm, but hope to next harvest.","CuppingNotes":"The dry fragrance has an herbal scent of teas like chamomile and Yerba Matte, with a sweetness of raw sugar and waxy honey comb. Sweetness moves to the forefront when pouring hot water, but the herbaceous tea notes are right behind it. A nice, simple brown sugar takes up quite a bit of space in the steam, with hints of black teas filling in the cracks a bit. I'm loving the herbal and tea notes that come through as the coffee cools, supported by moderate level of sweetness and acidity. Flavor come through more clearly as you move through the cup, hinting at semi-raw sugars like demerara and sucanat, baking spices, Sencha tea, and mild notes of bell pepper and spearmint marking the finish. The cup complexity described here is very much tied to a light roast level. I strongly encourage a City roast to achieve this, which on my Quest M3s is about 1:30 beyond the start of 1st Crack (roughly 15F degrees development). That's not to say that dark roasts are off limits! Los Altiplanos Java will undoubtably make a crowd pleasing bittersweet cup too, despite my light roast recommendation. ","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-18 Screen","Arrival date":"August 2022 Arrival","Bag size":"69 KG","Cultivar Detail":"Java","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"SHB EP","Lot size":"49","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Jinotega","Roast Recommendations":"City to City+","Type":"Farm Gate"}}
{"Title":"Panama Boquete La Gloria Estate","Overview":"Another high caliber washed coffee from La Gloria, raw cane sugar, background notes of bittering cacao and almond counter, but never overcome, mouth refreshing acidity, baked apple hint as the coffee cools. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/panama-boquete-la-gloria-estate-7352.html","SKU":"GCX-7352","FarmNotes":"La Gloria Estate is one of several \"Baru Indian High\" estates in Boquete's Horqueta subregion. These estates benefit from altitudes reaching 2000 meters at their peak, nutrient-rich volcanic soils, mild average temperatures, and ideal annual rainfall. La Gloria has access to natural spring water that flows through the area, useful at the farm and around the estate, and also a direct water source for local farmers. The coffee is wet-processed and patio dried in the much warmer climate of Dolega, Cosecha nearby. There is some mechanical \"finish\" drying in order to keep up with production during the busiest times of the harvest too. Preparation of the green coffee is meticulous a benefit for roasting, making for uniformity in color, and easy to read degree of roast.","CuppingNotes":"It's so nice to have Panamanian coffee back on the list from this older estate that's consistently produced high caliber washed coffees. The dry grounds have a honey and 'grain' smell in light roasts, with a bit more development (toward FC) adding chocolate roast tones to the mix. At City+, the wet grounds some candied sweetness, a butterscotch scent, very sweet, and along with a smell of baked goods, like fresh fried donut. City+ captures this coffee's sweetness best in my opinion, and still leaves plenty of room for the lovely citrus-like brightness to shine through. For the acidity averse, don't fret. La Gloria's acidity level is not 'bright' in comparison to some of our African coffees, but has a nice mouth refreshing aspect at this lighter roast level that adds a touch of elegance, and not to mention structure. It can be toned down too, by roasting a shade darker to Full City. The middle roasts yield a somewhat neutral raw cane sugar flavor, with background notes of bittering cacao and almond that counter, but never overcome. There's a mild fruit note when the cup cools, hints of baked apple and pear.  The finish is clean, heightened by pleasing acidity felt on the tongue.","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 15-18 Screen","Arrival date":"August 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Caturra, Catuaí, Typica","Drying Method":"Patio and Mechanical Drying","Grade":"SHB EP","Lot size":"50","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Horqueta, Boquete","Roast Recommendations":"City to Full City"}}
{"Title":"Papua New Guinea Korgua X","Overview":"Medium body across a range of roasts, and moderate acidity, fruited lemongrass hint, dried apple slices, natural dried stone fruit flavor, with some rustic sweetness at a shade more roast development. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/papua-new-guinea-korgua-x-7177.html","SKU":"GCX-7177","FarmNotes":"\"Korgua X\" sounds a bit like a super hero, and while they may produce super coffee, there's nothing super human about them. The Korgua Estate resides in Nebilyer District, Central Highland region of Papua New Guinea. Now run by Brian Leahy, the farm was founded by Brian's father Dan and Uncle Mick, two well-known Australian explorers (their early films and photos being the basis for the Australian documentary, \"First Contact\"). Korgua Estate sits at about 1400 meters above sea level and is planted mostly in older Bourbon and Typica cultivars. It's a wet processed coffee, meaning the coffee cherry and much of the fruit are stripped from the seed using depulping machinery, and then the seed still covered in sticky mucilage is submerged in water tanks where it ferments overnight, breaking down the remaining outer layer of fruit. Now this is an X grade coffee, which is technically 'lower' than the top grades like A and AX. But tasting it blind side by side with the top grades, it was clearly the superior cup, more fruited and sweet in a way that set it apart from the rest.","CuppingNotes":"This lot from Korgua Estate is an X grade, which technically is considered a lower level than AA and A grades from Papua New Guinea (PNG). But there are cases like this where, in cupping all of them side by side, X Grade has the fruited sweetness the others lack. The AA was pleasant enough, but really lacked character, whereas X was sweet and fruit-laden. Toffee and caramel sweet smells transfer from freshly ground coffee to wet aromatics, as well as fruited notes that seem to gain momentum after pouring hot water. The coffee extracts medium body across a range of roasts, and presents moderate acidity when kept to the lighter end of the spectrum. (Body is heightened when using full immersion methods like French Press, especially with City+ and Full City roasts where sweetness plays as prominent a role as bittering coffee roast tone!). In terms of top notes, I get a fruited lemongrass hint, and dried apple slices at City, that shape shifts to more of a natural dried stone fruit flavor, with some rustic sweetness with a shade more roast development.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 screen","Arrival date":"March 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Arusha, Bourbon, Typica","Drying Method":"Patio Sun-Dried","Grade":"X","Lot size":"56","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Nebilyer Valley District, Central Highlands","Roast Recommendations":"City to Full City"}}
{"Title":"Papua New Guinea Kuta Waghi","Overview":"Brews very well at City+, torched sugar, toffee, understated hints of prune, and dried citrus peel, aromatic tobacco, ample bittering that points to tannic tea, and unsweetened baking chocolate. City+ to Full City+.","Score":0,"URL":"https://www.sweetmarias.com/papua-new-guinea-kuta-waghi-7176.html","SKU":"GCX-7176","FarmNotes":"This coffee comes to us by way of the Kuta coffee mill in the Waghi District of Papua New Guinea. The coffee processed at the mill are from smaller coffee plantations in the area situated at just under 1600 meters above sea level on the low end. It's a wet processed coffee, meaning the coffee cherry and much of the fruit are stripped from the seed using depulping machinery, and then the green coffee seed, still covered in sticky mucilage, is submerged in water tanks where it ferments overnight, breaking down the remaining outer layer of fruit. The physical preparation of this coffee is decent, however, I did find a few partial quaker beans in my roasted coffee. Quakers are unripe coffee that are easy to spot when roasted as they remain light tan no matter how dark you roast your coffee. Not all beans with a lighter color variance are quakers! And similarly, not all quakers have the same affect on flavor. Coffee that is nearly ripe will be a little darker in color than a true, full quaker, and taste much closer to the fully ripe coffee. A few partial quakers like these are likely to go undetected in a full brew batch. There's also very little silver skin left on the seeds, which makes judging roast development by physical color shade fairly easy.","CuppingNotes":"This Papua New Guinea coffee has a nice sweet scent that transfers from freshly ground coffee to wet aromatics that, with convincing chocolate roast smells, have a smell of bittersweet confections. This carries through to the brewed coffee, and City+ roasting provides dark sugar and toffee sweet flavors with a 'toasted' note, like torched sugar. Kuta Waghi shows understated fruit aspects as it cools, a faint hint of prune, wisps of dried citrus peel that get the most attention at lighter roast levels, though are still very low in the profile. The aftertastes shows ample bittering that points to tannic tea, and unsweetened baking chocolate depending on how dark you roast it. There's also a rustic note in the finish that produces an earth-toned aromatic feature, and comes off like fruited pipe tobacco. Light roasts have moderate acidity as well that leans toward citric, without being sharp or acerbic, but well-integrated into the cup flavors.","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-17 Screen - I found some partial quakers in my roasted coffee, and a single full quaker. These are easy to identify by their light color, and can be picked out, but not necessary.","Arrival date":"March 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Arusha, Bourbon, Typica","Drying Method":"Patio Sun-Dried","Grade":"AX","Lot size":"30","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Waghi Valley","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Peru San Ignacio SWP Decaf","Overview":"Little indication it's decaf. Impressive cup sweetness accented by hints of green tea, Matcha, banana-nut bread aroma, mild wheat bread hint, and bittersweet cocoa when roasted dark. City to Full City. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/peru-san-ignacio-swp-decaf-7232.html","SKU":"GCX-7232","FarmNotes":"This custom decaf blend is made up of coffees from two producers in Peru's San Ignacio Province. These two producers are part of a group 24 farmers who have banded together in a cooperative effort with an intermediary in order to improve their processing methods, and ultimately coffee quality and the price they can get for it. Most farms are 1-3 hectares of land, and spread across an altitude range of 1500 to 1900 meters above sea level. They are growing a broad selection of coffee cultivars, including Caturra, Typica, Bourbon, Pache, Catuaí, and Catimor (the intermediary have set up a program to incentivize farmers to replant their Catimor with other disease resistant hybrids that offer higher cup quality). I don't know that this is intentional, but in a way, having the disease-resistant hybrids in the mix helps hedge their risk against issues of coffee leaf rust and other coffee plant diseases that can spread throughout a crop if not treated right away. Most farmers use water-conserving mechanical demucilagers to process their coffee, leaving behind as much of the fruit as possible so that the moisture within will promote a fermentation without having the use water. They employ a variety of drying methods including polypropylene tents, cement patios, and raised beds, and the coffee is then dried until it reaches a safe moisture range of 9 - 11% before bagging up to rest. The majority of our decaf coffees are processed by Swiss Water in Vancouver, BC. Not only do they offer 100% chemical free decaffeination process, but we are able to choose coffees from our own stocks that we love, so we know we will get delicious decafs in return. Read more about the Swiss Water method, HERE.","CuppingNotes":"Spiced raw sugars run through the dry fragrance, and along with some mild fruited notes, brings up a smell of cinnamon spiced banana nut bread. There is a continuation of the banana/nut bread smells in the wet aroma, accompanied by something a little bit buttery, like butter toffee. I was really impressed by the clean cup flavors of San Ignacio, with very little indication that I was drinking decaffeinated coffee. Light roasts have a leafy tea flavor wrapped in raw sugar sweetness, a little green tea, and Matcha like finish. There are definitely some bready flavors too that are indicative of the decaf method, but the rye grain and wheaty flavors blend nicely with moderate cup sweetness. Full City roasts are very bittersweet, and body has more of a velvety thickness to it than the light roasts, which I found to be a bit thin. I'll definitely give Full City roasts a thumbs up for espresso based on the bittersweetness alone.","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-17 screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Drying Method":"Raised Bed Sun-Dried","Grade":"SHB","Lot size":"46","Packaging":"GrainPro Liner","Processing":"Wet Process, then SWP Decaf","Recommended for Espresso":"Yes","Region":"San Ignacio","Roast Recommendations":"City to Full City","Type":"Farm Gate, Decaf"}}
{"Title":"ROASTED COFFEE: Brazil Pulp Natural Fazenda IP","Overview":"Roast Date: 10/4/2022Roasted to City+: Bittersweet cacao, burnt sugar, barley malt, corn syrup, and pleasantly bittering baking chocolate aftertaste. Order a bag of this limited coffee feature while supplies last!","Score":0,"URL":"https://www.sweetmarias.com/roasted-coffee-brazil-pulp-natural-fazenda-ip-7174.html","SKU":"RSTD-1050-7174","FarmNotes":"Fazenda IP is located in the city of Carmo de Minas, Brazil. It's a rather massive farm really, at about 130 hectares ( roughly 320 acres), and is owned and operated by the folks at Sertao, the Pereira family. The name Sertao is synonymous with coffee production in the area, as they were the first to cultivate coffee in the Minas Gerais region of Carmo. This family has a 100+ year history of growing coffee in this area, and the Pereira family lots grace the COE finals list year after year. There are several varietals grown at IP, but this lot is a separation of entirely Yellow Bourbon. This is a pulp-natural coffee, which means that unlike a washed coffee, they mechanically remove most, but not all of the sticky fruit/mucilage before laying the beans out to dry. Pulp natural processing often lends to body as well as imparts slightly more fruited or rustic flavors. However in Brazil - where dry processing is widely used due to a near-perfect climate for it - pulp natural is the less fruited and rustic processing method.","CuppingNotes":"","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen","Arrival date":"March 2022 Arrival","Cultivar Detail":"Yellow Bourbon","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Estate","Packaging":"Biotre Compostable Valve Bags","Processing":"Pulp Natural","Region":"Carmo de Minas","Type":"Farm Gate, Roasted Coffee"}}
{"Title":"ROASTED COFFEE: Kenya Kiambu Fram Farm","Overview":"Roast Date: 10/4/2022 Roasted to City: sweet citrus notes like mandarin, and pink grapefruit, bright acidity, hints of stone fruit, and spiced juniper berry.Order a bag of this limited coffee feature while supplies last!","Score":0,"URL":"https://www.sweetmarias.com/roasted-coffee-kenya-kiambu-fram-farm-7270.html","SKU":"RSTD-1050-7270","FarmNotes":"Kiambu lies near the foothills of Gatamaiyo Forest Reserve, and at the border of neighboring Muranga County. Fram Farm is owned and managed by the Kariruki family, James getting his start in coffee through a small plot he inherited from his grandfather. Now at 40, James has expanded their farm to nearly 30 hectares, the entirety planted in SL-28, and sitting at roughly 1850 meters above sea level. This is one of a few small estate coffees we were lucky enough to buy this year, coffees we had no direct connection with in the past. We tend to buy from the Farmers Cooperative Societies (\"FCS\"), and still do. But buying from a single estate affords us a different and unique opportunity to select coffee that we can trace back to its exact provenance, whereas with the FCS's, you're buying a blend of hundreds and sometimes thousands of small holders. This is certainly not a bad thing as some of our finest Kenyas are through FCS's, just different. We still turn to the coops for the majority of our coffee, but are hoping to continue to cultivate buying relationships with a small number of Kenyan small estates as well. ","CuppingNotes":"","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 17-19 Screen","Arrival date":"July 2022 Arrival","Cultivar Detail":"SL-28","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"AA","Packaging":"Biotre Compostable Valve Bags","Processing":"Wet Process (Washed)","Region":"Kiambu, Muranga","Type":"Farm Gate, Roasted Coffee"}}
{"Title":"ROASTED COFFEE: Rwanda Nyamasheke Nyakabingo","Overview":"Roast Date : 9/20/2022Roasted to City+: Balanced bittersweetness underscores a cup marked by aromatic top notes of clove, Darjeeling tea, and cardamom. Order a bag of this limited coffee feature while supplies last!","Score":0,"URL":"https://www.sweetmarias.com/roasted-coffee-rwanda-nyamasheke-nyakabingo-7186.html","SKU":"RSTD-1050-7186","FarmNotes":"The Nyakabingo coffee washing station is named after the hill (referred to as \"collines\") where it resides. It's located in Rwanda's Nyamasheke district at an altitude of 1850 meters above sea level, though farms reach up much higher toward 2000. There are 329 farmers who are currently registered as selling their coffee to the Nyakabingo site. All coffee delivered receives the typical front line sorting at the gate, hand picking out any under and over ripe coffee cherries and then soaking the coffee in tanks of clean water in order to skim away any \"floaters\" (over ripe coffee) that were missed. The coffee is depulped, fermented to break down the fruit mucilage, channel graded and then moved to drying patios. \"Channel grading\" is the process of moving the coffee from the fermentation tanks down a series of narrow cement channels that they fill with water, the densest coffee settling on the bottom, while the lighter, lower grades float and continue on down to the end. Amazingly, they are able to separate 5 different grades using this method, A1 being the highest grade and densest beans, which is what this coffee is. ","CuppingNotes":"","Images":null,"AdditionalAttributes":{"Appearance":".2 d/300gr, 16-18 Screen","Arrival date":"April 2022 Arrival","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Packaging":"Biotre Compostable Valve Bags","Processing":"Wet Process (Washed)","Region":"Nyamasheke, Western Province","Type":"Farm Gate"}}
{"Title":"ROASTED ESPRESSO Espresso Monkey Blend","Overview":"Roasted on 9/20/2022 to Full City ++Bittersweet chocolate, licorice and dark fruit.","Score":0,"URL":"https://www.sweetmarias.com/roasted-espresso-espresso-monkey-blend.html","SKU":"RSTD-1050-2653","FarmNotes":"","CuppingNotes":"We blend this for body, balanced between high and low tones, chocolate roast flavors, and slightly rustic fruited accent notes. Those are our goals, that is the \"spirit\" behind the blend, and we check it to make sure it meets those targets. This blend has historically been geared toward Full City to Full City+, without letting 2nd crack \"roll\" too long. The current ingredients include some dry process coffee from Africa and South America, which lend to big body and some fruited cup characteristics. There's also a nominal amount of a washed Central American coffee that helps round out the sweetness in the cup or shot.","Images":null,"AdditionalAttributes":{"Drying Method":"Patio and Raised Bed Sun-Dried","Processing":"Wet and Dry Process","Region":"Africa, South America, Central America","Type":"Sweet Maria's Blends"}}
{"Title":"ROASTED ESPRESSO Liquid Amber Blend","Overview":"Roasted on 10/4/2022 to Light ViennaRustic sweetness, spices and savory notes. ","Score":0,"URL":"https://www.sweetmarias.com/roasted-espresso-liquid-amber-blend26.html","SKU":"RSTD-1050-2655","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{}}
{"Title":"Roasted Coffee Subscription","Overview":"Enjoy 2 lbs of freshly roasted coffee from our Probat roaster at Sweet Maria's Coffee. With a roasted coffee subscription we ship you two different single origin coffees roasted between a City-Full City roast, packaged in resealable valve bags. ","Score":0,"URL":"https://www.sweetmarias.com/rstd-subs-1050.html","SKU":"RSTD-SUBS-1050","FarmNotes":"","CuppingNotes":"","Images":null,"AdditionalAttributes":{}}
{"Title":"Rwanda Dry Process Kanyege","Overview":"Juicy blackberry and fresh fig notes tucked behind substantial chocolate roast taste, with hints of dried blueberry, date, caramelized sugar, truffle, and fruited acidity. Punctuated bittersweetness when roasted dark. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/rwanda-dry-process-kanyege-7189.html","SKU":"GCX-7189","FarmNotes":"Tucked away in the Nyamasheke region of Rwanda's Western Province is the Kanyege washing station site. At 1870 meters above sea level, Kanyege rests in the hills just above the Kanzu site, and the coffee they are processing comes from farms as high as 2000 meters. Farmers in this region are growing older Bourbon cultivars, and while Kanyege produces mostly wet process, this 25 bag lot is a dry process lot. Dry processing (also referred to as \"naturals\") is when the whole coffee cherry is laid to dry with the seeds still inside. With all that fruit still intact, it can take 4 times as long to dry down, during which, fermentation does occur, having an affect of the coffee's cup characteristics. Dry process coffees tend to show more fruit forward flavors, bigger body, and milder acidity. The workers at the Kanyege site are floating coffee cherry before laying to dry, in order to identify and remove the underripe coffee that floats to the top (often called \"floaters\"). They are also sifting through the drying coffee cherry by hand in order to remove other physical defects. With the cherry still intact, it's difficult to spot all of the physical defects, and I found a few partial quakers and one full in the coffee I roasted. Full quakers are pretty easy to identify as their physical color remains light yellow no matter how dark the roast level.","CuppingNotes":"Looking back on my notes from last year, this dry process lot from Kanyege reads more berry forward, the aroma and cup flavors far from basic. City+ roasts see fruited hints accenting nice bittersweet cocoa smells in the dry fragrance, red berry, and even a slight floral note. The wet aroma hints at strawberry beneath a well developed sweetness, along with cinnamon stick and clove spice accents up top. In the cup, fruit notes of juicy blackberry and fresh fig are tucked behind a substantial chocolate roast taste. The cup cools to a caramelized sugar sweetness, with a berry-type acidic impression that adds a moderate vibrance in the City/City+ roast range. This fruited brightness draws the fruit flavors out from the bittersweet background to some degree, offering a nice contrast to the truffle-like chocolate roast flavors. The aftertaste has hints of rustic dried fruits, as well as a mild tobacco note in the long finish. Full City roasting sees punctuated bittersweetness paired with dried blueberry, and date accent notes. Body also rates very high (9.3) making it a great option for a dry process blend ingredient (or single origin espresso if you're like me!).","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15+ Screen - a few quaker and partial quaker beans","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Lot size":"25","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Region":"Nyamasheke","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Rwanda Nyamasheke Macuba","Overview":"A sturdy-sweet cup, crisped toffee crust, fragrant honey, dulce de leche, with acidic aspects of brisk tea, and a juicy note of cherry and raspberry. Layered chocolate flavors at Full City, with a dark berry hue. City to Full City. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/rwanda-nyamasheke-macuba-7188.html","SKU":"GCX-7188","FarmNotes":"Macuba coffee washing station is located in Rwanda's Nyamasheke district. The stations itself sites at an altitude of 1685 meters above sea level, though farms reach up much higher toward 2100 meters. More than 400 farmers are registered with the Macuba site, which acts as a central delivery location for farmers to sell coffee cherry, but also to receive agronomical and business support. Farmers are also incentivized through cash bonuses at the end of the harvest, and interest free bank accounts that allow them to store money safely, as well as establish credit for future investment. All coffee cherry undergoes initial sorting at the gate, hand picking out any under and over ripe coffee cherries, and then soaking the coffee in tanks of clean water in order to skim away any \"floaters\" (over ripe coffee) that were missed. The coffee is depulped, fermented for up to 24 hours in water to break down the fruit mucilage, channel graded and rinsed, and then moved to raised drying beds. \"Channel grading\" is the process of moving the coffee from the fermentation tanks down a series of narrow cement channels that they fill with water, the densest coffee settling on the bottom, while the lighter, lower grades float and continue on down to the end. Amazingly, they are able to separate 5 different grades using this method, A1 being the highest grade and densest beans, which is what this coffee is. ","CuppingNotes":"Macuba has a caramel sweetness in the dry grounds, accented by notes of maple, and Cola soda. I rightfully thought my Full City roast smelled promising for espresso, a fragrance of dark chocolate bar with a layer of dark caramel, and just a hint of fruit. The wet aroma proves to be just as saccharine sweet, with caramel and toffee, maple frosting, and just a slight fruited hint of raisins. Macuba is a sturdy-sweet cup, the light and middle roasts unleash toasted sugar flavors like crisped toffee crust, with a fragrant honey note, and caramely aftertaste of dulce de leche. The acidic impression is crisp and clean in City and City+ roasts, with aspects of brisk tea, along with a juicy note that conjured up images of cherry and raspberry juices. Fruits aren't the focus in the cup though, (it's so much more about sweetness - check out that 9.5!), but in addition to the juicy note that underscores acidity, I catch hints of Thompson raisin, and dried cranberry. Full City roasts are a different cup altogether. The sweetness still has an anchoring presence, but the cooling cup is suffused with milk and dark chocolate flavors, accented by a dark hue of red berry.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"A1","Lot size":"45","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Macuba, Nyamasheke, Western Province","Roast Recommendations":"City to Full City","Type":"Farm Gate"}}
{"Title":"Sulawesi Wet Hulled Enrekang Rodo Rodo","Overview":"Earthy sweetness that's lightly fruited, rustic overtones of rice syrup and palm sugar, hint of banana pudding, melon, herbal indications of dried sage, tobacco, tarragon, and shiso. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/sulawesi-wet-hulled-enrekang-rodo-rodo-7273.html","SKU":"GCX-7273","FarmNotes":"Rodo Rodo is a small village on the slopes of Gunung Latimojong (\"gunung\" means mountain, or hill), which at 3,478 meters, is the highest mountain in Sulawesi. The farms of Rodo Rodo span an altitude range of 1400 to 1800 meters above sea level, and most are planted in Typica, and the Typica hybrid called S795. Rodo Rodo coffee is grown organically, though they have not obtained certification. A big part of their organic farming success is that they are goat herders, not vegetable farmers, which require pesticides. This is a wet hulled coffee, or \"Sumatra Process\" as we often refer to it. The wet hulled process involves removing the outer cherry and only partially drying the coffee before peeling off the parchment and drying the rest of the way. This originated in Sumatra as a means of expediting the trading process and access to cash, coffee was partially processed, traded to \"collectors\" (middle men), then dried the rest of the way. The cup profile this type of process produces is filled with herbal earth and spice flavors, bold low tones, and typically milder acidity. We've been looking to Sulawesi for wet hulled options lately, as they've proved an impressive addition to Sumatra, where the bulk of our inventory comes from. Between a lower defect count to begin with, and the fantastic job by the mill sorting out those defects that make it through by hand and with machinery, the resulting green is more uniform than the majority of wet hulled Sumatras we see (it still has bug holes, mis-shapen/split beans, etc - but a lot nicer than most Sumatras). And if you're interested in trying another wet hulled Sulawesi, we have another very nice example from the other side of Gunung Latimojong, in the neighboring Luwu Regency - Sulawesi Wet Hulled Latimojong. It's quite interesting to try and key in on the subtle flavor differences of these two coffees processed the same way, but from villages on opposites side of the same mountain.*Note: All wet hulled coffees have color variance, withered and bug bitten beans, which do not impact the cup. Learn more about this unique style of processing in our blog post Why You Should Know About Giling Basah.","CuppingNotes":"Rodo Rodo's dry fragrance has smells of rustic natural sugars interspersed with ripe plantain, and the sweetness of tobacco. The wet aroma has a potent herbal overly of fresh stevia, a hint of basil, amidst intense coconut palm sugar and bittering cacao notes. In some ways, Rodo Rodo has the typical markers of a wet hulled coffee; thick body, bittersweetness, and foresty earth tones that bring to mind the coffees of Sumatra. But where I think Rodo Rodo excels is in the high level of sweetness it produces that has a slight fruit flavor to it too. The mix of unrefined, earthy sweetness and fruits bring out flavor elements of brown rice syrup, the rustic overtones of palm sugar, hints of banana pudding and pungent cantaloupe. Herbaceous hints are laced throughout both light and dark roasted brews, and showed indications of dried sage, tobacco, and bittering shiso leaf in the aftertaste. At Full City roast level there's a combination of bittersweet chocolates and raw nuts, that added a flavor profile of dark chocolate macadamia to the earthy undercurrent.","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-18 Screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Typica, S-795","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"17","Packaging":"GrainPro Liner","Processing":"Wet Hulled (Giling Basah)","Recommended for Espresso":"Yes","Region":"Rodo Rodo, Gunung Latimojong, Enrekang","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Sulawesi Wet Hulled Latimojong","Overview":"Litimojong is a high caliber wet hulled coffee, palm and date sugars, rustic earthiness just beneath the surface, intense chocolate roast bittering, herbal aromatics, and a woodsy cedar note. City+ to French. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/sulawesi-wet-hulled-latimojong-7274.html","SKU":"GCX-7274","FarmNotes":"We've been looking to Sulawesi for wet hulled options lately, as they've proved an impressive addition to Sumatra, where the bulk of our inventory comes from. Between a lower defect count to begin with, and the fantastic job by the mill sorting out those defects that make it through by hand and with machinery, the resulting green is much more uniform than the majority of wet hulled Sumatras we see. This coffee comes from a coffee collector who is buying from small holders on the western slopes of Gunung Latimojong (\"gunung\" means mountain, or hill), which at 3,478 meters, is the highest mountain in Sulawesi. The coffee isn't grown that high, but some of the farms do stretch up as high as 1800 meters above sea level (1200 on the low end). \"Collectors\" are coffee middlemen who buy whole cherry or wet parchment from local farmers they are connected with, then sell to buyers like us. It's a long standing system in many parts of Indonesia, and the collectors can be a valuable resource for gaining access to amazing coffees you might not otherwise find. On average, these farmers have .5 to 2 hectares of coffee planted, and are growing S795 (a disease-resistant cultivar, and one of the main cultivars grown in Sulawesi), and older Typica.*Note: All wet hulled coffees have color variance, withered and bug bitten beans, which do not impact the cup. Learn more about this unique style of processing in our blog post Why You Should Know About Giling Basah.","CuppingNotes":"Litimojong is a high caliber wet hulled coffee, and the timing of the arrival is near perfect as our Sumatra inventory has dwindled. It has a very sweet smell of brown sugars, along with a note of cooked squash, that pairs well together. At City+ and Full City, the intense aroma is filled out with brown sugar sweetness, accented by a nice sweet tobacco note that adds interest, along with an underlying earth tone and bittersweetness that signify process method. The cup has a type of nice, rustic sweetness that we often tag as brown rice syrup, or maybe a bit more like palm and date sugars. It's a lingering sweetness that has rustic earthiness just beneath the surface. City roast level is a tad too light for Latimojong. City+ is where you'll find a well rounded sweetness that is offset by a fair amount of chocolate roast bittering, some mild herbal notes that remind me of coffee from Lintong, Sumatra. There's a woodsy quality, like cedar, that adds to the complex aroma and aftertaste. Full City+ roasts dial up the bittersweetness quite a bit, and the brew has a really nice mix of inky body, and flavor profile of smoked dark chocolate, and tarragon accent.","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 16-18 Screen","Arrival date":"May 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"S795, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"40","Packaging":"GrainPro Liner","Processing":"Wet Hulled (Giling Basah)","Recommended for Espresso":"Yes","Region":"Latimojong, Luwu, South Sulawesi","Roast Recommendations":"City+ to French","Type":"Farm Gate"}}
{"Title":"Sumatra Dry Process Kerinci Pendekar","Overview":"Atypical flavor profile for Sumatra, with complex fruit flavors like freeze dried berry, fig jam, date paste, and dried tamarind, with earth toned cocoa, sarsaparilla, creamy body, and aromatic wood note in the finish. City+ to Full City+.","Score":0,"URL":"https://www.sweetmarias.com/sumatra-dry-process-kerinci-pendekar-7374.html","SKU":"GCX-7374","FarmNotes":"This is a dry processed lot, so different than the typical giling basah method and starts with the coffee cherry being thrown straight to the drying beds, fully intact. Because the fruit is still on the seed, the drying time is exponentially longer than when the fruit is removed prior to drying, sometimes taking up to 3 weeks time. During this period, there is a slight fermentation that occurs inside the cherry, and the coffee is turned regularly to keep the coffee drying evenly. The process no doubt influences cup flavors, as you'll likely taste with this coffee, and you can expect fruit flavor notes, mild acidity ,and big body as a result. This coffee comes from a cooperative near Gunung Tujuh, who's members are spread out over the Gunung Tujuh and Kayu Aro highland areas on Mount Kerinci. This coop produces wet hulled, honey/wet hulled (a hybrid process coming later), and fully washed coffees too, some of which we'll have available in the latter part of 2022. The farms in this area are planted in older Typica types, and benefit from the high slopes, situated between 1400 - 1500 meters above sea level.","CuppingNotes":"What an interesting and unique Sumatra cup, the process method bringing out sticky fruit flavors that are very \"dry process\", amidst herbal and earth-toned notes we tend to associate to the Sumatran coffee. The dry fragrance and aroma have a sweetness of palm sugar, with intense bittersweetness, dried date, and a hint of basil too. The cup shows incredible complexity, and an atypical flavor profile for the coffees we're used to tasting from Sumatra! It boasts complex fruit flavors, like freeze dried berries, fig jam, and date paste, along with a root-y sweetness of sarsaparilla. The fruits come up in intensity as the coffee cools, adding some rustic fruits to the list of flavor notes, like dried tamarind, and cherimoya. There's an aromatic wood note in the aroma as well, and rustic cocoa nibs that leave an earth toned bittersweetness in the finish. This is an intense brew with body to match, and while my darkest roast was Full City, I imagine Full City+ will capture quite a bit more of the bittersweet side this coffee is capable of producing with a little less fruit, though I doubt you can roast it out altogether!","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 16-18 Screen","Arrival date":"September 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Ateng, Jember, Tim Tim","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"20","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Region":"Gunung Tujuh and Kayu Aro, Mount Kerinci","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Sumatra Lintong Mutu Batak","Overview":"Earth-toned sweetness, rustic date and palm sugars, pungent bittersweetness, raw cacao, sharp tobacco, peat/scotch aromatic accent, inky thick body, licorice hint. City+ to French. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/sumatra-lintong-mutu-batak-7300.html","SKU":"GCX-7300","FarmNotes":"\"Mutu Batak\" comes from the growing region of Lintong in Northern Sumatra near the shores of Lake Toba. Lintong coffees are from Sumatra, the island that is politically and geographically part of Indonesia. Lintong Nihota is the town that has become synonymous with the entire southern part of Lake Toba area. Lake Toba defines the landscape of the area, the largest volcanic crater lake in the world, and the result of the largest volcanic event on earth in the last 25 million years! It is huge, and the coffees from the north and eastern shores are quite different from the Lintong coffees. Lintong coffees are farmed by the Batak peoples that are the indigenous tribe that works the coffee in this area. This coffee is part of a somewhat unlikely joint venture between a Costa Rican farmer and an Indonesian coffee exporter. Together, they see to it that the coffee is carefully selected and separated by quality, then double hand-picked during the milling process. This coffee works at a wide range of roasts, with bittersweetness and the complex forest and herbal notes of the Lintong terroir. It might go against common sense, but I find Sumatra's like this more complex in the lighter roasts than in the usual darker roasts they receive (no lighter than City+). The main reason is that many commercial roasters use color and surface texture as indicators of roast level. They roast coffee until the bean looks attractive. With a Sumatra like this, you will mostly likely hit 2nd crack at the point where the surface texture and variegated bean color evens out, and (I think) you may have gone too far at that point. This is a Sumatran coffee, meaning you should expect damage like insect holes, broken beans, and more. That said, this is much cleaner prep than your average Gr.1 Mandheling, which is not only visually noticeable, but has a positive impact on cup quality too. *Note: All wet hulled coffees have color variance, withered and bug bitten beans, which do not impact the cup. Learn more about this unique style of processing in our blog post Why You Should Know About Giling Basah.","CuppingNotes":"Mutu Batak is a potent smelling coffee, earthy and with a rustic-tinged sweetness from front to back. The dry grounds give off sweet caramel notes, a pipe tobacco accent, and a savory umami hint. The wet aroma is marked by smells I tend to associate with Lintong coffee, rustic palm sugar and some green mossy hints, along with an intense bittersweetness that pulls all the outlier aspects closer to the ground. City+ and Full City roasts have plenty of earth appeal, pungent date and palm sugar-like sweetness, contemplative earth tones, and indications of peat/scotch and sharp tobacco mark the aroma and finish. Bittering cacao gains momentum as the coffee cools down, and is especially the case in Full City/Full City+ roasts, which I fully endorse. Some of that earth toned sweetness is still very much present with 2nd snaps, adding some interest to the opaque roast tones, and an accent of licorice root marks the aftertaste. We recommend letting this coffee rest for at least 24 hours, if not 48.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 17-19 Screen","Arrival date":"June 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Typica, Jember, S-795, Lini-S","Drying Method":"Patio Sun-Dried","Grade":"Grade 1","Lot size":"50","Packaging":"GrainPro Liner","Processing":"Wet Hulled (Giling Basah)","Recommended for Espresso":"Yes","Region":"Lintong Nihuta","Roast Recommendations":"City+ to French"}}
{"Title":"Sumatra Lintong Pak Joner","Overview":"Complex earth tones and intense bittersweetness of high % cacao bar and bakers chocolate, accents of rustic palm sugar, peat-like scotch note, tobacco, leathery sweetness, aromatic cedar, and an orange oil hint. City+ to French.","Score":0,"URL":"https://www.sweetmarias.com/sumatra-lintong-pak-joner-7288.html","SKU":"GCX-7288","FarmNotes":"Lintong Nihota is the town that has become synonymous with the entire southern part of Lake Toba area, and most of the coffee from the southern shores are sold as such. Lake Toba defines the landscape of the area, the largest volcanic crater lake in the world, and the result of the largest volcanic event on earth in the last 25 million years! It is huge, and the coffees from the north and eastern shores are quite different from the Lintong coffees. This lot is from one coffee collector known tersely as Joner. I met him several times and his dry mill was one of the larger and more professional (and cleaner) operations in the area. In a system where farmers sell to local collector, much rides on the long-standing relationships between the two parties, and the collector is really the key person to determine coffee quality. A good collector buys coffees direct, as Joner does, rather than in the local village coffee markets where quality is low, the wet processing of the coffees is haphazard, and everything gets mixed together. This coffee is a special preparation: It is prepared by density at Joner's mills, then it is density sorted once again and hand-sorted in Medan once again before export. The screen size is 17 1/64ths and up, the largest bean size offered, and tends to command a higher price. Though not necessarily a correlate to quality, we were really impressed with this large bean separation. The Sumatra harvest was relatively small, which means coffee is more expensive, but also there's just a lot less high quality coffee available. This made tasting the sample from Joner all the more sweet and buying decision a no-brainer!*Note: All wet hulled coffees have color variance, withered and bug bitten beans, which do not impact the cup. Learn more about this unique style of processing in our blog post Why You Should Know About Giling Basah.","CuppingNotes":"The dry fragrance has an unrefined sweetness, and forest smells lead to fresh and dried herbals in aroma. Adding hot water lifts intense bittersweetness in the steam, like high cocoa solids chocolate and baking cocoa, with some green herbal notes, and understated note of brown rice syrup. The cup has a nice bittersweetness in medium and dark roasts, convincing dark chocolates that have a pleasant bittering quality, and are accented by rustic palm sugar, and orange oil hint that adds an acidic impression to the profile. The aroma is marked by earthy peat, like an aged single malt scotch. The coffee cools to a complex array of flavor and aroma that are uniquely Sumatran; leathery sweetness, tobacco, shiso leaf, and aromatic cedar. Full City roast levels promise a chocolate-laden brew, with more rustic sweetness underneath, and finishes with aromatic foresty notes, cedar, and raw cacao nibs in the long aftertaste. This Sumatra makes an interesting, and intense espresso shot as well, but perhaps best in a blend rather than as single origin espresso.","Images":null,"AdditionalAttributes":{"Appearance":"1+ d/300gr, 17+ screen - expect some broca damage, split beans, quakers...typical of Sumatran coffee","Arrival date":"June 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Ateng, Bergendal, TimTim","Drying Method":"Patio Sun-dried","Grade":"Grade 1","Lot size":"50","Packaging":"GrainPro Liner","Processing":"Wet Hulled (Giling Basah)","Recommended for Espresso":"Yes","Region":"Lintong Nihota","Roast Recommendations":"City+ to French"}}
{"Title":"Sweet Maria's Decaf Espresso \"Donkey\" Blend","Overview":"Fruited cup profile, some sweet bright accents, medium body. FC+ to a light Vienna is recommended.","Score":0,"URL":"https://www.sweetmarias.com/sweet-maria-s-decaf-espresso-donkey-blend.html","SKU":"GCX-2656","FarmNotes":"People have requested that we offer a pre-blended espresso, a decaf counterpart to the Espresso Monkey blend. Working under the codename of the \"Donkey Blend\" (don't ask how all these ridiculous names started ---I think it was George's fault) we came up with this. It is intended to be used several ways. As an all-decaf espresso blend I wanted it to work well under a wide variety of roasting conditions, in terms of both lighter Northern Italian type espresso roasts (the equivalent of a Full City to Vienna Roast) and the darker Southern Italian type roast (roasted to a French roast). I also wanted a good espresso from both air and drum roasters, and I wanted good crema. This is a lot to ask from a decaf, but I think this blend works very well. While origin tastes are muted in decafs, I think the bittersweet roast tastes from this blend are very good. My second focus was having the blend not have too much character so that it can be used as a base blend for a \"low-caf\" espresso. This means it should work well as 50-75% of your blend where you add other caffeinated coffees to give more aromatics and flavor: my choice would be a Ethiopian Harar, or a Central American (see our Blending Basics article for more). Why do we call this Donkey Blend? Frankly, I can't remember .. it just is...","CuppingNotes":"People have requested that we offer a pre-blended espresso, a decaf counterpart to the Espresso Monkey blend. Working under the codename of the \"Donkey Blend\" (don't ask how all these ridiculous names started ---I think it was George's fault) we came up with this. It is intended to be used several ways. As an all-decaf espresso blend I wanted it to work well under a wide variety of roasting conditions, in terms of both lighter Northern Italian type espresso roasts (the equivalent of a Full City to Vienna Roast) and the darker Southern Italian type roast (roasted to a French roast). I also wanted a good espresso from both air and drum roasters, and I wanted good crema. This is a lot to ask from a decaf, but I think this blend works very well. While origin tastes are muted in decafs, I think the bittersweet roast tastes from this blend are very good. My second focus was having the blend not have too much character so that it can be used as a base blend for a \"low-caf\" espresso. This means it should work well as 50-75% of your blend where you add other caffeinated coffees to give more aromatics and flavor: my choice would be a Ethiopian Harar, or a Central American (see our Blending Basics article for more). Why do we call this Donkey Blend? Frankly, I can't remember .. it just is...","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 16/17 scr","Arrival date":"All current-new crop","Cultivar Detail":"Varies","Grade":"Top Grades","Packaging":"GrainPro Liner","Processing":"Varies","Recommended for Espresso":"Yes","Roast Recommendations":"As with all decafs, remember they roast faster and have the propensity to get away from you and end up darker than you expected. So attend to the roaster and stop the roast manually if possible to get it just right. Roast preference with espresso is up to you. I personally prefer the lighter N. Italian roast -just a bit more than a Full City.","Type":"Decaf, Sweet Maria's Blends"}}
{"Title":"Sweet Maria's Espresso Monkey Blend","Overview":"We blend this for body, balanced between high and low tones, fruited-chocolate roast flavors, and slightly rustic fruited accent notes. Our roast goal is in the beginning stages of 2nd crack ... we never \"let it roll\", so we recommend FC+ to light Vienna roast.","Score":0,"URL":"https://www.sweetmarias.com/sweet-maria-s-espresso-monkey-blend.html","SKU":"GCX-2653","FarmNotes":"A longtime favorite espresso blend intended solely for pump and piston type espresso extraction. This is a sweet but punchy little cup, and roasted fairly light it is a shock to the palette, but has great body and a smooth, sweet, stunning aftertaste. The joke behind the name: I imagine a fancy roaster charming a client in the cupping room, effusing about their \"Master Roaster\" and \"Master Blender\" and \"Master Cupper\", all in the trade for decades of course. Then I imagine the scene in their warehouse where hired apes rip open bags of green coffee and randomly hurl handfulls into the hopper for roasting. In other words, there's a lot of BS in the coffee trade, and blending is NOT really a noble art ...it's done to save cost and disguise coffee defects 80% of the time. The Irony? I have never worked so hard to develop a blend as this one, designed to cup well at a full range of \"espresso\" roasts, and developed as a pre-blend (all coffees roasted together to same degree of roast). Am I going to tell you exactly what is in it? No! I am feeling a bit snobby today! Espresso Monkey has become our signature blend for some reason or other, perhaps because it is a true standard that we have sought to maintain for so long, and that we put such nice coffees into it.","CuppingNotes":"We blend this for body, balanced between high and low tones, chocolate roast flavors, and slightly rustic fruited accent notes. Those are our goals, that is the \"spirit\" behind the blend, and we check it to make sure it meets those targets. This blend has historically been geared toward Full City to Full City+, without letting 2nd crack \"roll\" too long. The current ingredients include some dry process coffee from Africa and South America, which lend to big body and some fruited cup characteristics. There's also a nominal amount of a washed Central American coffee that helps round out the sweetness in the cup or shot.","Images":null,"AdditionalAttributes":{"Appearance":"15-18 screen","Arrival date":"All current-new crop","Bag size":"n/a","Cultivar Detail":"Varies","Drying Method":"Patio and Raised Bed Sun-Dried","Grade":"Top Grade","Lot size":"n/a","Packaging":"GrainPro Liner","Processing":"Wet and Dry Process","Recommended for Espresso":"Yes","Region":"Africa, South America, Central America","Roast Recommendations":"I like this blend best when the roast is stopped just as second crack becomes rapid, and shows no sign of slowing down. Actually, I like it a lot lighter than that too! I don't like this roasted to a dark, dark roast stage, Full French or Italian. This is because Brazilian coffees become ashy and began to bitter when roasted extremely dark. I believe strongly in a 36+ hour resting period before use for espresso extraction! It wont kill you to use it sooner... but you might notice sharp unpleasant notes.","Type":"Sweet Maria's Blends"}}
{"Title":"Sweet Maria's French Roast Blend ","Overview":"Designed to endure the rigors of dark roasting, and produce excellent pungent tastes, attractive bittersweet/carbony flavors, and great body.","Score":0,"URL":"https://www.sweetmarias.com/sweet-maria-s-french-roast-blend.html","SKU":"GCX-2657","FarmNotes":"NULL","CuppingNotes":"This is my favorite blend designed to endure the rigors of dark roasting, and produce excellent pungent tastes, attractive bittersweet/carbony flavors, and great body. Body is so important to a darker roast. Extended roasts incinerate body, and a thin cup of burned water IS NOT what French Roast coffee is about! You do not want to fully burn up all the sugars, you want some degree of bittersweet, overlayed on the carbony charcoal tones of the burned woody structure of the bean itself. You want something still voluminous, and something sharp that stings you a bit down the center of the tongue. Well, at least if you do want these things, then we share common ground, and you might like my blend. Please note that we made changes to improve the blend. I have changed the percentages and added a new coffee that became available that really enhances the chocolatiness in the Vienna stage, and the pungency in the darker French stage","Images":null,"AdditionalAttributes":{"Appearance":"16 to 18 screen","Arrival date":"All current-new crop","Cultivar Detail":"Varietal Blend","Drying Method":"Sun- and Machine-dried","Grade":"Top Grade","Packaging":"Other","Processing":"Varies","Recommended for Espresso":"Yes","Roast Recommendations":"I like this blend best roasted to the point where 2nd crack slows, but has not yet ended. Roast to the absolute end of 2nd crack, and you might as well be drinking roasted radish. I believe strongly in a 24 hour resting period for darker roasts."}}
{"Title":"Sweet Maria's Liquid Amber Espresso Blend","Overview":"A potent, pungent blend for espresso beverages. It's ideal for milk drinks, as this intense bittersweet cuts through the steamed milk. Caramel sweetness that turns pleasingly pungent with 2nd snaps, spice, cacao and semi-sweet chocolates, savory notes, long aftertaste. Monsooned coffee and a small percentage of Robusta add crema and body. Full City+ to Vienna roast.  ","Score":0,"URL":"https://www.sweetmarias.com/sweet-maria-s-liquid-amber-espresso-blend.html","SKU":"GCX-2655","FarmNotes":"I wanted an espresso blend that was potent, sharp, intense enough in flavor to cut through steamed milk, but clean enough in flavor profile to work as a straight espresso shot. I wanted it also to be complex and hint at all of those tastes, and more. Here's the product of a lot of overly-caffeinated days of experimentation: the Liquid Amber Espresso Blend. It is named for the rich color and multitude of crema it produces. The blend was fairly complex to come up with ... after I found the general tastes I wanted, emerging from aroma and first sip through the very long aftertaste (if I don't cleanse my palate with water I will taste this coffee for a very......long.....time) I needed to play with the exact percentages. The specific blend, hey ... it is my secret! But I will tell you that the 5 coffees that really worked toward the flavor goal I imagined ended up surprising even me! We've refined the recipe over the year, and at the moment, there's a washed Central, wet-hulled Indonesia, a monsooned coffee, and even a modicum of quality Robusta. And to keep this a mystery, the blend contains some coffees not on our list. I admit this is a pretty wacky blend by the current fashion in espresso toward lighter-roasted and acidic coffees; it's downright dated really. But it works in its own way. Some emphasis here is on the physical character of the espresso, hence the use of the monsooned coffee, which has properties in terms of crema that no other coffee possesses. Even in cupping the dynamics of the foam/bubbles are clearly different from other coffees due to the changes in the bean from the monsoon processing technique. A note on visual grade - the defect count will vary, but our \"1 full defect per 300g\" is us being on the safe side since the Monsoon coffee can have bug holes. That said, we buy the best visual and cup grade available (and we'll let it run out of stock rather than buy sub par product!) and this should not affect flavor.","CuppingNotes":"Extracted in a properly functioning, clean espresso machine the blend produces a lot of crema, making the mouthfeel very thick and creamy. The sharp pungent bite to the blend has a pleasant bitterness to it, like roasted cacao nibs, and fades into a rich aftertaste of dark and semi-sweetened chocolates. If properly roasted (not scorched) the blend will not be ashy, something I really don't like in espresso. (With any espresso, if the aftertaste turns acrid and bitter after 3 minutes or so, your espresso machine may be overdue for a backflush!) We're using a fresh Costa Rica ingredient this time around that brings a nice level of sweetness to the blend. Short and long shots show hints of fruit, sweet smoke, caramel, umami, and cream in the extended aftertaste. This blend works extremely well in milk drinks, meaning by that a true cappuccino (6-9 oz.) or machiatto. I make no claims for Latte ... is there any coffee that tastes potent mixed down 8:1 in a Slurpee-sized cup of milk? Liquid Amber Note: If the coffee arrives and doesn't appear evenly blended, this is because of the vibration during loading and shipment. I can positively guarantee you that the blend was packed in the exact, correct proportion (we are extremely careful about this), but the difference in size/density of the Monsooned/non-Monsooned can make them separate a bit with vibration. Just give it a stir....","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 17-19 Screen - defect count will vary, but we're being on the safe side since the Monsoon coffee can have bug holes. That said, we buy the best visual and cup grade we can and this should not have an affect on flavor.","Cultivar Detail":"Varies","Processing":"Varies","Recommended for Espresso":"Yes","Roast Recommendations":"I advocate a Northern Italian style roast (lighter espresso roast, really a Vienna roast, stopped 30-45 seconds into 2nd crack), but the blend works very well at the darker Southern Italian style roast (a full French roast actually, at the peak of a rapid 2nd crack). Either way, get this into 2nd crack and allow proper resting that espresso demands: 48+ hours is best. This blend works great in air and drum roast machines and I developed it test-roasting on both. If you notice a tingly \"baking soda effect\" in your mouth, then the coffee could use more rest.","Type":"Sweet Maria's Blends"}}
{"Title":"Sweet Maria's New Classic Espresso","Overview":"A classic, balanced espresso, but without the baggage of the old world espresso conventions ...and without robusta! The espresso has balanced bittersweet notes, thick and opaque body, almond and chocolate roast flavors, hints of spiced fruit in aroma. Full City+ and beyond.","Score":0,"URL":"https://www.sweetmarias.com/sweet-maria-s-new-classic-espresso.html","SKU":"GCX-2933","FarmNotes":"Once there was \"Classic Italian,\" our espresso blend to set the benchmark for traditional European-style espresso. It was a blend based on quality Brazil coffees, with a touch of aromatic Central American coffee to add a grace note to the cup, and it had a small percentage of premium robusta in it for crema, mouthfeel, and to add traditional flavors found on the continent. But times change and tastes change. Espresso culture is much less Euro-centric, and for good reason. While Italy gave us espresso, the general quality of your average espresso there can be quite poor. Don't even talk about coffee in France. The big brands in Europe are largely run by multi-nationals who keep a close watch on price, and gleefully buy lower quality green coffee if they can save .01 Euro. The privates follow suit, in order to compete. Of course, there are many exceptions, but the darker roast styles, well into 2nd crack, to cover up the use of low quality green coffee ... well, that is NOT something to emulate. For Sweet Maria's, espresso has never been our \"dumping ground\" for coffees we can't sell, old lots, or ones with mild defect. It's been a program where we have dedicated time, focus in cupping, and roast testing. With this in mind, we want to start over again, and offer New Classic, a somewhat silly name, an oxymoron, and overused ... but it says what I want it to say: Here is the new benchmark espresso with sweet-bittersweet balance, body, crema, and finesse, the core definition of the espresso beverage, and defines it in the established West Coast espresso style (clean, bright notes) without the burden of European espresso conventions. In other words, no robusta! Oh, and No obsessive interest in crema! (You can produce buckets of crema in espresso and still have a very mediocre-tasting cup. What ... do you make espresso just to look at the beautiful crema? No dummy, you make it to drink it!). New Classic generally involves Brazil as one of the base ingredients, with washed Centrals and South American coffees bolstering sweetness, and of course, chocolate roast tone. Blend ingredients will change with what's in season, but we always shoot for flavor continuity.","CuppingNotes":"While this blend is designed primarily for a lighter roast, stopping the roast before 2nd crack, it also works well with a darker roast treatment. It does not have the extreme brightness that have been the trademark of some of our Espresso Workshop blends; it is a bit more restrained in it's overall demeanor. The cup has a balance between sweet and bittersweet flavors, moderate bright accent, soft traces of fruit, body and depth. The lighter roasts have a very sweet aromatic, fruited with plum and a hint of spice (cinnamon stick, cardamom). Darker roasts tend toward chocolate laced with dark fruit tones, in both aroma and cup flavor. Both have a firm, opaque body, with toasted almond roast notes as the espresso cools. In the aftertaste, peach tea flavor (and it light roasts a bit of jasmine tea) are evident. Of course, results vary with how the espresso machine and grinder are set up. We use 8.5 bars of pressure at the head, with 202 degrees water temperature (measured at the head) to start, dropping to about 198. At higher temperatures, it's a more aggressive espresso with a bittersweet edge and well-suited to milk drinks.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-18 Screen","Cultivar Detail":"Varies","Grade":"Top Grade","Processing":"Varies","Roast Recommendations":"We recommend a range of roasts from FC, FC+ to light Vienna. That means just ending the roast just before 2nd crack (FC), a few snaps into 2nd crack (FC+), or as second crack begins to gain some momentum (Vienna)","Type":"Sweet Maria's Blends"}}
{"Title":"Sweet Maria's Moka Kadir Blend","Overview":"The all dry process Moka Kadir blend offers an underpinning of rich chocolate low tones, rustic palm sugar-type sweetness, earthy dried fruits, velvety mouthfeel, and finishing hints that are leathery, herbal, fruited, and of course bittersweet. Full City+ to Vienna. Good for espresso. ","Score":0,"URL":"https://www.sweetmarias.com/sweet-marias-moka-kadir-blend-4463.html","SKU":"GCX-4463","FarmNotes":"Moka Kadir is a staple on our list most of the year, and with Yemeni coffees back in stock, it makes a triumphant return. The components are all dry-processed coffees from Yemen, Ethiopia and small amount of Brazilian coffee. Between these three, we find an espresso on the rustic and exotic side, some fruit-forward character and earth-toned bittersweetness in full effect. It's great as espresso in the Full City+ to Vienna roast territory, and the mix of dry process coffees handle well in the roaster, regardless of the difference in density when sticking to the recommended roast range. Full City roasts may show some variance, and I recommend taking your roasts closer to Full City+ development which will help afford roast evenness. Slowly ramping up the heat will also help in this effort if your roaster has manual heat control. For those without (like a popper for example), try slowing your roast by slightly overloading the chamber and I wouldn't stop the roast development until you're on the heels of 2nd snaps. (I \"overload\" the roast chamber by first turning the popper on, then adding coffee until just after it stops moving - it should only take a few seconds to get the coffee moving again). A balance of sweet and bittersweet flavors are achieved with rustic layers woven in both fruited and earthy. Moka Kadir has incredibly velvety body too that works very well in milk drinks.","CuppingNotes":"The dry fragrance of Full City+ roasts has a strong rustic sweetness like palm and date sugars, along with smokey cocoa, and a sweet fruited underlay. The wet aroma sticks close to this, fruited sweetness building in the steam, and pungent bittersweetness is strengthened as well. The cup is the culmination of all the intense aromatics, and more. Dense, thick body adds to the sense of an almost chewy cup character! Full City+ roasts show a bittersweetness of smoky cacao nib and mesquite notes, offset by sweet molasses and chocolate syrup, that all do well to ground the wilder cup characteristics. Espresso is where this blend really shows best, with an underpinning of rich chocolate layers, high % cacao up front, roasted nibs in the middle, and an unsweetened baking type chocolate flavor that lingers long into the finish. Dried fruit notes are played up in the cup, due in large part to the Ethiopian component that finds footing in the flavor profile. Notes of slab apricot and plum offer fruited counterpoints to the bold, bittersweet low tones, and are distilled down to an opaque fruited chocolate flavor. The top notes in the finish are leathery, herbal, fruited, earthy, and of course, bittersweet. The mouthfeel of Full City+ and Vienna roasts as espresso is velvety, and offers a delicious espresso base for milk drinks. Moka Kadir is made up of all dry process ingredients, so you can expect quite a bit of chaff during roasting. It seems to really benefit from an extra day of rest too, which allows some of the more disparate flavors to come together. Try degassing for 48 hours before drinking if you can wait...3+ days even with Full City+ roasts.","Images":null,"AdditionalAttributes":{"Appearance":"1d/300gr, 15+ screen - expect a few quaker beans in the roasted coffee, to be expected from dry process coffee, especially the Yemeni ingredient","Arrival date":"All current crop coffee","Bag size":"n/a","Cultivar Detail":"Bourbon, Catuaí, Mokha, Heirloom Cultivars","Drying Method":"Patio Sun-dried \u0026 Raised Bed Sun-dried","Grade":"Top Grades","Lot size":"n/a","Packaging":"GrainPro liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Yemen, Ethiopia, Brazil","Roast Recommendations":"Full City+ to Vienna","Type":"Sweet Maria's Blends"}}
{"Title":"Tanzania Mbamba Namku AA","Overview":"An underlying flavor of burnt sugars is accented by orange spice and cinnamon stick hints, candied citrus peel flavor that informs acidic impression, and wraps up with raspberry black tea in the finish. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/tanzania-mbamba-namku-aa-7211.html","SKU":"GCX-7211","FarmNotes":"We have offered Tanzania coffees from the northern and southern areas, depending on weather patterns in the year, the chronic water problems in Tanzania, and the transportation issues to get the coffee out of the country without damaging it! I feel that, as far as Tanzania goes, you have to remain open-minded and flexible as to where the best coffee lots can originate due to all these factors. Here we found a nice lot from the Mbamba Bay area in the south, on the shores of Lake Malawi in what is known as the Mbinga district. Coffees in the south have some advantages of better drying conditions and better access to transportation. Namku is a newer cooperative in this region (coops are called \"AMCOS\", or Agricultural Marketing Cooperative Society), and currently serves almost 350 small farmers in Mbamba highlands. Altitude at the processing site is 1650 meters above sea level. Like Kenya, the top grade coffees of Tanzanian coffee are separated by size, AA being the largest, measuring 17/64ths to 19/64ths of an inch. We found this lot offered some delicate complexity in the cup, accompanied by a well-developed sweetness at a fairly wide roast range. We also bought the peaberry selection from Namku AMCOS, which we will make available later in the Summer.","CuppingNotes":"The sweetness in the dry fragrance has a nice potency at City roast level, raw brown sugars, interspersed with dried lemon peel, and a sweet berry hint. Clean raw sugars are at the forefront of our notes on wet aroma, accompanied by hints of fruit, and a little malt powder too. I thought City roasts smelled a little like apple pie filling made from apples and brown sugar. The cup has a nice underlying flavor of burnt sugars, accented by orange spice and cinnamon stick, and a candied citrus peel note that probably informed my 'citric' note when commenting on acidic impression. Speaking of which, Namku has a nice level of supporting acidity, but it's not screaming bright like coffee from neighboring Kenya, and much more integrated into the cup sweetness. The finish has a leafy black tea note that underscores a tannic aspect, and pairs nicely with red berry, bringing about a flavor profile of red raspberry tea. While sweetness is maintained at Full City, I wouldn't take Namku AA into 2nd cracks. It just seems to erase the subtleties found in lighter roasts that I'm most fond of.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 17-19 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Bourbon","Drying Method":"Raised Bed Sun-Dried","Grade":"AA","Lot size":"30","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Mbamba Bay, Mbinga","Roast Recommendations":"City to Full City"}}
{"Title":"Tanzania Sepukila Cooperative AB","Overview":"Lovely balance of acidity and sweetness that opens up to include flavors of turbinado and sucanat, dried date pieces, a cinnamon stick aromatic accent, hints of lemon juice, and a candied lemon peel bite. City to Full City.","Score":0,"URL":"https://www.sweetmarias.com/tanzania-sepukila-cooperative-ab-7212.html","SKU":"GCX-7212","FarmNotes":"This coffee is from the Sepukila coffee cooperative society in Tanzania's southern Ruvuma region, Mbinga District, not far off the eastern shores of Lake Malawi. The cooperative currently has just over 200 farmer members, and organizes the coffee deliveries, processing everything at their local wet mill, and then marketing to for export. One challenge the coop faces each year is patio space during the peak of the harvest, and this year, they plan to reinvest profits into building more beds. The farms at Sepukila are planted above 1350 meters, and the Kent variety is widespread, a cultivar with some resistance to leaf rust, and thought to be of Bourbon lineage. I was surprised to find that some of the farms are less than 1500 meters due to the fact that this coffee has well pronounced acidity when roasted light. Lower grown coffee can be softer, less dense, and that lack of density can mean lower potential for sweetness and acidity. That just isn't the case with this coffee! ","CuppingNotes":"The dry fragrance has a simple, but very nice sweetness of raw sugars, mild baking spices, and a sweetened dried fruit hint. The wet ground open up the profile to include more defined fruit and spice notes, like dried plum dusted in all-spice, still with a nice supporting sweetness underneath. The levels of acidity and sweetness are two of the first characteristics I noted when tasting this coffee, that on their own, construct a really nice, bright East African coffee. As the coffee cools off a little, those two dimensions open up to flavors of minimally processed sugars like turbinado and sucanat, dried date pieces, and a cinnamon stick aromatic accent. The acidity has a citric bite that hints at lemon juice, with some candied lemon peel too that adds to the aromatic profile. Darker fruit accents are trumped up with deeper roast development, though never quite overtake Sepukila's raw sugary sweetness. A very versatile and delicious East African coffee.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Kent","Drying Method":"Raised Bed Sun-Dried","Grade":"AB","Lot size":"39","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Region":"Ruvuma, Mbinga","Roast Recommendations":"City to Full City"}}
{"Title":"Timor Leste Dry Process Daurfusu","Overview":"A wild and wooly cup profile both fruited and sweet, flavors of fermented apple cider, mango puree, earth-toned date, Bartlett pear with some pear skin bittering, and body so thick you could stand a cupping spoon in it! City to Full City+.","Score":0,"URL":"https://www.sweetmarias.com/timor-leste-dry-process-daurfusu-7203.html","SKU":"GCX-7203","FarmNotes":"You may recognize this coffee name from previous years, and it's from many of the same small holders in this region. The biggest difference with this year's coffee is that the farmers are delivering whole coffee cherry to a central processing station instead of managing the wet processing individually at home. The cherry collection and new wet mill where the coffee is handled is run by the same Farmpro group who we've bought Timor Leste coffee from the last few years, and they only continue to refine their process. The Daurfusu wet mill is located in Dukurai village, Letefoho District. Initially comprised of 37 members in Dukurai, the operation has cast a wider net this year and is buying coffee from neighboring high altitude zones as well. Farmers in this area are growing a mix of cultivars, mostly Timor Hybrid and Typica, at altitudes of 1400 to 1600 meters above sea level. This is a dry process coffee, meaning the whole coffee cherry is laid to dry without any removal of the fruit. The dry times are quite long with all that wet, organic mass, usually upwards of 3-4 weeks time. The fermentation that occurs inside the cherry often leads to a fruity cup profile, bigger body, and muted acidity. The results can be wildly different than a wet processed batch from the same farm or station, and in this case, we have a correlate from Daurfusu to compare with! It's a unique opportunity to taste just how profound an impact processing can have on the final cup profile.","CuppingNotes":"The dry process lot from Daurfusu has a rustic layer of cooked fruit in the smells, something like warm apple sauce with cinnamon, amidst bittering cocoa, and a pistachio/green nut note. Aromatically speaking, adding hot water to the grounds only enhances the aspects found in the dry fragrance. The cooked fruits really come out in this context, with some herbal accents shadowing the fruited sweetness, along with a winey scent of honey mead. The cup sweetness is pretty wild with fruit flavors, apple topping at the top of the list for me, a little winey, like fermented cider. The profile opens up to include notes of mango puree, earth toned date, Bartlett pear, and a little pear skin bittering is also in the finish. The acidity level is fairly quiet, which doesn't always bode well for the wild and wooly type naturals like this one. But Daurfusu puts up high numbers in sweetness and body, which really helps to stabilize the fruity cup character. Full City+ roasting tames the fruits significantly, building out an incredibly bittersweet base flavor, with dark plum, and date notes, and body so thick you could stand a cupping spoon in it!","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-17 screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Timor Hybrid, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"55","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Region":"Dukarai, Letefoho","Roast Recommendations":"City to Full City+","Type":"Farm Gate"}}
{"Title":"Timor Leste Dry Process Lulirema","Overview":"Fruited and earth-toned sweetness, notes of strawberry milk powder, cooked rhubarb, coconut palm sugar, dark corn syrup, fig, and rustic chocolate when roasted dark. Incredible body to boot. City+ to Full City+.","Score":0,"URL":"https://www.sweetmarias.com/timor-leste-dry-process-lulirema-7204.html","SKU":"GCX-7204","FarmNotes":"The Lulirema processing station is located in Hatolia, between Ermera and Letefoho, two other growing regions we've purchased coffee from in the past. The Letefoho site lacks water access, and as a result, only produce honey and dry process coffees, which don't require wet milling machinery. They are buying coffee cherry from smallholders in a few of the nearby villages, mainly Manusae, Koliate, and Talo. The altitude varies in these towns, from around 1,400 meters above sea level on the low side, all the way up to 1,700 meters. Farmers in these regions tend to grow mostly the disease-resistant, high yielding Timor Hybrid, along with older Typica trees. Unlike some of the other Timor Leste lots to come, that are all home processed coffees that have been mixed together, Lulirama is a centrally processed coffee lot. This means they purchase the coffee cherry from farmers and then manage the post harvest processing themselves. It is run by the same Farmpro group who we've bought Timor Leste coffee from the last few years, including the Daurfusu lots also available right now.","CuppingNotes":"A deep, rustic sweetness runs through the dry fragrance and brewed coffee of both City+, and a much darker Full City roast. The fragrance may be wild in terms of fruit, but holds steadfast underlying sweetness that balances the scales. The wet aroma has a sweet smell of warm holiday fruitcake, with brown sugar and cinnamon, and candied fruits on top. The Full City roast produced much more chocolate appeal than City+, but sweet and slightly fruited nonetheless. The cup is fruit-forward compared to our other Timor Leste coffees, with earth-tinged sweetness, and very nice body to help carry the complex assemblage of flavors into a long aftertaste. A sweet strawberry note comes up in the profile of City+ roasts, with a tart element that signals fresh fruit, though shadowed by a milk powder-like aspect that brought to mind freeze dried berries. I also pick up on a stalky sweetness like cooked, sweetened rhubarb, replete with a tangy quality that enhances acidic impression. Other flavors I jotted down in my notes are coconut palm sugar, dark corn syrup, and fig. Full City roasts still carry a dark fruited hue beneath the intense chocolate roast flavors, and are more centered around complex bittersweetness, rustic chocolates, and inky, thick body. ","Images":null,"AdditionalAttributes":{"Appearance":".8 d/300gr, 15-18 Screen - a few partial quakers, but nothing too egregious","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Typica, Timor Hybrid","Drying Method":"Raised Bed Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"18","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Region":"Hatolia, Ermera","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Timor Leste Lekisala","Overview":"Caramel sweetness consolidates nicely with a flavor profile of Hershey's chocolate bar and cocoa rice crispies, with mild green apple acidic impression. Versatile and balanced! City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/timor-leste-lekisala-7208.html","SKU":"GCX-7208","FarmNotes":"Lekisala is the name of the small community where this coffee is from. This past year the buying operation covered 30 farmers from this community, buying mostly fully washed, wet process coffees, but also whole coffee cherry as well. They are a part of the village Eaulo, and most of the coffee is situated in the valley separating the districts of Ermera and Aileu. Elevation spans a range of 1400 to 1800 meters above sea level. Typical cultivars you see in this are are Timor Hybrid and Typica types, grown under natural shade of the local casuarina trees, which also act as a source of nitrogen for the coffee crops (what's often referred to as a \"nitrogen fixer\"). The farms represented in these lots are typically very small, and processing tends to be a bit rustic in terms of the local made wooden machinery used to depulp coffee, and drying on tarps. But the flavors are anything but rustic, a testament to the level of scrutiny and quality control implemented during post harvest processing. Timor Leste (East Timor) has become a fairly consistent source of balanced, clean coffees for us. In terms of flavors we taste, we think they slot in next to wet process Java and Sulawesi, all of which are sound alternatives to washed Central American coffees.","CuppingNotes":"I'm really enjoying my City+ roast of Lekisala. Pourover brews yield a moderate level of acidity that add a pleasant sheen to the cup. Like our other wet process coffees from Timor Leste, we find that they satiate our taste for balanced bittersweetness and roast versatility, much like a balanced coffee from Central American does. If those are your preference, Lekisala ought to be on your shopping list! At City+, caramel sweetness and vanilla consolidate nicely with a flavor profile of Hershey's chocolate bar, and cocoa 'rice crispies'. The acidic impression is brought out most in light roasts, but can be tamed quite a bit by taking to Full City territory and beyond. A mild green apple flavor note is laced into the bittersweetness at City+, underscoring some malic vibrance that adds to the unique cup. Lekisala is extremely versatile in the roaster too, and Full City+ is certainly on the table. That's where you'll find creamy texture and a complex raw cacao nib notes, that also makes an excellent choice for chocolatey espresso. Allowing the darker roasts to rest for a couple of days before drinking will benefit balance, giving the flavor profile time to coalesce.","Images":null,"AdditionalAttributes":{"Appearance":".4 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Timor Hybrid, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"40","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Suca Eraulo, Ermera District","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Timor Leste Taurema","Overview":"Middle roasts tie together unrefined sweetness, roast bittering, and savory nut tones, with cup flavors hinting at  nougat, pistachio, tobacco leaf, amaretto, and Bakers chocolate. Great with a splash of milk! City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/timor-leste-taurema-7205.html","SKU":"GCX-7205","FarmNotes":"This small lot of coffee from Taurema village comes to us by way of the group who run the Daurfusu mill in Dukurai. The main difference here, is that each individual farmer in Taurema are processing their own cherry down to dried parchment before delivering to Daurfusu, rather than selling as whole cherry. In one sense, the coffees are processed in a less uniform way, each by a different individual farmer. But the differences in technique from one farmer to the next also lends to difference, and interest, and can heighten cup complexity. The village of Taurema is located in Eraulo, Letefoho, and at 1900 to 2000 meters above sea level, it's the highest region we are buying from. The Taurema farmer group is 16 members, totaling roughly 100 hectares of land between them, though much of that is devoted to vegetables. We were able the area in 2019 and met with a few of the contributing farmers, including Mario de Dios and Domingos de Jesus, who you'll see in the photos. Taurema is a versatile coffee that proved to function well at medium-to-dark roast levels, and as both brewed coffee and espresso. I don't normally take cream with my coffee, but was surprised to find that I really enjoyed Taurema with a splash of milk, and even some ice on a hot day!","CuppingNotes":"The nutty sweetness found in Taurema places it in a different part of the globe in terms of flavor. Put this on a table of other Southeast Asian coffees, and I'd surely peg it as Central American. City+ to Full City is the sweet spot for my taste, where the intersection of unrefined sugar sweetness balances out the roast bittering, and savory nut tones, and churns out a fairly well-rounded cup profile. The dry fragrance has hints of marzipan, pistachio, and pepitas. A rustic tobacco leaf note is revealed in the wet aroma, and plays some part in the flavor profile too - particularly in the finish. The flavors pair well with milk, and I truly enjoyed the profile of creamy almond nougat with a hint of amaretto that I picked up on after adding just a splash. Without milk, the nuts have a greenish, pistachio flavor, which is leveled off to more Bakers chocolate at Full City. Dark roasts present a bittersweet espresso option too, with rustic and herbal hints adding depth to the flavor, notes like horehound hard candy, and earthy pipe tobacco.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15-17 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Timor Hybrid, Typica","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"18","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Taurema Village, Eraulo, Letefoho","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Yemen Bani Haraz","Overview":"Middle roasts build out a bittersweet chocolate core, expanding to creamy Brazil nut and raw cacao, notes of dried fig, pepitas, chocolate malted grains, brown ale, cooked pumpkin, earthy rhubarb, cola, and some palo santo incense. City+ to French. Good for espresso.*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.","Score":0,"URL":"https://www.sweetmarias.com/yemen-bani-haraz-7181.html","SKU":"GCX-7181","FarmNotes":"*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.Bani Haraz, which we've also referred to as \"Harasi\", is a coffee from the district adjacent to Ismaili, and in fact they merge to some degree. If you travel west on the road from the capital Sana'a, toward Hodeidah on the Red Sea, you will pass quite close to Harasi, as I did when traveling to Yemen a several years back. I visited an amazing zone within Harasi with towering, ancient stone villages, like castles precariously perched atop steep precipice. It was incredibly dramatic. All the coffee here is grown on terraces, since little land exists that is flat, except for the lowland deserts. The coffee is hauled up remarkably steep slopes, carried in small amounts, most often by donkey. This lot was secured through Fatoum Muslot, who took over the family coffee business started by her father back in the 1950s. They've long exported Yemeni coffee, and since Fatoum has started managing the group, she has worked to implement practices such as more stringent hand sorting and using Ecotact storage bags in order to directly affect their coffee's overall quality. We're quite pleased with the physical condition of both coffees we bought from Fatoum this year, and shipping in Ecotact has really helped with the long transit times from Yemen. Read our interview with Fatoum Mouslot from 2020.","CuppingNotes":"Bani Haraz, which we've also referred to as \"Harasi\" is a coffee focused around rustic sweetness, body, and a wilder side of earth and subtle fruit tones that are particularly potent in the middle roast range. The sweetness in the dry fragrance is unrefined, and a lot like the smell of sugar browning in a pan with a smokey bittersweetness to it, along with notes of chocolate pistachio, toasted pumpkin seed, and wood spice hints. The aroma is complex (no surprise, with layers of coconut palm sugar, chocolate raisin, cooked squash, cocoa and allusions to natural dehydrated fruits when breaking through the crust. Harasi should be roasted to City+ minimum, but I really think Full City is a good starting point. Middle roast levels build out a bittersweet chocolate core that expands to include creamy Brazil nut and raw cacao, leaving room for top notes of fruit and rustic leathery notes that add to the cup intensity. The cooling coffee produces flavor aspects of dried fig, pepitas, chocolate malted grains, and a brown ale note in the aftertaste (I wrote \"Newcastle\", but I don't think it's that specific!). There is a cooked pumpkin flavor too that points to pie filling, with earthy rhubarb, cola, and some palo santo incense. My darkest Full City+ roast pushed bittersweet cocoa roast tones to their limit, with wisps of sweet smoke, black licorice, and aromatic apple wood smoke. This viscous coffee also makes an intense shot of espresso on its own, as well as a bittersweet/body ingredient for espresso blending. No matter how you roast it, Harasi will benefit from rest after roasting, and I really think 48 to 72 hours is best, especially for darker roasts.","Images":null,"AdditionalAttributes":{"Appearance":"1 d/300gr, 14-17 Screen - grading conservatively, and surprisingly clean for Yemeni coffee!","Arrival date":"April 2022 Arrival","Bag size":"32 KG","Cultivar Detail":"Heirloom Varietals","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"100","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Bani Haraz","Roast Recommendations":"City+ to French","Type":"Farm Gate"}}
{"Title":"Yemen Khulani Amer","Overview":"Flavors range from sweet to savory, with fruited complexity wrapped into the earthy cup. Rustic bittersweetness, dried apple, goji berry, banana protein shake, Ovaltine, dark cocoa, sesame snacks, leather, za'atar, and Monukka honey. City+ to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/yemen-khulani-amer-7178.html","SKU":"GCX-7178","FarmNotes":"*We're donating ten cents of every pound to Doctors Without Borders who help provide much needed humanitarian relief in the region.\"Khulani\" is the name given to heirloom cultivars selected and cultivated in the Khulan Amer district, Sa'ada. Generally, this is a varietal distinction based on regional cultivation, and includes a subset of varietal types that are dispersed across 6 districts in the Sa'ada Governorate. This particular lot comes from a farmers association in the region called the Khulani Coffee Society for Agricultural Development, who's mission has been to improve both quality and productivity for coffee farmers across the surrounding regions by offering technical support and price stability through their relationships with marketing agents. The coffee is collected from small farmers in the Sana'a mountain growing regions of Saqin, Haidan, Joma'ah Razih, Munabbeh, and Ghamer. To get slightly more granular, 222 farmers in total contributed coffee from their farms to this regional blend, who on average have 1000 trees planted on less than 1/2 hectare of land. Coffee is grown at extremely high altitudes, starting at 1400 meters and topping out at 2500 meters above sea level! This lot was secured through Fatoum Muslot, who runs the family coffee business, Pearl of Tehama, started by her father back in the 1950s. They've long exported Yemeni coffee, and since Fatoum has started managing the group, she has worked to implement practices such as more stringent hand sorting and using Ecotact storage bags in order to directly affect their coffee's overall quality. We're quite pleased with the physical condition of both coffees we bought from Fatoum this year, the lack of underripe coffee and shipping in Ecotact liners has really benefitted the resulting cup quality. During their long history in the coffee trade they've forged longstanding connections with farming groups in several growing regions, and because of these connections, are able to buy coffee in a more direct way.  This It's been a few years now since we've picked up Yemeni coffee, not necessarily by choice, but mainly due to the difficulties exporting from a country at war. The situation there is still quite dire, and I'm amazed that anything is making it out of the country. Read our interview with Fatoum Mouslot from 2020.","CuppingNotes":"Flavors span a range of sweet to savory, and of the four Yemeni coffees we bought, it certainly has the most fruited complexity wrapped into the earthy cup. The smells at City+ and Full City roast levels have some raw sugars offset by brown butter hints, raspberry chocolate, spices, and a whiff of toasted pumpkin seeds. I really enjoyed the interplay of pungent caramelized sugars and savory nutty smells in the wet aroma, accented by a pistachio nut note, and subtle smell of dried fruit leather. The base flavor profile has this delicious fruited bittersweetness that's a little rustic, flanked by a moderate earthiness and interesting hint spice accents. The fruits laid out at City+ include dried apple, dried goji berry, and this powdery fruit aspect like banana protein shake. All of our Yemen's are incredibly complex, and other flavors we jotted down were Ovaltine, dark cocoa powder, sesame snacks, tanned leather, Middle Eastern spices like saffron and za'atar, and a rustic Monukka honey note accenting sweetness. Darker roasting pulls out layer upon layer of bittersweet cocoa characteristics, earthy Medjool date, and an underlying foresty sweetness that doesn't quit. The wild and wooly Yemeni cup is certainly not for everyone, but we've felt a growing, well deserved interest in the unique heirloom varieties and coffee processing culture from the birth place of coffee.","Images":null,"AdditionalAttributes":{"Appearance":"1+ d/300gr, 14+ screen - I'm grading conservatively to temper expectations, but this coffee is a really nice sort for Yemen. You'll likely see a few quakers, broken beans and minor bug holes.","Arrival date":"April 2022 Arrival","Bag size":"32 KG","Cultivar Detail":"Heirloom Cultivars - Audaini, Dawaeri, Tuffahi","Drying Method":"Patio Sun-Dried","Farm Gate":"Yes","Grade":"Grade 1","Lot size":"150","Packaging":"Ecotact Liner","Processing":"Dry Process (Natural)","Recommended for Espresso":"Yes","Region":"Khulan Amer District, Sa'ada","Roast Recommendations":"City+ to Full City+","Type":"Farm Gate"}}
{"Title":"Zambia Dry Process Kateshi Estate","Overview":"Thick body, fruited chocolate, and surprising cup clarity for a dry process coffee. An apple note verges on winey, along dried pear, and an interesting arbol chili hint that reads like spiced mole chocolate. City+ to Full City+.","Score":0,"URL":"https://www.sweetmarias.com/zambia-dry-process-kateshi-estate-7233.html","SKU":"GCX-7233","FarmNotes":"Zambia is not a coffee growing country we see many samples from. There is plenty of coffee being exported from the region, but their coffee-growing history is much younger than those that surround them. The first coffee was planted in Zambia in the 1950s, however, it wasn't until the last few decades that it became a major contributor to Zambia's agri-business sector. Kateshi is one of a cluster of coffee estates are very close to Kasama town, in Zambia's Northern Province. Estates and \"plantations\" make up the bulk of coffees that are exported from Zambia. Altitude at Kateshi ranges from 1300 to 1500 meters above sea level. This is an anaerobic dry process, meaning the coffee cherry is stored in air tight canisters for a couple of days before then laying out to dry on the patio. In our experience, anaerobic process yields wild, and often funky, fruit flavors. Surprisingly, this is not the case with Kateshi! We found the fruit flavors to be pretty well-balanced for a natural (dry process), folded into the sweetness and underlying chocolate bittersweets. There are a lot of Catimor hybrid types grown in the region for disease resistance, which also happen to produce seeds that are quite large and would lend to the AAA grade (the largest grade).","CuppingNotes":"For a dry process coffee, the cup is surprisingly clean in terms of fruit flavors and sweetness, and has an interesting herbal 'twist' that adds a little something extra to the cup. The dry fragrance has an herbal honey sweetness that gives way to some muted dried fruits. The wet aroma has fresh herbs and baking spice notes, like basil, apple pie spice, and a savory hint of safron. The flavors in the brew have surprising cup clarity for a natural (dry process) in the sweetness, like unrefined raw sugars that are accented by subtle fruit notes that do perk up a bit as the coffee cools. An apple note verges on an overripe quality, but still far from winey. Full City roasts have a delicious mix of bittersweet chocolate and fruit, along with an interesting chili note, like arbol chili, that altogether reads like spiced mole chocolate.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 16-19 Screen","Arrival date":"April 2022 Arrival","Bag size":"60 KG","Cultivar Detail":"Catimor","Drying Method":"Patio Sun-Dried","Grade":"AAA and AA","Lot size":"15","Packaging":"GrainPro Liner","Processing":"Dry Process (Natural)","Region":"Kasama","Roast Recommendations":"City+ to Full City+"}}
{"Title":"Zambia Mafinga Peaberry","Overview":"Chewy bittersweetness you can almost sink your teeth into, molasses, cocoa powder, Tootsie Roll chocolate taffy, subtle hints of fruit and fresh herbs, with moderate acidity level. City to Full City+. Good for espresso.","Score":0,"URL":"https://www.sweetmarias.com/zambia-mafinga-peaberry-7304.html","SKU":"GCX-7304","FarmNotes":"Zambia is not a coffee growing country we see many samples from. There is plenty of coffee being exported from the region, but their coffee-growing history is much younger than those that surround them. The first coffee was planted in Zambia in the 1950s, however, it wasn't until the last few decades that it became a major contributor to Zambia's agri-business sector. \"Mafinga\" refers to the highest point in the country, and is where the estate coffees that make up this lot are from. The cluster of coffee estates are very close to Kasama town, in Zambia's Northern Province. Estates and \"plantations\" make up the bulk of coffees that are exported from Zambia. This lot is a peaberry selection, which are the small, round coffee beans that make up a small percentage of every harvest. Peaberries occur when only one of the two ovules inside a coffee cherry germinates, and a single bean forms in the shape of the outer cherry. They don't always taste different from the regular \"flat\" beans, but are often attributed as being denser, which can lead to improved sweetness and acidity.","CuppingNotes":"The dry fragrance has a pleasant bittersweet core, with a faint fruit note, and toffee-like sweetness. The wet aroma has similar toffee/caramel appeal, with substantial cocoa roast tones behind it, and an herbal accent that twists through the steam. City+ brews have a chewy bittersweetness you can almost sink your teeth into. The flavors reminded me of molasses, cocoa powder, and some Tootsie Roll chocolate taffy. The flavors are well balanced, and this Peaberry lot has a moderate level of acidity too, a nice addition to the base flavors. After cooling off a little, the cup offers a subtle dried fruit note, and an herbal hint comes into play in aroma. While I will stick with City+ to capture the acidity/bittersweet combo, folks will find a delicious dark roasted coffee in this Zambia as well.","Images":null,"AdditionalAttributes":{"Appearance":".6 d/300gr, 15 Peaberry Screen","Arrival date":"July 2022 Arrival","Bag size":"60 Kg","Cultivar Detail":"Catimor","Drying Method":"Patio Sun-Dried","Grade":"Peaberry","Lot size":"60","Packaging":"GrainPro Liner","Processing":"Wet Process (Washed)","Recommended for Espresso":"Yes","Region":"Mafinga, Kasama","Roast Recommendations":"City to Full City+"}}
